{
  "slug": "c11-fourth-sunday-in-ordinary-time-february-2-2025",
  "title": "– Fourth Sunday in Ordinary Time",
  "date": "February 2, 2025",
  "theme": "The Song of Simeon and Anna Sunday",
  "year": "C",
  "heroImage": null,
  "sections": [
    {
      "type": "intro-reflection",
      "heading": "Introductory Reflection – The Song of Simeon captivated Rembrandt’s imagination for over 40 years from a masterful painting in 1628 to his final painting in 1669.   Anna dominates this etching with the Holy Ghost over her head, indicating the presence of God.",
      "content": [
        "<p>While the Urantia Gospel focuses on the Song of Simeon (and Anna), Readings 1 and 2 focus on correcting an underlying fault of Christianity reflected by Paul to this day and the corrective measures Jesus took to guard against this error in his own time."
      ]
    },
    {
      "type": "first-reading",
      "heading": "First Reading",
      "citation": "Urantia, Part 1 – The Central and Superuniverses, Paper 4 – God’s Relation to the Universe, Section 5. Erroneous Ideas of God, Paragraph 4 – 7",
      "content": [
        "<p>4:5.4 (60.3) The barbarous idea of appeasing an angry God, of propitiating an offended Lord, of winning the favor of Deity through sacrifices and penance and even by the shedding of blood, represents a religion wholly puerile and primitive, a philosophy unworthy of an enlightened age of science and truth. Such beliefs are utterly repulsive to the celestial beings and the divine rulers who serve and reign in the universes. It is an affront to God to believe, hold, or teach that innocent blood must be shed in order to win his favor or to divert the fictitious divine wrath.",
        "<p>4:5.5 (60.4) The Hebrews believed that “without the shedding of blood there could be no remission of sin.” They had not found deliverance from the old and pagan idea that the Gods could not be appeased except by the sight of blood, though Moses did make a distinct advance when he forbade human sacrifices and substituted therefor, in the primitive minds of his childlike Bedouin followers, the ceremonial sacrifice of animals.",
        "<p>4:5.6 (60.5) The bestowal of a Paradise Son on your world was inherent in the situation of closing a planetary age; it was inescapable, and it was not made necessary for the purpose of winning the favor of God. This bestowal also happened to be the final personal act of a Creator Son in the long adventure of earning the experiential sovereignty  of his universe. What a travesty upon the infinite character of God! this teaching that his fatherly heart in all its austere coldness and hardness was so untouched by the misfortunes and sorrows of his creatures that his tender mercies were not forthcoming until he saw his blameless Son bleeding and dying upon the cross of Calvary!",
        "<p>4:5.7 (60.6) But the inhabitants of Urantia are to find deliverance from these ancient errors and pagan superstitions respecting the nature of the Universal Father. The revelation of the truth about God is appearing, and the human race is destined to know the Universal Father in all that beauty of character and loveliness of attributes so magnificently portrayed by the Creator Son who sojourned on Urantia as the Son of Man and the Son of God.<sup><a href=\"#footnote-1\" id=\"footnote-ref-1\">[1]</a></sup>"
      ],
      "reflection": "<p>In the next <strong>Paper 5 – God- God’s Relation to the Individual</strong> this same Divine Counselor writes in the Introduction:<p>5:0.1 (62.1) If the finite mind of man is unable to comprehend how so great and so majestic a God as the Universal Father can descend from his eternal abode in infinite perfection to fraternize with the individual human creature, then must such a finite intellect rest assurance of divine fellowship upon the truth of the fact that an actual fragment of the living God resides within the intellect of every normal-minded and morally conscious Urantia mortal. The indwelling Thought Adjusters are a part of the eternal Deity of the Paradise Father. Man does not have to go farther than his own inner experience of the soul’s contemplation of this spiritual-reality presence to find God and attempt communion with him."
    },
    {
      "type": "psalm",
      "heading": "Responsorial Psalm",
      "citation": "Psalm 24:7, 8, 9, 10 [2]                                                                            R. (8) “Who is this Holy One of Glory? God, who is strong and valiant.”",
      "response": "",
      "verses": [
        "<p>“Lift up your heads, gates of heaven and the openings of eternity will be lifted. The Holy One of Glory comes.  <br /><strong>R.    “Who is this Holy One of Glory? God, who is strong and valiant.”                 </strong>",
        "<p><strong>“</strong>Who is this Holy One of Glory? God, who is strong and valiant.”                  <strong>      R.    “Who is this Holy One of Glory? God, who is strong and valiant.”                     </strong>",
        "<p>Lift up your heads, gates of heaven; lift up the openings of eternity, The Holy One of Glory comes.”                                                                                                                     <strong>R.  “Who is this Holy One of Glory? God, who is strong and valiant.” </strong>",
        "<p>“Who is this king Holy One of Glory? Creator of the Heavenly Spheres. God is the Holy One of Glory – Selah.” <br /><strong>R.    “Who is this Holy One of Glory? God, who is strong and valiant.” <sup><a href=\"#footnote-3\" id=\"footnote-ref-3\">[3]</a></sup></strong>",
        "<p><strong>Refection – </strong>Pamela Greenberg’s translation not only praises God, the Holy One, but lifts up humanity by eliminating subjugation to “the Lord”, used eight times in today’s short, standard translation."
      ],
      "reflection": null
    },
    {
      "type": "second-reading",
      "heading": "Second Reading",
      "citation": "Urantia, Part IV – The Life and Teachings of Jesus, Paper 155 – Fleeing Through Northern Galilee, Section 6. The Second Discourse on Religion, Paragraphs 8-11",
      "content": [
        "<p>155:6.8 (1732.1) Every race of mankind has its own mental outlook upon human existence; therefore must the religion of the mind ever run true to these various racial viewpoints. Never can the religions of authority come to unification. Human unity and mortal brotherhood can be achieved only by and through the superendowment of the religion of the spirit. Racial minds may differ, but all mankind is indwelt by the same divine and eternal spirit. The hope of human brotherhood can only be realized when, and as, the divergent mind religions of authority become impregnated with, and overshadowed by, the unifying and ennobling religion of the spirit—the religion of personal spiritual experience.",
        "<p>155:6.9 (1732.2) The religions of authority can only divide men and set them in conscientious array against each other; the religion of the spirit will progressively draw men together and cause them to become understandingly sympathetic with one another. The religions of authority require of men uniformity in belief, but this is impossible of realization in the present state of the world. The religion of the spirit requires only unity of experience—uniformity of destiny—making full allowance for diversity of belief. The religion of the spirit requires only uniformity of insight, not uniformity of viewpoint and outlook. The religion of the spirit does not demand uniformity of intellectual views, only unity of spirit feeling. The religions of authority crystallize into lifeless creeds; the religion of the spirit grows into the increasing joy and liberty of ennobling deeds of loving service and merciful ministration.",
        "<p>155:6.10 (1732.3) But watch, lest any of you look with disdain upon the children of Abraham because they have fallen on these evil days of traditional barrenness. <a id=\"_Hlk188694166\"></a>Our forefathers gave themselves up to the persistent and passionate search for God, and they found him as no other whole race of men have ever known him since the times of Adam, who knew much of this as he was himself a Son of God. My Father has not failed to mark the long and untiring struggle of Israel, ever since the days of Moses, to find God and to know God. For weary generations the Jews have not ceased to toil, sweat, groan, travail, and endure the sufferings and experience the sorrows of a misunderstood and despised people, all in order that they might come a little nearer the discovery of the truth about God. And, notwithstanding all the failures and falterings of Israel, our fathers progressively, from Moses to the times of Amos and Hosea, did reveal increasingly to the whole world an ever clearer and more truthful picture of the eternal God. And so was the way prepared for the still greater revelation of the Father which you have been called to share.",
        "<p>155:6.11 (1732.4) Never forget there is only one adventure which is more satisfying and thrilling than the attempt to discover the will of the living God, and that is the supreme experience of honestly trying to do that divine will. And fail not to remember that the will of God can be done in any earthly occupation. Some callings are not holy and others secular. All things are sacred in the lives of those who are spirit led; that is, subordinated to truth, ennobled by love, dominated by mercy, and restrained by fairness—justice. The spirit which my Father and I shall send into the world is not only the Spirit of Truth but also the spirit of idealistic beauty.<sup><a href=\"#footnote-4\" id=\"footnote-ref-4\">[4]</a></sup>"
      ],
      "reflection": "<p>Here Jesus emphasizes the religion of the spirit as opposed to the Hebrew religion of his times and Paul’s Christianity that are both religions of authority.  However it is important that Jesus counseled against distaining the children of Abraham for their current spiritual barrenness, for “Our forefathers gave themselves up to the persistent and passionate search for God.”  Many, many within Christianity have continue a passionate search for God over the centuries."
    },
    {
      "type": "alleluia",
      "heading": "Alleluia",
      "citation": "Urantia 122:9. 24 - 27                                                                                                                      R. Alleluia, alleluia.",
      "content": [
        "<p>For my eyes have seen your salvation, which you have prepared before the face of all peoples; a light for even the unveiling of the gentiles and the glory of your people Israel.",
        "<p><strong>R. Alleluia, alleluia. <sup><a href=\"#footnote-5\" id=\"footnote-ref-5\">[5]</a></sup></strong>"
      ]
    },
    {
      "type": "gospel",
      "heading": "Gospel",
      "citation": "Urantia Part IV – The Life and Teachings of Jesus, Paper 122 - Birth and Infancy of Jesus, Section 9. The Presentation in the Temple, Paragraphs 1-28",
      "content": [
        "<p>122:9.1 (1352.4) Moses had taught the Jews that every first-born son belonged to the Lord, and that, in lieu of his sacrifice as was the custom among the heathen nations, such a son might live provided his parents would redeem him by the payment of five shekels to any authorized priest. There was also a Mosaic ordinance which directed that a mother, after the passing of a certain period of time, should present herself (or have someone make the proper sacrifice for her) at the temple for purification. It was customary to perform both of these ceremonies at the same time. Accordingly, Joseph and Mary went up to the temple at Jerusalem in person to present Jesus to the priests and effect his redemption and also to make the proper sacrifice to insure Mary’s ceremonial purification from the alleged uncleanness of childbirth.",
        "<p>122:9.2 (1353.1) There lingered constantly about the courts of the temple two remarkable characters, Simeon a singer and Anna a poetess. Simeon was a Judean, but Anna was a Galilean. This couple were frequently in each other’s company, and both were intimates of the priest Zacharias, who had confided the secret of John and Jesus to them. Both Simeon and Anna longed for the coming of the Messiah, and their confidence in Zacharias led them to believe that Jesus was the expected deliverer of the Jewish people.",
        "<p>122:9.3 (1353.2) Zacharias knew the day Joseph and Mary were expected to appear at the temple with Jesus, and he had prearranged with Simeon and Anna to indicate, by the salute of his upraised hand, which one in the procession of first-born children was Jesus.",
        "<p>122:9.4 (1353.3) For this occasion Anna had written a poem which Simeon proceeded to sing, much to the astonishment of Joseph, Mary, and all who were assembled in the temple courts. And this was their hymn of the redemption of the first-born son:",
        "<p>122:9.5 – 122:9.27 (1353.4 - 1353.26)",
        "<p>Blessed be the Lord, the God of Israel,                                                                                                                                                                                           For he has visited us and wrought redemption for his people;                                             He has raised up a horn of salvation for all of us                                                          In the house of his servant David.                                                                               Even as he spoke by the mouth of his holy prophets —                                         Salvation from our enemies and from the hand of all who hate us;                        To show mercy to our fathers, and remember his holy covenant —                                   The oath which he swore to Abraham our father                                                    To grant us that we, being delivered out of the hand of our enemies,                         Should serve him without fear                                                                                      In holiness and righteousness before him all our days.                                               Yes, and you, child of promise, shall be called the prophet of the Most High;                        For you shall go before the face of the Lord to establish his kingdom;                 To give knowledge of salvation to his people                                                            In the remission of their sins.                                                                                 Rejoice in the tender mercy of our God because the dayspring from on high has now visited us                                                                                                        To shine upon those who sit in darkness and the shadow of death;                                    To guide our feet into ways of peace<a id=\"_Hlk154734898\"></a>.                                                                         And now let your servant depart in peace, O Lord, according to your word <a id=\"_Hlk154566231\"></a>                    <a id=\"_Hlk188688659\"></a>For my eyes have seen your salvation,                                                            Which you have prepared before the face of all peoples;                                                A light for even the unveiling of the gentiles                                                                And the glory of your people Israel.",
        "<p>122:9.28 (1353.27) On the way back to Bethlehem, Joseph and Mary were silent—confused and overawed. Mary was much disturbed by the farewell salutation of Anna, the aged poetess, and Joseph was not in harmony with this premature effort to make Jesus out to be the expected Messiah of the Jewish people. <sup><a href=\"#footnote-6\" id=\"footnote-ref-6\">[6]</a></sup>"
      ],
      "reflection": "<p>Luke comes closer to the Urantia account when he says, Anna “gave thanks to God and spoke about the child to all who were awaiting the redemption of Jerusalem” than Simeon’s warning to Mary ““Behold, this child is destined for the fall and rise of many in Israel, and to be a sign that will be contradicted - and you yourself a sword will pierce - so that the thoughts of many hearts may be revealed.”  The Urantia account does not convey this warning nor does this particular Rembrandt’s etching.<p>Note that Luke mistakenly states that Joseph, Mary, and Jesus returned to Nazareth. Matthew, not Luke, includes the flight to Egypt to escape Herod. Luke’s closing could just be his picking up their later return to Nazareth, having omitted or discarded the story of Herod’s jealousy and wrath."
    }
  ]
}