{
  "slug": "c16-first-sunday-of-lent-march-9-2025",
  "title": "First Sunday of Lent",
  "date": "March 9, 2025",
  "theme": "“The Temptation” of Jesus",
  "year": "C",
  "heroImage": null,
  "sections": [
    {
      "type": "intro-reflection",
      "heading": "Introductory reflection – According to Urantia the temptation events after Jesus’ baptism described  in Luke’s gospel of today actually occurred about four months earlier in August -September 25 A.D.  Jesus did retreat into the Pella wilderness for forty days after his baptism by John on January 14, 26 A.D, but that retreat was to plan out the remainder of his life work.",
      "content": [
        "<p>In the Urantia account in August 25 A.D. Jesus went up Mount Hermon for forty days to experience alone “his last struggle with the realities of mortal existence” with only “his indwelling Adjuster to guide and sustain him.” <a id=\"_Hlk189762748\"></a>(<strong>Urantia 134:8.2</strong>,)  He was only accompanied by a lad named Tiglath, who brought Jesus provisions every few days.  In the sixth and final week of this retreat in late September 25 A.D. Jesus struggled with and defeated his archenemies from the spiritual world, Lucifer, Satan, and the Urantia Planetary Prince, Caligastia.",
        "<p>Rembrandt’s sketch remarkably captures Jesus’s dialogue with Satan, representing Lucifer."
      ]
    },
    {
      "type": "first-reading",
      "heading": "First Reading",
      "citation": "Urantia, Part IV., The Life and Teachings of Jesus, Paper 120- The Bestowal of Michael on Urantia, Section 2. The Bestowal Limitations, Paragraphs 1b, 2a, and 3 - 5",
      "content": [
        "<p>120:2.1 (1327.1) “1. . . . You will grow up on Urantia as a child of the realm, complete your human education—all the while subject to the will of your Paradise Father—live your life on Urantia as you have determined, terminate your planetary sojourn, and prepare for ascension to your Father to receive from him the supreme sovereignty of your universe.",
        "<p>120:2.2 (1327.2) “2. Apart from your earth mission and your universe revelation, but incidental to both, I counsel that you assume, after you are sufficiently self-conscious of your divine identity, the additional task of technically terminating the Lucifer rebellion in the system of Satania, and that you do all this as the <em>Son of Man;</em> thus, as a mortal creature of the realm, in weakness made powerful by faith-submission to the will of your Father, I suggest that you graciously achieve all you have repeatedly declined arbitrarily to accomplish by power and might when you were so endowed at the time of the inception of this sinful and unjustified rebellion. I would regard it as a fitting climax of your mortal bestowal if you should return to us as the Son of Man, Planetary Prince of Urantia, as well as the Son of God, supreme sovereign of your universe. . . .",
        "<p>120:2.3 (1327.3) “3. When you have succeeded in terminating the Urantia secession, as you undoubtedly will, I counsel you to accept from Gabriel the conference of the title of ‘Planetary Prince of Urantia’ as the eternal recognition by your universe of your final bestowal experience; and that you further do any and all things, consistent with the purport of your bestowal, to atone for the sorrow and confusion brought upon Urantia by the Caligastia betrayal and the subsequent Adamic default.",
        "<p>120:2.4 (1328.1) “4. In accordance with your request, Gabriel and all concerned will co-operate with you in the expressed desire to end your Urantia bestowal with the pronouncement of a dispensational judgment of the realm, accompanied by the termination of an age, the resurrection of the sleeping mortal survivors, and the establishment of the dispensation of the bestowed Spirit of Truth.",
        "<p>120:2.5 (1328.2) “5. As concerns the planet of your bestowal and the immediate generation of men living thereon at the time of your mortal sojourn, I counsel you to function largely in the role of a teacher. Give attention, first, to the liberation and inspiration of man’s spiritual nature. Next, illuminate the darkened human intellect, heal the souls of men, and emancipate their minds from age-old fears. And then, in accordance with your mortal wisdom, minister to the physical well-being and material comfort of your brothers in the flesh. Live the ideal religious life for the inspiration and edification of all your universe. <sup><a href=\"#footnote-1\" id=\"footnote-ref-1\">[1]</a></sup>"
      ],
      "reflection": null
    },
    {
      "type": "psalm",
      "heading": "Responsorial Psalm",
      "citation": "Psalm 91:1-2, 10-11, 12-13, 14-15 [2]                                                         R. (cf. 15b)  “When you call out to me, I will answer.”",
      "response": "",
      "verses": [
        "<p>“The one who dwells in the shelter of the Most High sleeps in the shadow of God’s breast. I name the Eternal my refuge and fortress; my God in whom I place my trust.”  <strong>R. “When you call out to me, I will answer.” </strong>",
        "<p>“You will encounter no sorrow. No plague will come near your tent. The Holy One will command angels to guard you on all your paths.”<br /><strong>R. “When you call out to me, I will answer.” </strong>",
        "<p>“On their hands they will carry you lest you hurt your foot on a rock. Upon lions and cobras you will walk safely; serpents and young lions you will trample down.” <br /><strong>R. “When you call out to me, I will answer.” </strong>",
        "<p><em>“Because you cling to me in love, </em>says God,<em> I will carry you safely away. I will lift you up, for you know my name. When you call out to me, I will answer. I am with you in times of affliction. I will release you from harm and illumine your honor.”  </em>                                                                                                                 <strong>R. “When you call out to me, I will answer.” <sup><a href=\"#footnote-3\" id=\"footnote-ref-3\">[3]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "second-reading",
      "heading": "Second Reading",
      "citation": "Urantia Part IV -  The Life and Teachings of Jesus, Paper 134 – The Transition Years, Section 7. The Thirty-First year (A.D. 25), Paragraphs 6 – 7 and Section 8. The Sojourn on Mount Hermon, Paragraphs 3 - 5.",
      "content": [
        "<p>134:7.6 (1492.6) The indwelling Thought Adjuster now led Jesus to forsake the dwelling places of men and betake himself up to Mount Hermon that he might finish his work of mastering his human mind and complete the task of effecting his full consecration to the remainder of his lifework on earth.",
        "<p>134:7.7 (1492.7) This was one of those unusual and extraordinary epochs in the Master’s earth life on Urantia. Another and very similar one was the experience he passed through when alone in the hills near Pella just subsequent to his baptism. This period of isolation on Mount Hermon marked the termination of his purely human career, that is, the technical termination of the mortal bestowal, while the later isolation marked the beginning of the more divine phase of the bestowal. And Jesus lived alone with God for six weeks on the slopes of Mount Hermon.",
        "<p>134:8.3 (1493.2) Jesus ate frugally while on the mountain; he abstained from all food only a day or two at a time. The superhuman beings who confronted him on this mountain, and with whom he wrestled in spirit, and whom he defeated in power, were <em>real;</em> they were his archenemies in the system of Satania; they were not phantasms of the imagination evolved out of the intellectual vagaries of a weakened and starving mortal who could not distinguish reality from the visions of a disordered mind.",
        "<p>134:8.4 (1493.3) Jesus spent the last three weeks of August and the first three weeks of September on Mount Hermon. During these weeks he finished the mortal task of achieving the circles of mind-understanding and personality-control. Throughout this period of communion with his heavenly Father the indwelling Adjuster also completed the assigned services. The mortal goal of this earth creature was there attained. Only the final phase of mind and Adjuster attunement remained to be consummated.",
        "<p>134:8.5 (1493.4) After more than five weeks of unbroken communion with his Paradise Father, Jesus became absolutely assured of his nature and of the certainty of his triumph over the material levels of time-space personality manifestation. He fully believed in, and did not hesitate to assert, <a id=\"_Hlk158018272\"></a>the ascendancy of his divine nature over his human nature.<sup><a href=\"#footnote-4\" id=\"footnote-ref-4\">[4]</a></sup>"
      ],
      "reflection": "<p><strong>Verse Before the Gospel  - Urantia 134:8.8                                                                                                R. Praise to you Lord Jesus Christ, King of Endless Glory!</strong><p>“Jesus only made reply, ‘The will of my Father in Paradise be done.’”                                 <strong>R. Praise to you Lord Jesus Christ, King of Endless Glory! <sup><a href=\"#footnote-5\" id=\"footnote-ref-5\">[5]</a></sup></strong>"
    },
    {
      "type": "gospel",
      "heading": "Gospel",
      "citation": "Urantia Part IV. The Life and Teachings of Jesus, Paper 134 – The Transition Years, Section 8. The Sojourn on Mount Hermon, Paragraph 6 – 10",
      "content": [
        "<p>134:8.6 (1493.5) Near the end of the mountain sojourn Jesus asked his Father if he might be permitted to hold conference with his Satania enemies as the Son of Man, as (Jesus of Nazareth) Joshua ben Joseph. This request was granted. During the last week on Mount Hermon the great temptation, the universe trial, occurred. Satan (representing Lucifer) and the rebellious Planetary Prince, Caligastia, were present with Jesus and were made fully visible to him. And this “temptation,” this final trial of human loyalty in the face of the misrepresentations of rebel personalities, had not to do with food, temple pinnacles, or presumptuous acts. It had not to do with the kingdoms of this world but with the sovereignty of a mighty and glorious universe. The symbolism of your records was intended for the backward ages of the world’s childlike thought. And subsequent generations should understand what a great struggle the Son of Man passed through that eventful day on Mount Hermon.",
        "<p><a id=\"_Hlk127727727\"></a>134:8.7 (1493.6) To the many proposals and counterproposals of the emissaries of Lucifer, Jesus only made reply: “May the will of my Paradise Father prevail, and you, my rebellious son, may the Ancients of Days judge you divinely. I am your Creator-father; I can hardly judge you justly, and my mercy you have already spurned. I commit you to the adjudication of the Judges of a greater universe.”",
        "<p>134:8.8 (1494.1) To all the Lucifer-suggested compromises and makeshifts, to all such specious proposals about the incarnation bestowal, <a id=\"_Hlk192339603\"></a>Jesus only made reply, “The will of my Father in Paradise be done.” And when the trying ordeal was finished, the detached guardian seraphim returned to Jesus’ side and ministered to him.",
        "<p>134:8.9 (1494.2) On an afternoon in late summer, amid the trees and in the silence of nature, Michael of Nebadon won the unquestioned sovereignty of his universe. On that day he completed the task set for Creator Sons to live to the full the incarnated life in the likeness of mortal flesh on the evolutionary worlds of time and space. The universe announcement of this momentous achievement was not made until the day of his baptism, months afterward, but it all really took place that day on the mountain. And when Jesus came down from his sojourn on Mount Hermon, the Lucifer rebellion in Satania and the Caligastia secession on Urantia were virtually settled. Jesus had paid the last price required of him to attain the sovereignty of his universe, which in itself regulates the status of all rebels and determines that all such future upheavals (if they ever occur) may be dealt with summarily and effectively. Accordingly, it may be seen that the so-called “great temptation” of Jesus took place sometime before his baptism and not just after that event.",
        "<p>134:8.10 (1494.3) At the end of this sojourn on the mountain, as Jesus was making his descent, he met Tiglath coming up to the rendezvous with food. Turning him back, he said only: “The period of rest is over; I must return to my Father’s business.” He was a silent and much changed man as they journeyed back to Dan, where he took leave of the lad, giving him the donkey. He then proceeded south by the same way he had come, to Capernaum. <sup><a href=\"#footnote-6\" id=\"footnote-ref-6\">[6]</a></sup>"
      ],
      "reflection": null
    }
  ]
}