{
  "slug": "c17-second-sunday-of-lent-march-16-2025",
  "title": "Second Sunday of Lent",
  "date": "March 16, 2025",
  "theme": "The Transfiguration of Jesus",
  "year": "C",
  "heroImage": null,
  "sections": [
    {
      "type": "intro-reflection",
      "heading": "Introductory Reflection - Here the transfigured, luminous Jesus is shown in the center as John, Peter, and James witness this miracle. According to Mark, Matthew, and Luke, the two standing figures beside Jesus are the prophet’s Moses and Elijah. In Urantia they were Gabriel and the Father Melchizedek.",
      "content": [
        "<p>This Sunday is near the end of Jesus’s life on earth, his Transfiguration occurring on Monday  August 15, 29 A.D., before Peter, James, and John. This was  just before Jesus’s 35<sup>th</sup> birthday and about 8 months before his resurrection from the dead on Easter Sunday, April 9, 30 A.D."
      ]
    },
    {
      "type": "first-reading",
      "heading": "First Reading",
      "citation": "Urantia Part IV. The Life and Teachings of Jesus , Paper 158 - The Mount of Transfiguration, Section 0. Introduction, Paragraphs 1 and 2.",
      "content": [
        "<p>158:0.1 (1752.1) It was near sundown on Friday afternoon, August 12, A.D. 29, when Jesus and his associates reached the foot of Mount Hermon, near the very place where the lad Tiglath once waited while the Master ascended the mountain alone to settle the spiritual destinies of Urantia and technically to terminate the Lucifer rebellion. And here they sojourned for two days in spiritual preparation for the events so soon to follow.",
        "<p>158:0.2 (1752.2) In a general way, Jesus knew beforehand what was to transpire on the mountain, and he much desired that all his apostles might share this experience. It was to fit them for this revelation of himself that he tarried with them at the foot of the mountain. But they could not attain those spiritual levels which would justify their exposure to the full experience of the visitation of the celestial beings so soon to appear on earth. And since he could not take all of his associates with him, he decided to take only the three who were in the habit of accompanying him on such special vigils. Accordingly, only Peter, James, and John shared even a part of this unique experience with the Master.<sup><a href=\"#footnote-1\" id=\"footnote-ref-1\">[1]</a></sup>"
      ],
      "reflection": null
    },
    {
      "type": "psalm",
      "heading": "Responsorial Psalm",
      "citation": "Psalm 27:1, 7-8, 8-9, 13-14.  [2]                                                                       R. (1a)  “You are my light and my hope.”",
      "response": "",
      "verses": [
        "<p>“You are my light and my hope<strong>; </strong>whom should I fear? You are the strength of my life; before whom should I tremble?<br /><strong>R. “You are my light and my hope.” </strong>",
        "<p>“Listen, God, to my voice when I call out. With compassion, answer my need. It is to you my heart call, “Seek out my face.”  <br /><strong>R. “You are my light and my hope.” </strong>",
        "<p>“Because your face, God, is what I constantly search for. Don’t hide your eyes from me. Don’t push away your faithful in anger. You have always been my help. Don’t tear me out by the roots; don’t abandon me – for you are the one I count on for help.”                           <strong>R. “You are my light and my hope.” </strong>",
        "<p>“If only I could believe that I would see God’s goodness in the land of the living. . . Keep up your hope in God. Strengthen your heart and sturdy it: keep up your hope in God.”<br /><strong>R. “You are my light and my hope.” <sup><a href=\"#footnote-3\" id=\"footnote-ref-3\">[3]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "second-reading",
      "heading": "Second Reading",
      "citation": "Urantia Part IV. The Life and Teachings of Jesus , Paper 158 - The Mount of Transfiguration, Section 1. The Transfiguration, Paragraphs 1 – 2 &amp; 6 - 10 and Section 2. Coming Down the Mountain, Paragraphs 1.",
      "content": [
        "<p>158:1.1 (1752.3) Early on the morning of Monday, August 15, Jesus and the three apostles began the ascent of Mount Hermon, and this was six days after the memorable noontide confession of Peter by the roadside under the mulberry trees.",
        "<p>158:1.2 (1752.4) Jesus had been summoned to go up on the mountain, apart by himself, for the transaction of important matters having to do with the progress of his bestowal in the flesh as this experience was related to the universe of his own creation. It is significant that this extraordinary event was timed to occur while Jesus and the apostles were in the lands of the gentiles, and that it actually transpired on a mountain of the gentiles.",
        "<p>158:1.6 (1753.2) It was about three o’clock on this beautiful afternoon that Jesus took leave of the three apostles, saying: “I go apart by myself for a season to commune with the Father and his messengers; I bid you tarry here and, while awaiting my return, pray that the Father’s will may be done in all your experience in connection with the further bestowal mission of the Son of Man.” And after saying this to them, Jesus withdrew for a long conference with Gabriel and the Father Melchizedek, not returning until about six o’clock. When Jesus saw their anxiety over his prolonged absence, he said: “Why were you afraid? You well know I must be about my Father’s business; wherefore do you doubt when I am not with you? I now declare that the Son of Man has chosen to go through his full life in your midst and as one of you. Be of good cheer; I will not leave you until my work is finished.”",
        "<p>158:1.7 (1753.3) As they partook of their meager evening meal, Peter asked the Master, “How long do we remain on this mountain away from our brethren?” And Jesus answered: “Until you shall see the glory of the Son of Man and know that whatsoever I have declared to you is true.” And they talked over the affairs of the Lucifer rebellion while seated about the glowing embers of their fire until darkness drew on and the apostles’ eyes grew heavy, for they had begun their journey very early that morning.",
        "<p>158:1.8 (1753.4) When the three had been fast asleep for about half an hour, they were suddenly awakened by a near-by crackling sound, and much to their amazement and consternation, on looking about them, they beheld Jesus in intimate converse with two brilliant beings clothed in the habiliments of the light of the celestial world. And Jesus’ face and form shone with the luminosity of a heavenly light. These three conversed in a strange language, but from certain things said, Peter erroneously conjectured that the beings with Jesus were Moses and Elijah; in reality, <a id=\"_Hlk190505475\"></a>they were Gabriel and the Father Melchizedek. The physical controllers had arranged for the apostles to witness this scene because of Jesus’ request.",
        "<p>158:1.9 (1753.5) The three apostles were so badly frightened that they were slow in collecting their wits, but Peter, who was first to recover himself, said, as the dazzling vision faded from before them and they observed Jesus standing alone: “Jesus, Master, it is good to have been here. We rejoice to see this glory. We are loath to go back down to the inglorious world. If you are willing, let us abide here, and we will erect three tents, one for you, one for Moses, and one for Elijah.” And Peter said this because of his confusion, and because nothing else came into his mind at just that moment.",
        "<p>158:1.10 (1753.6) While Peter was yet speaking, a silvery cloud drew near and overshadowed the four of them. The apostles now became greatly frightened, and as they fell down on their faces to worship, they heard a voice, the same that had spoken on the occasion of Jesus’ baptism, say: “This is my beloved Son; give heed to him.” And when the cloud vanished, again was Jesus alone with the three, and he reached down and touched them, saying: “Arise and be not afraid; you shall see greater things than this.” But the apostles were truly afraid; they were a silent and thoughtful trio as they made ready to descend the mountain shortly before midnight.",
        "<p>158:2.1 (1754.1) For about half the distance down the mountain not a word was spoken. Jesus then began the conversation by remarking: “Make certain that you tell no man, not even your brethren, what you have seen and heard on this mountain until the Son of Man has risen from the dead.” The three apostles were shocked and bewildered by the Master’s words, “until the Son of Man has risen from the dead.” They had so recently reaffirmed their faith in him as the Deliverer, the Son of God, and they had just beheld him transfigured in glory before their very eyes, and now he began to talk about “rising from the dead”! <sup><sup><a href=\"#footnote-4\" id=\"footnote-ref-4\">[4]</a></sup></sup>"
      ],
      "reflection": "<p><strong>Verse Before the Gospel – </strong><a href=\"https://bible.usccb.org/bible/matthew/17?5\"><strong>Urantia 158:3.4</strong></a>                                                                                           <strong>R. Praise to you our Father Brother, Path to Endless Glory!</strong><p>“This is my beloved Son; give heed to him.”                                                                     <strong>R. Praise to you our Father Brother, Path to Endless Glory! <sup><a href=\"#footnote-5\" id=\"footnote-ref-5\">[5]</a></sup></strong>"
    },
    {
      "type": "gospel",
      "heading": "Gospel",
      "citation": "Urantia Part IV. The Life and Teachings of Jesus , Paper 158 - The Mount of Transfiguration, Section 3. Meaning of the Transfiguration, Paragraphs 1 -6.",
      "content": [
        "<p>158:3.1 (1755.1) That which Peter, James, and John witnessed on the mount of transfiguration was a fleeting glimpse of a celestial pageant which transpired that eventful day on Mount Hermon. The transfiguration was the occasion of:",
        "<p>158:3.2 (1755.2) 1. The acceptance of the fullness of the bestowal of the incarnated life of Michael on Urantia by the Eternal Mother-Son of Paradise. As far as concerned the requirements of the Eternal Son, Jesus had now received assurance of their fulfillment. And Gabriel brought Jesus that assurance.",
        "<p>158:3.3 (1755.3) 2. The testimony of the satisfaction of the Infinite Spirit as to the fullness of the Urantia bestowal in the likeness of mortal flesh. The universe representative of the Infinite Spirit, the immediate associate of Michael on Salvington and his ever-present coworker, on this occasion spoke through the Father Melchizedek.",
        "<p>158:3.4 (1755.4) Jesus welcomed this testimony regarding the success of his earth mission presented by the messengers of the Eternal Son and the Infinite Spirit, but he noted that his Father did not indicate that the Urantia bestowal was finished; only did the unseen presence of the Father bear witness through Jesus’ Personalized Adjuster, saying, <a id=\"_Hlk158725841\"></a>“This is my beloved Son; give heed to him.” And this was spoken in words to be heard also by the three apostles.",
        "<p>158:3.5 (1755.5) After this celestial visitation Jesus sought to know his Father’s will and decided to pursue the mortal bestowal to its natural end. This was the significance of the transfiguration to Jesus. To the three apostles it was an event marking the entrance of the Master upon the final phase of his earth career as the Son of God and the Son of Man.",
        "<p>158:3.6 (1755.6) After the formal visitation of Gabriel and the Father Melchizedek, Jesus held informal converse with these, his Sons of ministry, and communed with them concerning the affairs of the universe.<sup><a href=\"#footnote-6\" id=\"footnote-ref-6\">[6]</a></sup>"
      ],
      "reflection": null
    }
  ]
}