{
  "slug": "c18-the-third-sunday-of-lent-march-23-2025",
  "title": "Third Sunday of Lent",
  "date": "March 23, 2025",
  "theme": "Right Thinking Sunday",
  "year": "C",
  "heroImage": null,
  "sections": [
    {
      "type": "intro-reflection",
      "heading": "Introductory Reflection – This modern icon depicts the three stories in today’s gospel of Luke and Urantia.  As we shall see, Jesus’s message in the Urantia gospel is positive and affirming while the Luke gospel is more negative with its emphasis on the necessity for repentance.  Luke is more similar to the message of John the Baptist and much of the Hebrew Bible.",
      "content": []
    },
    {
      "type": "first-reading",
      "heading": "First Reading",
      "citation": "Urantia, Part IV. The Life and Teachings of Jesus, Paper 166 – Last Visit to Northern Perea, Section 3. The Sermon at Gerasa, Paragraphs 5 – 8",
      "content": [
        "<p>166:3.5 (1829.2) “But fear not; every one who sincerely desires to find eternal life by entrance into the kingdom of God shall certainly find such everlasting salvation. But you who refuse this salvation will some day see the prophets of the seed of Abraham sit down with the believers of the gentile nations in this glorified kingdom to partake of the bread of life and to refresh themselves with the water thereof. And they who shall thus take the kingdom in spiritual power and by the persistent assaults of living faith will come from the north and the south and from the east and the west. And, behold, many who are first will be last, and those who are last will many times be first.”",
        "<p>166:3.6 (1829.3) This was indeed a new and strange version of the old and familiar proverb of the straight and narrow way.",
        "<p>166:3.7 (1829.4) Slowly the apostles and many of the disciples were learning the meaning of Jesus’ early declaration: “Unless you are born again, born of the spirit, you cannot enter the kingdom of God.” Nevertheless, to all who are honest of heart and sincere in faith, it remains eternally true: “<a id=\"_Hlk190597271\"></a>Behold, I stand at the doors of men’s hearts and knock, and if any man will open to me, I will come in and sup with him and will feed him with the bread of life; we shall be one in spirit and purpose, and so shall we ever be brethren in the long and fruitful service of the search for the Paradise Father.” And so, whether few or many are to be saved altogether depends on whether few or many will heed the invitation: “I am the door, I am the new and living way, and whosoever wills may enter to embark upon the endless truth-search for eternal life.”",
        "<p>166:3.8 (1829.5) Even the apostles were unable fully to comprehend his teaching as to the necessity for using spiritual force for the purpose of breaking through all material resistance and for surmounting every earthly obstacle which might chance to stand in the way of grasping the all-important spiritual values of the new life in the spirit as the liberated sons of God. <sup><a href=\"#footnote-1\" id=\"footnote-ref-1\">[1]</a></sup>"
      ],
      "reflection": "<p>John’s vision in Revelations is echoed in “Behold, I stand at the doors of men’s hearts and knock, and if any man will open to me, I will come in and sup with him and will feed him with the bread of life; we shall be one in spirit and purpose, and so shall we ever be brethren in the long and fruitful service of the search for the Paradise Father.”"
    },
    {
      "type": "psalm",
      "heading": "Responsorial Psalm",
      "citation": "Psalm 103: 1-2, 3-4, 6-7, 8, 11 [2]                                                                 R. (8a) “You are compassionate, generous beyond limits.”",
      "response": "",
      "verses": [
        "<p><a id=\"_Hlk189386049\"></a>“Be wild, O my soul, for the Source of Wisdom; let all my insides praise the Holy Name. Be wild, O my soul, for the Source of Wonder; don’t let me forget all your kindness and help.”<br /><strong>R. “You are compassionate, generous beyond limits.”</strong>",
        "<p>“The one who forgives all my wrongdoings, who heals me from sickness, who recuses my life from the abyss – who wraps me around with love and devotion.” <br /><a id=\"_Hlk190544693\"></a><strong>R. “You are compassionate, generous beyond limits.” </strong>",
        "<p>“You make harmony, bringing justice to all the oppressed. You made your ways known to Moses, your works to all the children of Israel. <br /><strong>R. “You are compassionate, generous beyond limits.” </strong>",
        "<p>“You are compassionate, generous beyond limit, quieting anger, abounding in love.” “For just as heavens tower above the earth, so is your love upon those who hold you in awe.“  <br /><strong>R. “You are compassionate, generous beyond limits.” <sup><a href=\"#footnote-3\" id=\"footnote-ref-3\">[3]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "second-reading",
      "heading": "Second Reading",
      "citation": "Urantia, Part IV. The Life and Teachings of Jesus, Paper 166 – Last Visit to Northern Perea, Section 4. Teaching About Accidents, Paragraph 1 - 3",
      "content": [
        "<p>166:4.1 (1830.1) While most Palestinians ate only two meals a day, it was the custom of Jesus and the apostles, when on a journey, to pause at midday for rest and refreshment. And it was at such a noontide stop on the way to Philadelphia that Thomas asked Jesus: “Master, from hearing your remarks as we journeyed this morning, I would like to inquire whether spiritual beings are concerned in the production of strange and extraordinary events in the material world and, further, to ask whether the angels and other spirit beings are able to prevent accidents.”",
        "<p>166:4.2 (1830.2) In answer to Thomas’s inquiry, Jesus said: “Have I been so long with you, and yet you continue to ask me such questions? Have you failed to observe how the Son of Man lives as one with you and consistently refuses to employ the forces of heaven for his personal sustenance? Do we not all live by the same means whereby all men exist? Do you see the power of the spiritual world manifested in the material life of this world, save for the revelation of the Father and the sometime healing of his afflicted children?",
        "<p>166:4.3 (1830.3) “All too long have your fathers believed that prosperity was the token of divine approval; that adversity was the proof of God’s displeasure. I declare that such beliefs are superstitions. Do you not observe that far greater numbers of the poor joyfully receive the gospel and immediately enter the kingdom? If riches evidence divine favor, why do the rich so many times refuse to believe this good news from heaven?<sup><a href=\"#footnote-4\" id=\"footnote-ref-4\">[4]</a></sup>"
      ],
      "reflection": "<p><strong>Verse Before the Gospel – </strong><a href=\"https://bible.usccb.org/bible/matthew/4?17\"><strong>Urantia 166:4.9</strong></a>  \t\t\t\t\t                                       <strong>R. Praise to you our Father Brother, Path to Endless Glory!  </strong><p>And when they had thus complied with the laws of fruitfulness, since the tree was living and good, they were rewarded with an abundant yield.                                                                        <strong>R. Praise to you our Father Brother, Path to Endless Glory! <sup><a href=\"#footnote-5\" id=\"footnote-ref-5\">[5]</a></sup></strong>"
    },
    {
      "type": "gospel",
      "heading": "Gospel",
      "citation": "Urantia, Part IV. The Life and Teaching of Jesus, Paper 166 – Last Visit to Northern Perea, Section 4. Teachings About Accidents, Paragraphs",
      "content": [
        "<p>166:4.4 (1830.4) “The Father causes his rain to fall on the just and the unjust; the sun likewise shines on the righteous and the unrighteous. You know about those Galileans whose blood Pilate mingled with the sacrifices, but I tell you these Galileans were not in any manner sinners above all their fellows just because this happened to them. You also know about the eighteen men upon whom the tower of Siloam fell, killing them. Think not that these men who were thus destroyed were offenders above all their brethren in Jerusalem. These folks were simply innocent victims of one of the accidents of time.",
        "<p>166:4.5 (1830.5) “There are three groups of events which may occur in your lives:",
        "<p>166:4.6 (1830.6)“1. You may share in those normal happenings which are a part of the life you and your fellows live on the face of the earth.",
        "<p>166:4.7 (1830.7) “2. You may chance to fall victim to one of the accidents of nature, one of the mischances of men, knowing full well that such occurrences are in no way prearranged or otherwise produced by the spiritual forces of the realm.",
        "<p>166:4.8 (1830.8) “3. <a id=\"_Hlk190537700\"></a>You may reap the harvest of your direct efforts to comply with the natural laws governing the world.",
        "<p>166:4.9 (1830.9) “There was a certain man who planted a fig tree in his yard, and when he had many times sought fruit thereon and found none, he called the vinedressers before him and said: ‘Here have I come these three seasons looking for fruit on this fig tree and have found none. Cut down this barren tree; why should it encumber the ground?’ But the head gardener answered his master: ‘Let it alone for one more year so that I may dig around it and put on fertilizer, and then, next year, if it bears no fruit, it shall be cut down.’ <a id=\"_Hlk190594594\"></a>And when they had thus complied with the laws of fruitfulness, since the tree was living and good, they were rewarded with an abundant yield.",
        "<p>166:4.10 (1831.1) “In the matter of sickness and health, you should know that these bodily states are the result of material causes; health is not the smile of heaven, neither is affliction the frown of God.",
        "<p>166:4.11 (1831.2) “The Father’s human children have equal capacity for the reception of material blessings; therefore does he bestow things physical upon the children of men without discrimination. When it comes to the bestowal of spiritual gifts, the Father is limited by man’s capacity for receiving these divine endowments. <a id=\"_Hlk190537767\"></a>Although the Father is no respecter of persons, in the bestowal of spiritual gifts he is limited by man’s faith and by his willingness always to abide by the Father’s will.” <sup><a href=\"#footnote-6\" id=\"footnote-ref-6\">[6]</a></sup>"
      ],
      "reflection": "<p>Luke places emphasis on Jesus telling his listeners that they must repent, if they are to avoid the fate of Galileans, the victims of the falling tower in Siloam, or the unproductive fig tree. Jesus lays out a new, right way of thinking about the accidents of life and spiritual growth.<p>Unfortunately Luke omitted “And when they had thus complied with the laws of fruitfulness, since the tree was living and good, they were rewarded with an abundant yield.”<p>The Urantia text eliminates these negative admonitions to repent, but instead places emphasis on a loving Father who provides for all his children so that they “may reap the harvest of your direct efforts to comply with the natural laws governing the world.”  Moreover, “although the Father is no respecter of persons, in the bestowal of spiritual gifts he is limited by man’s faith and by his willingness always to abide by the Father’s will.”<p>In essence, through adjusting our thinking and attitude so we can more easily follow our Father’s will, we can write our own ticket through the labyrinth of life.<p>Today’s lectionary offers many examples of adjusting our thinking and attitudes."
    }
  ]
}