{
  "slug": "c19-the-fourth-sunday-of-lent-march-30-2025",
  "title": "Fourth Sunday of Lent",
  "date": "March 30, 2025",
  "theme": "The Prodigal Son, the Elder Brother, and the Compassionate Father",
  "year": "C",
  "heroImage": null,
  "sections": [
    {
      "type": "intro-reflection",
      "heading": "Introductory Reflection – This masterpiece from the end of Rembrandt’s life is a fitting assimilation of God’s loving forgiveness for each us, as the father presses the son to his body with both hands, making them as one.  Henri Nouwen in his short book, The Return of the Prodigal Son, alerted me 30 years ago to his interpretation of this parable as also “The Welcome by the Compassionate Father”.  Both are valid titles as the Urantia text and gospel of today explain.  Somehow Rembrandt captures this inexplicable, intimate moment where the servants and elder son remain distant and silent.",
      "content": []
    },
    {
      "type": "first-reading",
      "heading": "First Reading",
      "citation": "Urantia – Part IV. The Life and Teachings of Jesus, Paper 169 – Last Teaching at Pella, Section 1, Parable of the lost Son, Paragraphs 14 – 17",
      "content": [
        "<p>169:1.14 (1853.1) This (the Parable of the Prodigal Son) was one of the most touching and effective of all the parables which Jesus ever presented to impress upon his hearers the Father’s willingness to receive all who seek entrance into the kingdom of heaven.",
        "<p>169:1.15 (1853.2) Jesus was very partial to telling these three stories at the same time. He presented the story of the lost sheep to show that, when men unintentionally stray away from the path of life, the Father is mindful of such <em>lost</em> ones and goes out, with his Sons, the true shepherds of the flock, to seek the lost sheep. He then would recite the story of the coin lost in the house to illustrate how thorough is the divine <em>searching</em> for all who are confused, confounded, or otherwise spiritually blinded by the material cares and accumulations of life. And then he would launch forth into the telling of this parable of the lost son, the reception of the returning prodigal, to show how complete is the <em>restoration</em> of the lost son into his Father’s house and heart.",
        "<p>169:1.16 (1853.3) Many, many times during his years of teaching, Jesus told and retold this story of the prodigal son. This parable and the story of the good Samaritan were his favorite means of teaching the love of the Father and the neighborliness of man.<sup><a href=\"#footnote-1\" id=\"footnote-ref-1\">[1]</a></sup>"
      ],
      "reflection": null
    },
    {
      "type": "psalm",
      "heading": "Responsorial Psalm",
      "citation": "Psalm 34:2-3, 4-5, 6-7. [2]                                                                            R. (9a)  “Taste and see – how good is our Upholder!”",
      "response": "",
      "verses": [
        "<p>“I will bless you, God, at all times, praise of the Highest will be constantly in my mouth.  With you, my soul shines forth glory. When the humble hear, they will rejoice.”            <strong> R. “Taste and see – how good is our Upholder!”</strong>",
        "<p>“Come with me and praise the Creator’s greatness; let us raise the divine name together in praise. I sought the Holy One, and I was answered. From all my nights fears, the Eternal lifted me away.”  <br /><strong>R. “Taste and see – how good is our Upholder!”</strong>",
        "<p>“Those who look toward you stream with radiance; their faces are never darkened by shame. You listened when I cried out in affliction, saving me from all that strangled tight.” <br /><strong>R. “Taste and see – how good is our Upholder!” <sup><a href=\"#footnote-3\" id=\"footnote-ref-3\">[3]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "second-reading",
      "heading": "Second Reading",
      "citation": "Urantia Part IV. The Life and Teaching of Jesus, Paper 169 – Last Teaching at Pella, Section 1. Parable of the Lost Son, Paragraph 1 -5",
      "content": [
        "<p>169:1.1 (1850.8) On Thursday afternoon Jesus talked to the multitude about the “Grace of Salvation.” In the course of this sermon he retold the story of the lost sheep and the lost coin and then added his favorite parable of the prodigal son. Said Jesus:",
        "<p>169:1.2 (1850.9) “You have been admonished by the prophets from Samuel to John that you should seek for God—search for truth. Always have they said, ‘Seek the Lord while he may be found.’ And all such teaching should be taken to heart. But I have come to show you that, while you are seeking to find God, God is likewise seeking to find you. Many times have I told you the story of the good shepherd who left the ninety and nine sheep in the fold while he went forth searching for the one that was lost, and how, when he had found the straying sheep, he laid it over his shoulder and tenderly carried it back to the fold. And when the lost sheep had been restored to the fold, you remember that the good shepherd called in his friends and bade them rejoice with him over the finding of the sheep that had been lost. Again I say there is more joy in heaven over one sinner who repents than over the ninety and nine just persons who need no repentance. The fact that souls are <em>lost</em> only increases the interest of the heavenly Father. I have come to this world to do my Father’s bidding, and it has truly been said of the Son of Man that he is a friend of publicans and sinners.",
        "<p>169:1.3 (1851.1) “You have been taught that divine acceptance comes after your repentance and as a result of all your works of sacrifice and penitence, but I assure you that the Father accepts you even before you have repented and sends the Son and his associates to find you and bring you, with rejoicing, back to the fold, the kingdom of sonship and spiritual progress. You are all like sheep which have gone astray, and I have come to seek and to save those who are lost.",
        "<p>169:1.4 (1851.2) “And you should also remember the story of the woman who, having had ten pieces of silver made into a necklace of adornment, lost one piece, and how she lit the lamp and diligently swept the house and kept up the search until she found the lost piece of silver. And as soon as she found the coin that was lost, she called together her friends and neighbors, saying, ‘Rejoice with me, for I have found the piece that was lost.’ So again I say, there is always joy in the presence of the angels of heaven over one sinner who repents and returns to the Father’s fold. And I tell you this story to impress upon you that the Father and his Son go forth to <em>search</em> for those who are lost, and in this search we employ all influences capable of rendering assistance in our diligent efforts to find those who are lost, those who stand in need of salvation. And so, while the Son of Man goes out in the wilderness to seek for the sheep gone astray, he also searches for the coin which is lost in the house. The sheep wanders away, unintentionally; the coin is covered by the dust of time and obscured by the accumulation of the things of men.<sup><a href=\"#footnote-4\" id=\"footnote-ref-4\">[4]</a></sup>"
      ],
      "reflection": "<p><strong>Verse Before the Gospel – </strong><a href=\"https://bible.usccb.org/bible/matthew/4?17\"><strong>Urantia 169:1.8</strong></a><strong>\t\t\t\t\t                                       </strong><a id=\"_Hlk191803866\"></a><strong>R. Praise to you our Father Brother, Path to Endless Glory!    </strong><p>I will get up and go to my Father and shall say to him: Father, I have sinned against heaven and against you.                                                                                                                                                        <strong>R. Praise to you our Father Brother, Path to Endless Glory! <sup><a href=\"#footnote-5\" id=\"footnote-ref-5\">[5]</a></sup></strong>"
    },
    {
      "type": "gospel",
      "heading": "Gospel",
      "citation": "Urantia Part IV. The Life and Teaching of Jesus, Paper 169 – Last Teaching at Pella, Section 1. Parable of the Lost Son, Paragraph 5 – 13",
      "content": [
        "<p>169:1.5 (1851.3) “And now I would like to tell you the story of a thoughtless son of a well-to-do farmer who <em>deliberately</em> left his father’s house and went off into a foreign land, where he fell into much tribulation. You recall that the sheep strayed away without intention, but this youth left his home with premeditation. It was like this:",
        "<p>169:1.6 (1851.4) “A certain man had two sons; one, the younger, was lighthearted and carefree, always seeking for a good time and shirking responsibility, while his older brother was serious, sober, hard-working, and willing to bear responsibility. Now these two brothers did not get along well together; they were always quarreling and bickering. The younger lad was cheerful and vivacious, but indolent and unreliable; the older son was steady and industrious, at the same time self-centered, surly, and conceited. The younger son enjoyed play but shunned work; the older devoted himself to work but seldom played. This association became so disagreeable that the younger son came to his father and said: ‘Father, give me the third portion of your possessions which would fall to me and allow me to go out into the world to seek my own fortune.’ And when the father heard this request, knowing how unhappy the young man was at home and with his older brother, he divided his property, giving the youth his share.",
        "<p>169:1.7 (1851.5) “Within a few weeks the young man gathered together all his funds and set out upon a journey to a far country, and finding nothing profitable to do which was also pleasurable, he soon wasted all his inheritance in riotous living. And when he had spent all, there arose a prolonged famine in that country, and he found himself in want. And so, when he suffered hunger and his distress was great, he found employment with one of the citizens of that country, who sent him into the fields to feed swine. And the young man would fain have filled himself with the husks which the swine ate, but no one would give him anything.",
        "<p>169:1.8 (1852.1) “One day, when he was very hungry, he came to himself and said: ‘How many hired servants of my father have bread enough and to spare while I perish with hunger, feeding swine off here in a foreign country! I will arise and go to my father, and I will say to him: Father, I have sinned against heaven and against you. I am no more worthy to be called your son; only be willing to make me one of your hired servants.’ And when the young man had reached this decision, he arose and started out for his father’s house.",
        "<p>169:1.9 (1852.2) “Now this father had grieved much for his son; he had missed the cheerful, though thoughtless, lad. This father loved this son and was always on the lookout for his return, so that on the day he approached his home, even while he was yet afar off, the father saw him and, being moved with loving compassion, ran out to meet him, and with affectionate greeting he embraced and kissed him. And after they had thus met, the son looked up into his father’s tearful face and said: ‘Father, I have sinned against heaven and in your sight; I am no more worthy to be called a son’—but the lad did not find opportunity to complete his confession because the overjoyed father said to the servants who had by this time come running up: ‘Bring quickly his best robe, the one I have saved, and put it on him and put the son’s ring on his hand and fetch sandals for his feet.’",
        "<p>169:1.10 (1852.3) “And then, after the happy father had led the footsore and weary lad into the house, he called to his servants: ‘Bring on the fatted calf and kill it, and let us eat and make merry, for this my son was dead and is alive again; he was lost and is found.’ And they all gathered about the father to rejoice with him over the restoration of his son.",
        "<p>169:1.11 (1852.4) “About this time, while they were celebrating, the elder son came in from his day’s work in the field, and as he drew near the house, he heard the music and the dancing. And when he came up to the back door, he called out one of the servants and inquired as to the meaning of all this festivity. And then said the servant: ‘Your long-lost brother has come home, and your father has killed the fatted calf to rejoice over his son’s safe return. Come in that you also may greet your brother and receive him back into your father’s house.’",
        "<p>169:1.12 (1852.5) “But when the older brother heard this, he was so hurt and angry he would not go into the house. When his father heard of his resentment of the welcome of his younger brother, he went out to entreat him. But the older son would not yield to his father’s persuasion. He answered his father, saying: ‘Here these many years have I served you, never transgressing the least of your commands, and yet you never gave me even a kid that I might make merry with my friends. I have remained here to care for you all these years, and you never made rejoicing over my faithful service, but when this your son returns, having squandered your substance with harlots, you make haste to kill the fatted calf and make merry over him.’",
        "<p>169:1.13 (1852.6) “Since this father truly loved both of his sons, he tried to reason with this older one: ‘But, my son, you have all the while been with me, and all this which I have is yours. You could have had a kid at any time you had made friends to share your merriment. But it is only proper that you should now join with me in being glad and merry because of your brother’s return. Think of it, my son, your brother was lost and is found; he has returned alive to us!’”<sup><a href=\"#footnote-6\" id=\"footnote-ref-6\">[6]</a></sup>"
      ],
      "reflection": "<p>Both Urantia and Luke abruptly end without resolution as to what happens with the Elder son.  Nouwen resolves this by pointing out that Jesus is the true elder son, one with the father, obedient to the father.  Another way to look at this is to hold our own prodigal nature and our hardworking, but frequently haughty nature, side by side in the presence of the Compassionate Father for whom we all secretly strive and who is also searching for both his sons."
    }
  ]
}