{
  "slug": "c20-the-fifth-sunday-of-lent-april-6-2025",
  "title": "Fifth Sunday of Lent",
  "date": "April 6, 2025",
  "theme": "The Woman Taken in Adultery",
  "year": "C",
  "heroImage": null,
  "sections": [
    {
      "type": "intro-reflection",
      "heading": "Introductory Reflection -  Rembrandt explored the story of the Woman Taken in Adultery in painting and pen and ink over many years.  This version emphasizes Jesus writing in the sand, once in John’s version, three times in the Urantia version. John, an incredibly reliable reporter of Jesus’ words, in this case must have been mystified by how Jesus got all the accusers to disburse, without saying a word.",
      "content": []
    },
    {
      "type": "first-reading",
      "heading": "First Reading",
      "citation": "Urantia, Part IV. The Life and Teachings of Jesus, Paper 133 – The Return from Rome, Section 3.  At Corinth, Paragraphs 6 - 10",
      "content": [
        "<p>133:3.6 (1472.5) . . . .  One evening as they strolled about Corinth out near where the wall of the citadel ran down to the sea, they were accosted by two public women. Ganid had imbibed the idea, and rightly, that Jesus was a man of high ideals, and that he abhorred everything which partook of uncleanness or savored of evil; accordingly he spoke sharply to these women and rudely motioned them away. When Jesus saw this, he said to Ganid: “You mean well, but you should not presume thus to speak to the children of God, even though they chance to be his erring children. Who are we that we should sit in judgment on these women? Do you happen to know all of the circumstances which led them to resort to such methods of obtaining a livelihood? Stop here with me while we talk about these matters.” The courtesans were astonished at what he said even more than was Ganid.",
        "<p>133:3.7 (1472.6) As they stood there in the moonlight, Jesus went on to say: “There lives within every human mind a divine spirit, the gift of the Father in heaven. This good spirit ever strives to lead us to God, to help us to find God and to know God; but also within mortals there are many natural physical tendencies which the Creator put there to serve the well-being of the individual and the race. Now, oftentimes, men and women become confused in their efforts to understand themselves and to grapple with the manifold difficulties of making a living in a world so largely dominated by selfishness and sin. I perceive, Ganid, that neither of these women is willfully wicked. I can tell by their faces that they have experienced much sorrow; they have suffered much at the hands of an apparently cruel fate; they have not intentionally chosen this sort of life; they have, in discouragement bordering on despair, surrendered to the pressure of the hour and accepted this distasteful means of obtaining a livelihood as the best way out of a situation that to them appeared hopeless. Ganid, some people are really wicked at heart; they deliberately choose to do mean things, but, tell me, as you look into these now tear-stained faces, do you see anything bad or wicked?” And as Jesus paused for his reply, Ganid’s voice choked up as he stammered out his answer: “No, Teacher, I do not. And I apologize for my rudeness to them—I crave their forgiveness.” Then said Jesus: “And I bespeak for them that they have forgiven you as I speak for my Father in heaven that he has forgiven them. Now all of you come with me to a friend’s house where we will seek refreshment and plan for the new and better life ahead.” Up to this time the amazed women had not uttered a word; they looked at each other and silently followed as the men led the way.",
        "<p>133:3.8 (1473.1) Imagine the surprise of Justus’ wife when, at this late hour, Jesus appeared with Ganid and these two strangers, saying: “You will forgive us for coming at this hour, but Ganid and I desire a bite to eat, and we would share it with these our new-found friends, who are also in need of nourishment; and besides all this, we come to you with the thought that you will be interested in counseling with us as to the best way to help these women get a new start in life. They can tell you their story, but I surmise they have had much trouble, and their very presence here in your house testifies how earnestly they crave to know good people, and how willingly they will embrace the opportunity to show all the world—and even the angels of heaven—what brave and noble women they can become.”",
        "<p>133:3.9 (1473.2) When Martha, Justus’ wife, had spread the food on the table, Jesus, taking unexpected leave of them, said: “As it is getting late, and since the young man’s father will be awaiting us, we pray to be excused while we leave you here together—three women—the beloved children of the Most High. And I will pray for your spiritual guidance while you make plans for a new and better life on earth and eternal life in the great beyond.”",
        "<p>133:3.10 (1473.3) Thus did Jesus and Ganid take leave of the women. So far the two courtesans had said nothing; likewise was Ganid speechless. And for a few moments so was Martha, but presently she rose to the occasion and did everything for these strangers that Jesus had hoped for. The elder of these two women died a short time thereafter, with bright hopes of eternal survival, and the younger woman worked at Justus’ place of business and later became a lifelong member of the first Christian church in Corinth.<sup><a href=\"#footnote-1\" id=\"footnote-ref-1\">[1]</a></sup>"
      ],
      "reflection": "<p>This story is reminiscent of the three parables Jesus loved to tell together, the Parable of the Lost Sheep, the Lost Coin and the Prodigal Son.  Here Jesus lives these parables in real life, preparing their salvation and laying the groundwork for Peter and Paul and the spread of his teachings as interpreted largely by Paul."
    },
    {
      "type": "psalm",
      "heading": "Responsorial Psalm",
      "citation": "Psalm 126:1-2, 2-3, 4-5, 6 [2]                                                                           R. (3)  “God will act with wonder toward us; the thought fills us with joy.”",
      "response": "",
      "verses": [
        "<p>“When the Redeemer returns the exiles to Zion we will have been like dreamers. Then our mouths will overflow with laughter, our tongues with cries of joy.”<br /><strong>R. The Lord has done great things for <em>us</em>; we are filled with joy.</strong>",
        "<p>“Then it will be said among the nations, ‘God has acted with grandeur on behalf of these people.’ God will act with wonder toward <em>us;</em> the thought fills us with joy.”      <strong>                                                                                                                    R. “</strong><a id=\"_Hlk192268851\"></a><strong>God will act with wonder toward <em>us;</em> the thought fills us with joy.” </strong>",
        "<p>“The Holy One has glorified us by name – we will be as though having been in the divine presence throughout. Return us, God, from our exile like sudden streambeds in the Negev. Those who plant seeds with tears of sorrow will gather the harvest with songs of joy.”   <br /><strong>R. “God will act with wonder toward <em>us;</em> the thought fills us with joy.” </strong>",
        "<p>“The one who walks even while weeping lifting the seed as he goes, will return with gladness, carrying his sheaves of corn.”.<br /><strong>R. “God will act with wonder toward <em>us;</em> the thought fills us with joy.” <sup><a href=\"#footnote-3\" id=\"footnote-ref-3\">[3]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "second-reading",
      "heading": "Second Reading",
      "citation": "Urantia, Part IV. The Life and Teachings of Jesus, Paper 150 – The Third Preaching Tour, Section 1. The Women’s Evangelistic Corps, Paragraphs 1 – 10",
      "content": [
        "<p>150:1.1 (1678.5) Of all the daring things which Jesus did in connection with his earth career, the most amazing was his sudden announcement on the evening of January 16: “On the morrow we will set apart ten women for the ministering work of the kingdom.” At the beginning of the two weeks’ period during which the apostles and the evangelists were to be absent from Bethsaida on their furlough, Jesus requested David to summon his parents back to their home and to dispatch messengers calling to Bethsaida ten devout women who had served in the administration of the former encampment and the tented infirmary. These women had all listened to the instruction given the young evangelists, but it had never occurred to either themselves or their teachers that Jesus would dare to commission women to teach the gospel of the kingdom and minister to the sick. These ten women selected and commissioned by Jesus were: Susanna, the daughter of the former chazan of the Nazareth synagogue; Joanna, the wife of Chuza, the steward of Herod Antipas; Elizabeth, the daughter of a wealthy Jew of Tiberias and Sepphoris; Martha, the elder sister of Andrew and Peter; Rachel, the sister-in-law of Jude, the Master’s brother in the flesh; Nasanta, the daughter of Elman, the Syrian physician; Milcha, a cousin of the Apostle Thomas; Ruth, the eldest daughter of Matthew Levi; Celta, the daughter of a Roman centurion; and Agaman, a widow of Damascus. Subsequently, Jesus added two other women to this group—Mary Magdalene and Rebecca, the daughter of Joseph of Arimathea.",
        "<p>150:1.2 (1679.1) Jesus authorized these women to effect their own organization and directed Judas to provide funds for their equipment and for pack animals. The ten elected Susanna as their chief and Joanna as their treasurer. From this time on they furnished their own funds; never again did they draw upon Judas for support.",
        "<p>150:1.3 (1679.2) It was most astounding in that day, when women were not even allowed on the main floor of the synagogue (being confined to the women’s gallery), to behold them being recognized as authorized teachers of the new gospel of the kingdom. The charge which Jesus gave these ten women as he set them apart for gospel teaching and ministry was the emancipation proclamation which set free all women and for all time; no more was man to look upon woman as his spiritual inferior. This was a decided shock to even the twelve apostles. Notwithstanding they had many times heard the Master say that “in the kingdom of heaven there is neither rich nor poor, free nor bond, male nor female, all are equally the sons and daughters of God,” they were literally stunned when he proposed formally to commission these ten women as religious teachers and even to permit their traveling about with them. The whole country was stirred up by this proceeding, the enemies of Jesus making great capital out of this move, but everywhere the women believers in the good news stood stanchly behind their chosen sisters and voiced no uncertain approval of this tardy acknowledgment of woman’s place in religious work. And this liberation of women, giving them due recognition, was practiced by the apostles immediately after the Master’s departure, albeit they fell back to the olden customs in subsequent generations. Throughout the early days of the Christian church women teachers and ministers were called <em>deaconesses</em> and were accorded general recognition. But Paul, despite the fact that he conceded all this in theory, never really incorporated it into his own attitude and personally found it difficult to carry out in practice.<sup><a href=\"#footnote-4\" id=\"footnote-ref-4\">[4]</a></sup>"
      ],
      "reflection": "<p><strong>Verse before the Gospel – Urantia 162:3.5                                                                                                                 R. </strong><a id=\"_Hlk192407277\"></a><strong>Praise to you our Father Brother, Path to Endless Glory!</strong><p>And then said Jesus: “I know about you; neither do I condemn you. Go your way in peace.” And this woman, Hildana, forsook her wicked husband and joined herself to the disciples of the kingdom.                                                                                                     <strong>R. Praise to you our Father Brother, Path to Endless Glory! <sup><a href=\"#footnote-5\" id=\"footnote-ref-5\">[5]</a></sup></strong>"
    },
    {
      "type": "gospel",
      "heading": "Gospel",
      "citation": "Urantia Part IV. The Life and Teachings of Jesus, Paper 162 - At the Feast of Tabernacles, Section 3. The Woman Taken in Adultery, Paragraphs 1 - 5",
      "content": [
        "<p>162:3.1 (1792.5) It was during this visit to Jerusalem that Jesus dealt with a certain woman of evil repute who was brought into his presence by her accusers and his enemies. The distorted record you have of this episode would suggest that this woman had been brought before Jesus by the scribes and Pharisees, and that Jesus so dealt with them as to indicate that these religious leaders of the Jews might themselves have been guilty of immorality. Jesus well knew that, while these scribes and Pharisees were spiritually blind and intellectually prejudiced by their loyalty to tradition, they were to be numbered among the most thoroughly moral men of that day and generation.",
        "<p>162:3.2 (1793.1) What really happened was this: Early the third morning of the feast, as Jesus approached the temple, he was met by a group of the hired agents of the Sanhedrin who were dragging a woman along with them. As they came near, the spokesman said: “Master, this woman was taken in adultery—in the very act. Now, the law of Moses commands that we should stone such a woman. What do you say should be done with her?”",
        "<p>162:3.3 (1793.2) It was the plan of Jesus’ enemies, if he upheld the law of Moses requiring that the self-confessed transgressor be stoned, to involve him in difficulty with the Roman rulers, who had denied the Jews the right to inflict the death penalty without the approval of a Roman tribunal. If he forbade stoning the woman, they would accuse him before the Sanhedrin of setting himself up above Moses and the Jewish law. If he remained silent, they would accuse him of cowardice. But the Master so managed the situation that the whole plot fell to pieces of its own sordid weight.",
        "<p>162:3.4 (1793.3) This woman, once comely, was the wife of an inferior citizen of Nazareth, a man who had been a troublemaker for Jesus throughout his youthful days. The man, having married this woman, did most shamefully force her to earn their living by making commerce of her body. He had come up to the feast at Jerusalem that his wife might thus prostitute her physical charms for financial gain. He had entered into a bargain with the hirelings of the Jewish rulers thus to betray his own wife in her commercialized vice. And so they came with the woman and her companion in transgression for the purpose of ensnaring Jesus into making some statement which could be used against him in case of his arrest.",
        "<p>162:3.5 (1793.4) Jesus, looking over the crowd, saw her husband standing behind the others. He knew what sort of man he was and perceived that he was a party to the despicable transaction. Jesus first walked around to near where this degenerate husband stood and wrote upon the sand a few words which caused him to depart in haste. Then he came back before the woman and wrote again upon the ground for the benefit of her would-be accusers; and when they read his words, they, too, went away, one by one. And when the Master had written in the sand the third time, the woman’s companion in evil took his departure, so that, when the Master raised himself up from this writing, he beheld the woman standing alone before him. Jesus said: “Woman, where are your accusers? did no man remain to stone you?” And the woman, lifting up her eyes, answered, “No man, Lord.” And then said Jesus: “I know about you; neither do I condemn you. Go your way in peace.” And this woman, Hildana, forsook her wicked husband and joined herself to the disciples of the kingdom. <sup><a href=\"#footnote-6\" id=\"footnote-ref-6\">[6]</a></sup>"
      ],
      "reflection": null
    }
  ]
}