{
  "slug": "c21-palm-sunday-april-13-2025",
  "title": "Palm Sunday of Jesus’s Passion",
  "date": "April 13, 2025",
  "theme": "Visting the Temple and the Apostle’s Attitude",
  "year": "C",
  "heroImage": null,
  "sections": [
    {
      "type": "intro-reflection",
      "heading": "Introductory Reflection – Palm Sunday has the longest readings of the liturgical year. To shorten the readings for Palm Sunday, I have chosen to cover most of the story of Jesus’s passion over three years, on other days of Holy Week, and on other Sundays throughout the year. The detailed chronological found in Urantia makes this possible.",
      "content": [
        "<p><strong>At the Procession with Palms – </strong><a id=\"_Hlk161497578\"></a><strong>Urantia, Part IV.  The Life and Teachings of Jesus, Paper 172 – Going into Jerusalem, Section 3. The Start for Jerusalem, Paragraph 3 – 9</strong>",
        "<p>172:3.3 (1881.1) Jesus did not decide to make this public entrance into Jerusalem as a last bid for popular favor nor as a final grasp for power. Neither did he do it altogether to satisfy the human longings of his disciples and apostles. Jesus entertained none of the illusions of a fantastic dreamer; he well knew what was to be the outcome of this visit.",
        "<p>172:3.4 (1881.2) Having decided upon making a public entrance into Jerusalem, the Master was confronted with the necessity of choosing a proper method of executing such a resolve. Jesus thought over all of the many more or less contradictory so-called Messianic prophecies, but there seemed to be only one which was at all appropriate for him to follow. Most of these prophetic utterances depicted a king, the son and successor of David, a bold and aggressive temporal deliverer of all Israel from the yoke of foreign domination. But there was one Scripture that had sometimes been associated with the Messiah by those who held more to the spiritual concept of his mission, which Jesus thought might consistently be taken as a guide for his projected entry into Jerusalem. This Scripture was found in Zechariah, and it said: “Rejoice greatly, O daughter of Zion; shout, O daughter of Jerusalem. Behold, your king comes to you. He is just and he brings salvation. He comes as the lowly one, riding upon an ass, upon a colt, the foal of an ass.”",
        "<p>172:3.5 (1881.3) A warrior king always entered a city riding upon a horse; a king on a mission of peace and friendship always entered riding upon an ass. Jesus would not enter Jerusalem as a man on horseback, but he was willing to enter peacefully and with good will as the Son of Man on a donkey.",
        "<p>172:3.6 (1881.4) Jesus had long tried by direct teaching to impress upon his apostles and his disciples that his kingdom was not of this world, that it was a purely spiritual matter; but he had not succeeded in this effort. Now, what he had failed to do by plain and personal teaching, he would attempt to accomplish by a symbolic appeal. Accordingly, right after the noon lunch, Jesus called Peter and John, and after directing them to go over to Bethpage, a neighboring village a little off the main road and a short distance northwest of Bethany, he further said: “Go to Bethpage, and when you come to the junction of the roads, you will find the colt of an ass tied there. Loose the colt and bring it back with you. If anyone asks you why you do this, merely say, ‘The Master has need of him.’” And when the two apostles had gone into Bethpage as the Master had directed, they found the colt tied near his mother in the open street and close to a house on the corner. As Peter began to untie the colt, the owner came over and asked why they did this, and when Peter answered him as Jesus had directed, the man said: “If your Master is Jesus from Galilee, let him have the colt.” And so they returned bringing the colt with them.",
        "<p>172:3.7 (1881.5) By this time several hundred pilgrims had gathered around Jesus and his apostles. Since midforenoon the visitors passing by on their way to the Passover had tarried. Meanwhile, David Zebedee and some of his former messenger associates took it upon themselves to hasten on down to Jerusalem, where they effectively spread the report among the throngs of visiting pilgrims about the temple that Jesus of Nazareth was making a triumphal entry into the city. Accordingly, several thousand of these visitors flocked forth to greet this much-talked-of prophet and wonder-worker, whom some believed to be the Messiah. This multitude, coming out from Jerusalem, met Jesus and the crowd going into the city just after they had passed over the brow of Olivet and had begun the descent into the city.",
        "<p>172:3.8 (1882.1) As the procession started out from Bethany, there was great enthusiasm among the festive crowd of disciples, believers, and visiting pilgrims, many hailing from Galilee and Perea. Just before they started, the twelve women of the original women’s corps, accompanied by some of their associates, arrived on the scene and joined this unique procession as it moved on joyously toward the city.",
        "<p>172:3.9 (1882.2) Before they started, the Alpheus twins put their cloaks on the donkey and held him while the Master got on. As the procession moved toward the summit of Olivet, the festive crowd threw their garments on the ground and brought branches from the near-by trees in order to make a carpet of honor for the donkey bearing the royal Son, the promised Messiah. As the merry crowd moved on toward Jerusalem, they began to sing, or rather to shout in unison, the Psalm, “Hosanna to the son of David; blessed is he who comes in the name of the Lord. Hosanna in the highest. Blessed be the kingdom that comes down from heaven.” <sup><sup><a href=\"#footnote-1\" id=\"footnote-ref-1\">[1]</a></sup></sup>"
      ],
      "reflection": "<p><a id=\"_Hlk192439791\"></a><strong>At the Mass - Reading 1 -  </strong><a id=\"_Hlk193038474\"></a><strong>Urantia, Part IV.  The Life and Teachings of Jesus, Paper 172 – Going into Jerusalem, Section 4. Visting about the Temple, Paragraph 10 – 11</strong><p>172:3.10 (1882.3) Jesus was lighthearted and cheerful as they moved along until he came to the brow of Olivet, where the city and the temple towers came into full view; there the Master stopped the procession, and a great silence came upon all as they beheld him weeping. Looking down upon the vast multitude coming forth from the city to greet him, the Master, with much emotion and with tearful voice, said: “O Jerusalem, if you had only known, even you, at least in this your day, the things which belong to your peace, and which you could so freely have had! But now are these glories about to be hid from your eyes. You are about to reject the Son of Peace and turn your backs upon the gospel of salvation. The days will soon come upon you wherein your enemies will cast a trench around about you and lay siege to you on every side; they shall utterly destroy you, insomuch that not one stone shall be left upon another. And all this shall befall you because you knew not the time of your divine visitation. You are about to reject the gift of God, and all men will reject you.”<p>172:3.11 (1882.4) When he had finished speaking, they began the descent of Olivet and presently were joined by the multitude of visitors who had come from Jerusalem waving palm branches, shouting hosannas, and otherwise expressing gleefulness and good fellowship. The Master had not planned that these crowds should come out from Jerusalem to meet them; that was the work of others. He never premeditated anything which was dramatic. <sup><a href=\"#footnote-2\" id=\"footnote-ref-2\">[2]</a></sup>"
    },
    {
      "type": "psalm",
      "heading": "Responsorial Psalm",
      "citation": "Psalm 22:8-9, 17-18, 19-20, 23-24. [3]                                                             R. (2a)  “My God, my God, why have you forsaken me?”",
      "response": "",
      "verses": [
        "<p>“All who see me mock me. Their mouths fall in astonishment; they shake their heads in contempt.  Whoever turns to God will find relief, for you will save them, taking pleasure in their faith.” <br /><strong>R. My God, my God, why have you abandoned me?</strong>",
        "<p>“Wild dogs surround me. A circle of the wrongful closes in, like a lion craving my hands and legs. I can count all my bones. The gaze at me, staring with greed.” <br /><strong>R.</strong> <strong>“My God, my God, why have you forsaken me?”</strong>",
        "<p>“They divide my clothes among themselves, casting lots upon my garments. But you are God – don’t be distant! My ram of protection, rush to my help!” <br /><strong>R. “My God, my God, why have you forsaken me?”</strong>",
        "<p>“I will proclaim your name to my brothers and sisters. In the midst of an assembly I will shine out your praise. Those who hold you in wonder – give praise. All offspring of Jacob – give thanks to heavenly glory.”  <br /><strong>R.</strong> <strong>“My God, my God, why have you forsaken me?” <sup><a href=\"#footnote-4\" id=\"footnote-ref-4\">[4]</a></sup></strong>"
      ],
      "reflection": "<p>During this hour of approaching death the human mind of Jesus resorted to the repetition of many passages in the Hebrew scriptures, particularly the Psalms. The last conscious thought of the human Jesus was concerned with the repetition in his mind of a portion of the Book of Psalms now known as the twentieth, twenty-first, and twenty-second Psalms. While his lips would often move, he was too weak to utter the words as these passages, which he so well knew by heart, would pass through his mind. Only a few times did those standing by catch some utterance, such as, “I know the Lord will save his anointed,” “Your hand shall find out all my enemies,” and “My God, my God, why have you forsaken me?” Jesus did not for one moment entertain the slightest doubt<strong> </strong>that he had lived in accordance with the Father’s will; and he never doubted that he was now laying down his life in the flesh in accordance with his Father’s will. He did not feel that the Father had forsaken him; he was merely reciting in his vanishing consciousness many Scriptures, among them this twenty-second Psalm, which begins with “My God, my God, why have you forsaken me?” And this happened to be one of the three passages which were spoken with sufficient clearness to be heard by those standing by.<p>From a young age, throughout his life, and at his death the psalms were a great consolation to Jesus. <a id=\"_Hlk193024676\"></a>As can be seen from the last two verses above, the psalm ends on a note of praise."
    },
    {
      "type": "second-reading",
      "heading": "Second Reading",
      "citation": "Urantia, Part IV.  The Life and Teachings of Jesus, Paper 172 – Going into Jerusalem, Section 4. Visting about the Temple, Paragraph 1 – 3",
      "content": [
        "<p>172:4.1 (1883.3) While the Alpheus twins returned the donkey to its owner, Jesus and the ten apostles detached themselves from their immediate associates and strolled about the temple, viewing the preparations for the Passover. No attempt was made to molest Jesus as the Sanhedrin greatly feared the people, and that was, after all, one of the reasons Jesus had for allowing the multitude thus to acclaim him. The apostles little understood that this was the only human procedure which could have been effective in preventing Jesus’ immediate arrest upon entering the city. The Master desired to give the inhabitants of Jerusalem, high and low, as well as the tens of thousands of Passover visitors, this one more and last chance to hear the gospel and receive, if they would, the Son of Peace.",
        "<p>172:4.2 (1883.4) And now, as the evening drew on and the crowds went in quest of nourishment, Jesus and his immediate followers were left alone. What a strange day it had been! The apostles were thoughtful, but speechless. Never, in their years of association with Jesus, had they seen such a day. For a moment they sat down by the treasury, watching the people drop in their contributions: the rich putting much in the receiving box and all giving something in accordance with the extent of their possessions. At last there came along a poor widow, scantily attired, and they observed as she cast two mites (small coppers) into the trumpet. And then said Jesus, calling the attention of the apostles to the widow: “Heed well what you have just seen. This poor widow cast in more than all the others, for all these others, from their superfluity, cast in some trifle as a gift, but this poor woman, even though she is in want, gave all that she had, even her living.”",
        "<p>172:4.3 (1883.5) As the evening drew on, they walked about the temple courts in silence, and after Jesus had surveyed these familiar scenes once more, recalling his emotions in connection with previous visits, not excepting the earlier ones, he said, “Let us go up to Bethany for our rest.” Jesus, with Peter and John, went to the home of Simon, while the other apostles lodged among their friends in Bethany and Bethpage. <sup><a href=\"#footnote-5\" id=\"footnote-ref-5\">[5]</a></sup>"
      ],
      "reflection": "<p><strong>Verse Before the Gospel – Urantia 172:5.1 </strong>                                                                               <strong> R. </strong><a id=\"_Hlk192407277\"></a><strong>Praise to you our Father Brother, Path to Endless Glory!</strong><p>No twelve human beings ever experienced such diverse and inexplicable emotions as now surged through the minds and souls of these ambassadors of the kingdom. These sturdy Galileans were confused and disconcerted; they did not know what to expect next; they were too surprised to be much afraid.                                                              <strong>R. Praise to you our Father Brother, Path to Endless Glory! <sup><a href=\"#footnote-6\" id=\"footnote-ref-6\">[6]</a></sup></strong>"
    },
    {
      "type": "gospel",
      "heading": "Gospel",
      "citation": "Urantia, Part IV.  The Life and Teachings of Jesus, Paper 172 – Going into Jerusalem, Section 5. The Apostles’ Attitude, Paragraph 10 – 13",
      "content": [
        "<p>172:5.10 (1886.2) This Sunday started off as a great day for Simon Zelotes. He saw visions of wonderful doings in Jerusalem the next few days, and in that he was right, but Simon dreamed of the establishment of the new national rule of the Jews, with Jesus on the throne of David. Simon saw the nationalists springing into action as soon as the kingdom was announced, and himself in supreme command of the assembling military forces of the new kingdom. On the way down Olivet he even envisaged the Sanhedrin and all of their sympathizers dead before sunset of that day. He really believed something great was going to happen. He was the noisiest man in the whole multitude. By five o’clock that afternoon he was a silent, crushed, and disillusioned apostle. He never fully recovered from the depression which settled down on him as a result of this day’s shock; at least not until long after the Master’s resurrection.",
        "<p>172:5.11 (1886.3) To the Alpheus twins this was a perfect day. They really enjoyed it all the way through, and not being present during the time of quiet visitation about the temple, they escaped much of the anticlimax of the popular upheaval. They could not possibly understand the downcast behavior of the apostles when they came back to Bethany that evening. In the memory of the twins this was always their day of being nearest heaven on earth. This day was the satisfying climax of their whole career as apostles. And the memory of the elation of this Sunday afternoon carried them on through all of the tragedy of this eventful week, right up to the hour of the crucifixion. It was the most befitting entry of the king the twins could conceive; they enjoyed every moment of the whole pageant. They fully approved of all they saw and long cherished the memory.",
        "<p>172:5.12 (1886.4) Of all the apostles, Judas Iscariot was the most adversely affected by this processional entry into Jerusalem. His mind was in a disagreeable ferment because of the Master’s rebuke the preceding day in connection with Mary’s anointing at the feast in Simon’s house. Judas was disgusted with the whole spectacle. To him it seemed childish, if not indeed ridiculous. As this vengeful apostle looked upon the proceedings of this Sunday afternoon, Jesus seemed to him more to resemble a clown than a king. He heartily resented the whole performance. He shared the views of the Greeks and Romans, who looked down upon anyone who would consent to ride upon an ass or the colt of an ass. By the time the triumphal procession had entered the city, Judas had about made up his mind to abandon the whole idea of such a kingdom; he was almost resolved to forsake all such farcical attempts to establish the kingdom of heaven. And then he thought of the resurrection of Lazarus, and many other things, and decided to stay on with the twelve, at least for another day. Besides, he carried the bag, and he would not desert with the apostolic funds in his possession. On the way back to Bethany that night his conduct did not seem strange since all of the apostles were equally downcast and silent.",
        "<p>172:5.13 (1887.1) Judas was tremendously influenced by the ridicule of his Sadducean friends. No other single factor exerted such a powerful influence on him, in his final determination to forsake Jesus and his fellow apostles, as a certain episode which occurred just as Jesus reached the gate of the city: A prominent Sadducee (a friend of Judas’s family) rushed up to him in a spirit of gleeful ridicule and, slapping him on the back, said: “Why so troubled of countenance, my good friend; cheer up and join us all while we acclaim this Jesus of Nazareth the king of the Jews as he rides through the gates of Jerusalem seated on an ass.” Judas had never shrunk from persecution, but he could not stand this sort of ridicule. With the long-nourished emotion of revenge there was now blended this fatal fear of ridicule, that terrible and fearful feeling of being ashamed of his Master and his fellow apostles. At heart, this ordained ambassador of the kingdom was already a deserter; it only remained for him to find some plausible excuse for an open break with the Master. <sup><a href=\"#footnote-7\" id=\"footnote-ref-7\">[7]</a></sup>"
      ],
      "reflection": "<p>Simon Zelotes indulged in his nationalistic, materialist visions, only to have them crushed at the end of the day.  Simon remained depressed for months, even after the resurrection.<p>The Alpheus twins in their blissful innocence, perhaps their chief characteristic, “enjoyed every moment of the whole pageant.” Thankfully, “they fully approved of all they saw and long cherished the memory.”  They are truly representative of so many of us on this planet.<p>Judas’s underlying character came to the forefront as he found the whole spectacle disgusting, seeing Jesus more as “a clown than a king.” The midwayers’ balanced psychological insights into Judas’s mind and character I find astounding and compassionate."
    }
  ]
}