{
  "slug": "c22-easter-sunday-april-20-2025",
  "title": "– The Resurrection of Jesus - Mass on Easter Day – April 20",
  "date": "2025",
  "theme": "",
  "year": "C",
  "heroImage": null,
  "sections": [
    {
      "type": "intro-reflection",
      "heading": "Introductory Reflection – The Urantia account of Jesus’s resurrection is uncharted territory for nearly all 20th and 21st century minds. The resurrection of Jesus also prefigures our own after death experience. Of equal importance, the Urantia account offers an astonishingly compete, integrated, non-patriarchal view that reflects the divinity and humanity of all involved early Easter morning and after, and how they grappled to understand what had happened.",
      "content": [
        "<p>The 19 morontia appearances will be covered over the six Sundays and Ascension Thursday over the next three years. Over these 40 days Jesus appeared to nearly 1,000 believers from Jerusalem to Bethany to  Emmaus to Philadelphia to Alexandria, Galilee, Samaria, and Phoenicia.",
        "<p>The apostle John in <strong>John 21:1 -14 </strong>chose to close his gospel with Jesus’s appearance by the Sea of Galilee.  It is one of the most dramatic, detailed, and mysterious episodes of Jesus’s post resurrection ministry. This Easter Sunday in year C, Urantia presents the beginnings of his 13<sup>th</sup> appearance and his discussion in general with the apostles and John Mark.  Subsequent discussions and personal advice to John and Peter and then Andrew and James are presented next Sunday.  The discussion and advice to Thomas and Nathaniel, Matthew and Philip, and the Alpheus twins are presented two Sundays from now.",
        "<p>The regular gospel for today, <strong>John 20:1-9</strong>, Urantia corrects and illuminates in <strong>Year A – Easter Sunday.  </strong>"
      ]
    },
    {
      "type": "first-reading",
      "heading": "First Reading",
      "citation": "Urantia, Part IV.  The Life and Teachings of Jesus, Paper 192 – Appearances in Galilee, Section 0. Introduction, Paragraphs 1 – 5",
      "content": [
        "<p>192:0.1 (2045.1) By the time the apostles left Jerusalem for Galilee, the Jewish leaders had quieted down considerably. Since Jesus appeared only to his family of kingdom believers, and since the apostles were in hiding and did no public preaching, the rulers of the Jews concluded that the gospel movement was, after all, effectually crushed. They were, of course, disconcerted by the increasing spread of rumors that Jesus had risen from the dead, but they depended upon the bribed guards effectively to counteract all such reports by their reiteration of the story that a band of his followers had removed the body.",
        "<p>192:0.2 (2045.2) From this time on, until the apostles were dispersed by the rising tide of persecution, Peter was the generally recognized head of the apostolic corps. Jesus never gave him any such authority, and his fellow apostles never formally elected him to such a position of responsibility; he naturally assumed it and held it by common consent and also because he was their chief preacher. From now on public preaching became the main business of the apostles. After their return from Galilee, Matthias, whom they chose to take the place of Judas, became their treasurer.",
        "<p>192:0.3 (2045.3) During the week they tarried in Jerusalem, Mary the mother of Jesus spent much of the time with the women believers who were stopping at the home of Joseph of Arimathea.",
        "<p>192:0.4 (2045.4) Early this Monday morning when the apostles departed for Galilee, John Mark went along. He followed them out of the city, and when they had passed well beyond Bethany, he boldly came up among them, feeling confident they would not send him back.",
        "<p>192:0.5 (2045.5) The apostles paused several times on the way to Galilee to tell the story of their risen Master and therefore did not arrive at Bethsaida until very late on Wednesday night. It was noontime on Thursday before they were all awake and ready to partake of breakfast.<sup><a href=\"#footnote-1\" id=\"footnote-ref-1\">[1]</a></sup>"
      ],
      "reflection": null
    },
    {
      "type": "psalm",
      "heading": "Responsorial Psalm",
      "citation": "Psalm 118:1-2, 16-17, 22-23 [2]                                                                           R. (24) “This is the day that our Source of Joy has made; Let us exult and rejoice in it.”",
      "response": "",
      "verses": [
        "<p>“Give thanks to God for compassion; your kindness exists forever.  Let Israel proclaim it; your kindness exists forever.”                                                                                                         <strong>R.</strong> <strong>“This is the day that our Source of Joy has made; Let us exult and rejoice in it.” </strong>",
        "<p>“The right arm of the Holy is raised; your hand is steadfast with strength. I will not die; I will live – to tell he deeds of the Living God. <br />R. <strong>“This is the day that our Source of Joy has made; Let us exult and rejoice in it.” </strong>",
        "<p>“The rock rejected by builders has become the cornerstone of faith. Coming from the Creator, it was, in our eyes, a wonder.”<br /><strong>R. “This is the day that our Source of Joy has made;  Let us exult and rejoice in it.” <sup><a href=\"#footnote-3\" id=\"footnote-ref-3\">[3]</a></sup>   </strong>"
      ],
      "reflection": null
    },
    {
      "type": "second-reading",
      "heading": "Second Reading",
      "citation": "Urantia, Part IV.  The Life and Teachings of Jesus, Paper 192 – Appearances in Galilee, Section 1.  Appearance by the Lake, Paragraphs 1 - 4",
      "content": [
        "<p>192:1.1 (2045.6) About six o’clock Friday morning, April 21, the morontia Master made his thirteenth appearance, the first in Galilee, to the ten apostles as their boat drew near the shore close to the usual landing place at Bethsaida.",
        "<p>192:1.2 (2045.7) After the apostles had spent the afternoon and early evening of Thursday in waiting at the Zebedee home, Simon Peter suggested that they go fishing. When Peter proposed the fishing trip, all of the apostles decided to go along. All night they toiled with the nets but caught no fish. They did not much mind the failure to make a catch, for they had many interesting experiences to talk over, things which had so recently happened to them at Jerusalem. But when daylight came, they decided to return to Bethsaida. As they neared the shore, they saw someone on the beach, near the boat landing, standing by a fire. At first they thought it was John Mark, who had come down to welcome them back with their catch, but as they drew nearer the shore, they saw they were mistaken—the man was too tall for John. It had occurred to none of them that the person on the shore was the Master. <a id=\"_Hlk132985323\"></a>They did not altogether understand why Jesus wanted to meet with them amidst the scenes of their earlier associations and out in the open in contact with nature, far away from the shut-in environment of Jerusalem with its tragic associations of fear, betrayal, and death. He had told them that, if they would go into Galilee, he would meet them there, and he was about to fulfill that promise.",
        "<p>192:1.3 (2046.1) As they dropped anchor and prepared to enter the small boat for going ashore, the man on the beach called to them, “Lads, have you caught anything?” And when they answered, “No,” he spoke again. “Cast the net on the right side of the boat, and you will find fish.” While they did not know it was Jesus who had directed them, with one accord they cast in the net as they had been instructed, and immediately it was filled, so much so that they were hardly able to draw it up. Now, John Zebedee was quick of perception, and when he saw the heavy-laden net, he perceived that it was the Master who had spoken to them. When this thought came into his mind, he leaned over and whispered to Peter, “It is the Master.” Peter was ever a man of thoughtless action and impetuous devotion; so when John whispered this in his ear, he quickly arose and cast himself into the water that he might the sooner reach the Master’s side. His brethren came up close behind him, having come ashore in the small boat, hauling the net of fishes after them.",
        "<p>192:1.4 (2046.2) By this time John Mark was up and, seeing the apostles coming ashore with the heavy-laden net, ran down the beach to greet them; and when he saw eleven men instead of ten, he surmised that the unrecognized one was the risen Jesus, and as the astonished ten stood by in silence, the youth rushed up to the Master and, kneeling at his feet, said, “My Lord and my Master.” And then Jesus spoke, not as he had in Jerusalem, when he greeted them with “Peace be upon you,” but in commonplace tones he addressed John Mark: “Well, John, I am glad to see you again and in carefree Galilee, where we can have a good visit. Stay with us, John, and have breakfast.” <sup><a href=\"#footnote-4\" id=\"footnote-ref-4\">[4]</a></sup>"
      ],
      "reflection": null
    },
    {
      "type": "alleluia",
      "heading": "Alleluia",
      "citation": "Urantia 192:1.                                                                                                                  R. Alleluia, alleluia.",
      "content": [
        "<p>“Peter had for a moment been shocked at the sight of the coals of fire glowing there on the beach; the scene reminded him so vividly of the midnight fire of charcoal in the courtyard of Annas, where he had disowned the Master, but he shook himself and, kneeling at the Master’s feet, exclaimed, “My Lord and my Master!”",
        "<p><strong>R. Alleluia, alleluia.  <sup><a href=\"#footnote-5\" id=\"footnote-ref-5\">[5]</a></sup></strong>"
      ]
    },
    {
      "type": "gospel",
      "heading": "Gospel",
      "citation": "Urantia, Part IV.  The Life and Teachings of Jesus, Paper 192 – Appearances in Galilee, Section 1. Appearance by the Lake, Paragraphs 5 - 9",
      "content": [
        "<p>192:1.5 (2046.3) As Jesus talked with the young man, the ten were so astonished and surprised that they neglected to haul the net of fish in upon the beach. Now spoke Jesus: <strong>“</strong>Bring in your fish and prepare some for breakfast. Already we have the fire and much bread.”<strong> </strong>",
        "<p>192:1.6 (2046.4) While John Mark had paid homage to the Master, <a id=\"_Hlk195378630\"></a>Peter had for a moment been shocked at the sight of the coals of fire glowing there on the beach; the scene reminded him so vividly of the midnight fire of charcoal in the courtyard of Annas, where he had disowned the Master, but he shook himself and, kneeling at the Master’s feet, exclaimed, “My Lord and my Master!”",
        "<p>192:1.7 (2046.5) Peter then joined his comrades as they hauled in the net. When they had landed their catch, they counted the fish, and there were 153 large ones. And again was the mistake made of calling this another miraculous catch of fish. There was no miracle connected with this episode. It was merely an exercise of the Master’s preknowledge. He knew the fish were there and accordingly directed the apostles where to cast the net.",
        "<p>192:1.8 (2047.1) Jesus spoke to them, saying: “Come now, all of you, to breakfast. Even the twins should sit down while I visit with you; John Mark will dress the fish.” John Mark brought seven good-sized fish, which the Master put on the fire, and when they were cooked, the lad served them to the ten. Then Jesus broke the bread and handed it to John, who in turn served it to the hungry apostles. When they had all been served, Jesus bade John Mark sit down while he himself served the fish and the bread to the lad. And as they ate, Jesus visited with them and recounted their many experiences in Galilee and by this very lake.",
        "<p>192:1.9 (2047.2) This was the third time Jesus had manifested himself to the apostles as a group. When Jesus first addressed them, asking if they had any fish, they did not suspect who he was because it was a common experience for these fishermen on the Sea of Galilee, when they came ashore, to be thus accosted by the fish merchants of Tarichea, who were usually on hand to buy the fresh catches for the drying establishments. <sup><a href=\"#footnote-6\" id=\"footnote-ref-6\">[6]</a></sup>"
      ],
      "reflection": "<p>This may have been Peter’s real catharsis.  At first he was excited to see Jesus, leaping out of the boat, but then shocked at the site of the charcoal fire that reminded him of his betrayal in Annas’s courtyard. To his credit, Peter pulled himself together and followed the much younger John Mark’s faith and enthusiasm, kneeing before Jesus, declaring him to be “My Lord and my Master.”"
    }
  ]
}