{
  "slug": "c23-2nd-sunday-of-easter-april-27-2025",
  "title": "– Second Sunday of Easter",
  "date": "Divine Mercy Sunday - April 27, 2025",
  "theme": "",
  "year": "C",
  "heroImage": null,
  "sections": [
    {
      "type": "intro-reflection",
      "heading": "Introductory Reflection – Today the Urantia second reading describes in detail Jesus’ walk and talk with John and Peter, where he asks each, “Do you love me?” and then when they each say yes, he told each how to manifest this love.  Some of this is reflected in John 21:15-19, the Gospel for Year C, the 3rd Sunday of Easter. In the Urantia gospel reading Jesus asks Andrew and James, “Do you trust me?” and then when they each answer yes, he tells each how to manifest this trust with personalized advice.",
      "content": [
        "<p>Hence, this is not only Divine Mercy Sunday but also Love and Trust Sunday in the Urantia version of this Second Sunday of Easter, Year C.  This George Tooker “Embrace of Peace II” seems to capture both these emotions of love and trust at the moment of the “Greeting of Peace” in the Christian mass, where sexes and race accept and embrace each other.",
        "<p>John’s gospel for today, <strong>John 20:19:31</strong> covers the two appearances to the Apostles in Jerusalem, Appearance 9 in the Urantia sequence to the 10 apostles without Thomas and Appearance 11 in the Urantia sequence to the 11 apostles with Thomas, a week later. In Urantia the appearance to the apostles without Thomas is covered in Year B – the Third Sunday of Easter.  In Urantia the appearance to the apostles with Thomas is covered in <strong>Year B – the Fifth Sunday of Easter.  </strong>"
      ]
    },
    {
      "type": "first-reading",
      "heading": "First Reading",
      "citation": "Urantia, Part IV.  The Life and Teachings of Jesus, Paper 192 – Appearances in Galilee, Section 1. Appearance by the Lake, Paragraphs 10 - 11",
      "content": [
        "<p>192:1.10 (2047.3) Jesus visited with the ten apostles and John Mark for more than an hour, and then he walked up and down the beach, talking with them two and two—but not the same couples he had at first sent out together to teach. All eleven of the apostles had come down from Jerusalem together, but Simon Zelotes grew more and more despondent as they drew near Galilee, so that, when they reached Bethsaida, he forsook his brethren and returned to his home",
        "<p>192:1.11 (2047.4) Before taking leave of them this morning, Jesus directed that two of the apostles should volunteer to go to Simon Zelotes and bring him back that very day. And Peter and Andrew did so.<sup><a href=\"#footnote-1\" id=\"footnote-ref-1\">[1]</a></sup>"
      ],
      "reflection": null
    },
    {
      "type": "psalm",
      "heading": "Responsorial Psalm",
      "citation": "Psalm 118:2-4, 13-15, 22-24  [2]                                                                 R. (1) “Give thanks to God for compassion; your kindness exists forever.”",
      "response": "",
      "verses": [
        "<p>“Let Israel proclaim it: your kindness exists forever. Let the house of Aaron proclaim it: your kindness exists forever.  Let those who hold you in awe proclaim it: your kindness exits forever.”                                                                                                            <strong>R.</strong> <strong>“Give thanks to God for compassion; your kindness exists forever.”</strong>",
        "<p>“They pushed me hard, hoping I would fall, but the Holy One helped me stand straight. My strength and my song is God, source of my salvation. Cry with joy at redemption in the tents of the righteous; your hand is steadfast with strength.” <br /><strong>R.</strong> <strong>“Give thanks to God for compassion; your kindness exists forever.”</strong>",
        "<p>“The rock rejected by builders has become the cornerstone of faith. Coming from the Creator, it was, in our eyes, a wonder.” This is the day our Source of Joy has made; Let us exult and rejoice in it.  <br /><strong>R. “Give thanks to God for compassion; your kindness exists forever.” <sup><a href=\"#footnote-3\" id=\"footnote-ref-3\">[3]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "second-reading",
      "heading": "Second Reading",
      "citation": "Urantia, Part IV.  The Life and Teachings of Jesus, Paper 192 – Appearances in Galilee, Section 2. Visting the Apostles Two and Two, Paragraph 1 - 6",
      "content": [
        "<p>192:2.1 (2047.5) When they had finished breakfast, and while the others sat by the fire, Jesus beckoned to Peter and to John that they should come with him for a stroll on the beach. As they walked along, Jesus said to John, <strong>“</strong>John, do you love me?” And when John answered, “Yes, Master, with all my heart,” the Master said: “Then, John, give up your intolerance and learn to love men as I have loved you. Devote your life to proving that love is the greatest thing in the world. It is the love of God that impels men to seek salvation. <a id=\"_Hlk195279438\"></a>Love is the ancestor of all spiritual goodness, the essence of the true and the beautiful.”",
        "<p>192:2.2 (2047.6) Jesus then turned toward Peter and asked, “Peter, do you love me?” Peter answered, “Lord, you know I love you with all my soul.” Then said Jesus: “If you love me, Peter, feed my lambs. Do not neglect to minister to the weak, the poor, and the young. Preach the gospel without fear or favor; remember always that God is no respecter of persons. Serve your fellow men even as I have served you; forgive your fellow mortals even as I have forgiven you. Let experience teach you the value of meditation and the power of intelligent reflection.”",
        "<p>192:2.3 (2047.7) After they had walked along a little farther, the Master turned to Peter and asked, “Peter, do you really love me?” And then said Simon, “Yes, Lord, you know that I love you.” And again said Jesus: “Then take good care of my sheep. Be a good and a true shepherd to the flock. Betray not their confidence in you. Be not taken by surprise at the enemy’s hand. Be on guard at all times—watch and pray.”",
        "<p>192:2.4 (2047.8) When they had gone a few steps farther, Jesus turned to Peter and, for the third time, asked, “Peter, do you truly love me?” And then Peter, being slightly grieved at the Master’s seeming distrust of him, said with considerable feeling, “Lord, you know all things, and therefore do you know that I really and truly love you.” Then said Jesus: “Feed my sheep. Do not forsake the flock. Be an example and an inspiration to all your fellow shepherds. Love the flock as I have loved you and devote yourself to their welfare even as I have devoted my life to your welfare. And follow after me even to the end.”",
        "<p>192:2.5 (2048.1) Peter took this last statement literally—that he should continue to follow after him—and turning to Jesus, he pointed to John, asking, “If I follow on after you, what shall this man do?” And then, perceiving that Peter had misunderstood his words, Jesus said: “Peter, be not concerned about what your brethren shall do. If I will that John should tarry after you are gone, even until I come back, what is that to you? Only make sure that you follow me.”",
        "<p>192:2.6 (2048.2) This remark spread among the brethren and was received as a statement by Jesus to the effect that John would not die before the Master returned, as many thought and hoped, to establish the kingdom in power and glory. It was this interpretation of what Jesus said that had much to do with getting Simon Zelotes back into service, and keeping him at work.<sup><a href=\"#footnote-4\" id=\"footnote-ref-4\">[4]</a></sup>"
      ],
      "reflection": "<p>Not only is this talk with Peter much more elaborate than in John’s gospel, but it could easily be seen as the real commissioning of Peter as the de facto leader of the apostles and as the successor to Jesus as the earthy Good Shepherd. From what we know from the New Testament and Urantia, Peter did rise to the occasion.  A most interesting aspect concerning the statement that could be construed that Jesus would return during John’s lifetime is that it had much to do with getting Simon Zelotes back in the fold and keeping him motivated. According to Urantia, Simon Zelotes eventually did recover and went into service spreading the gospel up the Nile to the heart of Africa where he eventually died of old age."
    },
    {
      "type": "alleluia",
      "heading": "Alleluia",
      "citation": "Urantia 192:2.7 and 192:2.8                                                                                                                                                     R. Alleluia, alleluia.",
      "content": [
        "<p><strong>\t</strong>“Do you trust me?”",
        "<p><strong>R. Alleluia, alleluia.<sup><a href=\"#footnote-5\" id=\"footnote-ref-5\">[5]</a></sup></strong>"
      ]
    },
    {
      "type": "gospel",
      "heading": "Gospel",
      "citation": "Urantia, Part IV.  The Life and Teachings of Jesus, Paper 192 – Appearances in Galilee, Section 2. Visting the Apostles Two and Two, Paragraphs 7 10",
      "content": [
        "<p>192:2.7 (2048.3) When they returned to the others, Jesus went for a walk and talk with Andrew and James. When they had gone a short distance, Jesus said to Andrew, “Andrew, do you trust me?” And when the former chief of the apostles heard Jesus ask such a question, he stood still and answered, “Yes, Master, of a certainty I trust you, and you know that I do.” Then said Jesus: “Andrew, if you trust me, trust your brethren more—even Peter. I once trusted you with the leadership of your brethren. Now must you trust others as I leave you to go to the Father. When your brethren begin to scatter abroad because of bitter persecutions, be a considerate and wise counselor to James my brother in the flesh when they put heavy burdens upon him which he is not qualified by experience to bear. And then go on trusting, for I will not fail you. When you are through on earth, you shall come to me.”",
        "<p>192:2.8 (2048.4) Then Jesus turned to James, asking, “James, do you trust me?” And of course James replied, “Yes, Master, I trust you with all my heart.” Then said Jesus: “James, if you trust me more, you will be less impatient with your brethren. If you will trust me, it will help you to be kind to the brotherhood of believers. Learn to weigh the consequences of your sayings and your doings. Remember that the reaping is in accordance with the sowing. Pray for tranquillity of spirit and cultivate patience. These graces, with living faith, shall sustain you when the hour comes to drink the cup of sacrifice. But never be dismayed; when you are through on earth, you shall also come to be with me.” <sup><a href=\"#footnote-6\" id=\"footnote-ref-6\">[6]</a></sup>"
      ],
      "reflection": "<p>Jesus asked Andrew to trust others as Jesus had trusted him. In particular he asked Andrew to trust his brother Peter and to also trust James, Jesus’ brother, who would need his advice and counsel. He asks him to then keep on trusting and then gives him hope that when he is through with his earthly toil, he will be with Jesus in the next world. No doubt this meant a tremendous amount to Andrew, who it seems followed Jesus’ advice in his missionary work to Armenia, Asia Minor and eventually Greece where he was crucified in Patrae in Achaia (Greece).<p>Jesus’ response to James, one of the “Sons of Thunder” with his brother John, was more of a warning: Be patient with his brethren. Be kind to other believers. Pray to be tranquil and patient, for what you sow you shall reap. “These graces, with living faith, shall sustain you” when the hour of your death comes. Nonetheless, you shall be with me in the world to come, as well. This advice from the morontia Jesus no doubt helped James as he was the first of the apostles to be martyred as Herod Agrippa greatly feared James. He died with such patience, grace, fortitude, and dignity that his false accuser immediately joined “himself to the disciples of Jesus.”"
    },
    {
      "type": "second-reading",
      "heading": "Second Reading",
      "citation": "Revelation 1:9-11a, 12-13, 17-19",
      "content": [
        "<p>I, John, your brother, who share with you the distress, the kingdom, and the endurance we have in Jesus, found myself on the island called Patmos because I proclaimed God’s word and gave testimony to Jesus. I was caught up in spirit on the Lord’s day and heard behind me a voice as loud as a trumpet, which said, “Write on a scroll what you see.” Then I turned to see whose voice it was that spoke to me, and when I turned, I saw seven gold lampstands and in the midst of the lampstands one like a son of man, wearing an ankle-length robe, with a gold sash around his chest.<br /><br />When I caught sight of him, I fell down at his feet as though dead. He touched me with his right hand and said, “Do not be afraid. I am the first and the last, the one who lives. Once I was dead, but now I am alive forever and ever. I hold the keys to death and the netherworld. Write down, therefore, what you have seen, and what is happening, and what will happen afterwards.” <a href=\"#footnote-ref-4\">↑</a>"
      ],
      "reflection": null
    }
  ]
}