{
  "slug": "c24-3rd-sunday-of-easter-may-4-2025",
  "title": "Third Sunday of Easter",
  "date": "May 4, 2025",
  "theme": "",
  "year": "C",
  "heroImage": null,
  "sections": [
    {
      "type": "intro-reflection",
      "heading": "Introductory reflection – Brother Lawrence as an uneducated lay brother exemplified belief, obedience and service in his life and in his short volume “The Practice of the Prescence of God”. This work reflects Jesus’s questions and messages to the six apostles presented today as one form of living the true gospel of Jesus, akin to the Buddhist practice of mindfulness and Centering Prayer of modern times.",
      "content": []
    },
    {
      "type": "first-reading",
      "heading": "First Reading",
      "citation": "Urantia, Part IV. The Life and Teachings of Jesus, Paper 192 – Appearances in Galilee, Section 2. Visting with the Apostles Two and Two,  Paragraph 13 and 14",
      "content": [
        "<p>192:2.13 (2049.4) Then he walked and talked with the Alpheus twins, James and Judas, and speaking to both of them, he asked, “James and Judas, do you believe in me?” And when they both answered, “Yes, Master, we do believe,” he said: “I will soon leave you. You see that I have already left you in the flesh. I tarry only a short time in this form before I go to my Father. You believe in me—you are my apostles, and you always will be. Go on believing and remembering your association with me, when I am gone, and after you have, perchance, returned to the work you used to do before you came to live with me. <a id=\"_Hlk195865652\"></a>Never allow a change in your outward work to influence your allegiance. Have faith in God to the end of your days on earth. Never forget that, when you are a faith son of God, all upright work of the realm is sacred. Nothing which a son of God does can be common. Do your work, therefore, from this time on, as for God. And when you are through on this world, I have other and better worlds where you shall likewise work for me. And in all of this work, on this world and on other worlds, I will work with you, and my spirit shall dwell within you.”",
        "<p>192:2.14 (2049.5) It was almost ten o’clock when Jesus returned from his visit with the Alpheus twins, and as he left the apostles, he said: “Farewell, until I meet you all on the mount of your ordination tomorrow at noontime.” When he had thus spoken, he vanished from their sight.<sup><a href=\"#footnote-1\" id=\"footnote-ref-1\">[1]</a></sup>"
      ],
      "reflection": "<p>“The twins were good-natured, simple-minded helpers, and everybody loved them. Jesus welcomed these young men of one talent to positions of honor on his personal staff in the kingdom because there are untold millions of other such simple and fear-ridden souls on the worlds of space whom he likewise wishes to welcome into active and believing fellowship with himself and his outpoured Spirit of Truth. Jesus does not look down upon littleness, only upon evil and sin. James and Judas were <em>little,</em> but they were also <em>faithful.</em> They were simple and ignorant, but they were also big-hearted, kind, and generous.”<p>“Soon after their Master was crucified, they returned to their families and nets; their work was done. They had not the ability to go on in the more complex battles of the kingdom. But they lived and died conscious of having been honored and blessed with four years of close and personal association with a Son of God, the sovereign maker of a universe.”"
    },
    {
      "type": "psalm",
      "heading": "Responsorial Psalm",
      "citation": "Psalm 30:2, 4, 5-6, 11-12, 13  [2]                                                               R. (2a) “I will raise you in praise, my Solace, for you have drawn me up.”",
      "response": "",
      "verses": [
        "<p>“I will raise you in praise, my Solace, for you have drawn me up, you have not let my enemies rejoice in my ruin. My Preserver, you lifted my soul from death, kept me alive during my plunge to the pit.”<strong>  </strong><a id=\"_Hlk194751764\"></a><strong>                                                                                                                                R. “I will raise you in praise, my Solace, for you have drawn me up.”  </strong>",
        "<p>“Let those who love God sing out to the Source of Life, and be thankful for memory of the holy. For your anger lasts only a moment; your will is in favor of life.  At night, I went to bed weeping, in the morning – a cry of joy.”<br /><strong>R. “I will raise you in praise, my Solace, for you have drawn me up.”                                   </strong>",
        "<p>“Hear me, God, and show compassion. My Upholder, you have always been my Source of Help. You changed my mourning clothe to dancing, you loosened my sackcloth and covered me with joy. God, my Help, I will spill out gratitude to you forever. <br /><strong>R. “I will raise you in praise, my Solace, for you have drawn me up.”<sup><a href=\"#footnote-3\" id=\"footnote-ref-3\">[3]</a></sup>  </strong>"
      ],
      "reflection": null
    },
    {
      "type": "second-reading",
      "heading": "Second Reading",
      "citation": "Urantia, Part IV. The Life and Teachings of Jesus, Paper 192 – Appearances in Galilee, Section 2. Visting with the Apostles Two and Two, Paragraph 11 and 12",
      "content": [
        "<p>192:2.11 (2049.2) After this the Master talked with Matthew and Philip. To Philip he said, “Philip, do you obey me?” Philip answered, “Yes, Lord, I will obey you even with my life.” Then said Jesus: “If you would obey me, go then into the lands of the gentiles and proclaim this gospel. The prophets have told you that to obey is better than to sacrifice. By faith have you become a God-knowing kingdom son. There is but one law to obey—that is the command to go forth proclaiming the gospel of the kingdom. Cease to fear men; be unafraid to preach the good news of eternal life to your fellows who languish in darkness and hunger for the light of truth. No more, Philip, shall you busy yourself with money and goods. You now are free to preach the glad tidings just as are your brethren. And I will go before you and be with you even to the end.”",
        "<p>192:2.12 (2049.3) And then, speaking to Matthew, the Master asked, “Matthew, do you have it in your heart to obey me?” Matthew answered, “Yes, Lord, I am fully dedicated to doing your will.” Then said the Master: “Matthew, if you would obey me, go forth to teach all peoples this gospel of the kingdom. No longer will you serve your brethren the material things of life; henceforth you are also to proclaim the good news of spiritual salvation. From now on have an eye single only to obeying your commission to preach this gospel of the Father’s kingdom. As I have done the Father’s will on earth, so shall you fulfill the divine commission. Remember, both Jew and gentile are your brethren. Fear no man when you proclaim the saving truths of the gospel of the kingdom of heaven. And where I go, you shall presently come.” <sup><a href=\"#footnote-4\" id=\"footnote-ref-4\">[4]</a></sup>"
      ],
      "reflection": "<p>After Pentecost Philip participated in the reorganization of the apostles and was the first to preach to a non-Jewish population, the hated Samaritans. Philip was crucified at Hierapolis where his courageous wife, a member of the enlarged women’s corps, encouraged him to continue preaching “the glad tidings even to his murderers, and when his strength failed, she began the recital of the story of salvation by faith in Jesus and was silenced only when the irate Jews rushed upon her and stoned her to death. Their eldest daughter, Leah, continued their work, later on becoming the renowned prophetess of Hierapolis.”"
    },
    {
      "type": "alleluia",
      "heading": "Alleluia",
      "citation": "Urantia 192:2.13                                                                                                                                                                              R. Alleluia, alleluia.",
      "content": [
        "<p>“Never allow a change in your outward work to influence your allegiance. Have faith in God to the end of your days on earth. Never forget that, when you are a faith son of God, all upright work of the realm is sacred. Nothing which a son of God does can be common.”                                                                                                                          <strong>R. Alleluia, alleluia. <sup><a href=\"#footnote-5\" id=\"footnote-ref-5\">[5]</a></sup></strong>"
      ]
    },
    {
      "type": "gospel",
      "heading": "Gospel",
      "citation": "Urantia, Part IV. The Life and Teachings of Jesus, Paper 192 – Appearances in Galilee, Section 2. Visting with the Apostles Two and Two, Paragraph 9 and 10",
      "content": [
        "<p>192:2.9 (2048.5) Jesus next talked with Thomas and Nathaniel. Said he to Thomas, “Thomas, do you serve me?” Thomas replied, “Yes, Lord, I serve you now and always.” Then said Jesus: “If you would serve me, serve my brethren in the flesh even as I have served you. And be not weary in this well-doing but persevere as one who has been ordained by God for this service of love. When you have finished your service with me on earth, you shall serve with me in glory. <a id=\"_Hlk195862683\"></a>Thomas, you must cease doubting; you must grow in faith and the knowledge of truth. Believe in God like a child but cease to act so childishly. Have courage; be strong in faith and mighty in the kingdom of God.”",
        "<p>192:2.10 (2049.1) Then said the Master to Nathaniel, “Nathaniel, do you serve me?” And the apostle answered, “Yes, Master, and with an undivided affection.” Then said Jesus: “If, therefore, you serve me with a whole heart, make sure that you are devoted to the welfare of my brethren on earth with tireless affection. Admix friendship with your counsel and add love to your philosophy. Serve your fellow men even as I have served you. Be faithful to men as I have watched over you. Be less critical; expect less of some men and thereby lessen the extent of your disappointment. And when the work down here is over, you shall serve with me on high.” <sup><a href=\"#footnote-6\" id=\"footnote-ref-6\">[6]</a></sup>"
      ],
      "reflection": "<p>Interestingly, Nathaniel was called to add love and friendship to his philosophical nature.  Nathaniel, after the death of his father, Barthlomew, shortly after Pentecost, was the apostle who carried the message of Jesus to Mesopotamia and then to India where he died.  He did not have the advantage of Jesus preparing the way for him as Philip did with the Samaritans and most of the apostles did in the Greco/Roman mediterranean world.<p>The Urantia version of the regular gospel for today is presented in <strong>Year C on Easter Sunday and the Second Sunday of Easter C.</strong><p><strong>Final Reflection –</strong> These six apostles exemplified first belief in Jesus, and then obedience to him, his Spirit of Truth and the presence of God in each of us, The Thought Adjuster in Urantia terms. Lastly came the call to service.  These three elements are exemplified in the life of Brother Lawrence.  Without these three elements the last two elements are impossible, the trust asked for in Andrew and James, and the love asked for in John and Peter to operate with the effectiveness that they did on this complex planet in their time here."
    }
  ]
}