{
  "slug": "c30-the-solemnity-of-the-most-holytrinity-june-15-2025-1",
  "title": "The Solemnity of the Most Holy Trinity – June 15",
  "date": "2025",
  "theme": "",
  "year": "C",
  "heroImage": null,
  "sections": [
    {
      "type": "intro-reflection",
      "heading": "Introductory Reflection – In this haunting masterpiece, the most famous of all Russian icons, the Russian monk, Andrei Rublev, transforms the story of the three angels appearing to Abraham and Sarah at the oak of Mamre into a depiction of the Holy Trinity.",
      "content": [
        "<p>In many interpretations God the Father is considered to be depicted on the left with a house of many mansions in the rear, quietly gesturing a blessing on the cup. Jesus as the Eternal Son is depicted in the center with the Tree of Life behind, with Jesus gesturing towards the cup of death that he accepted in the Garden of Gethsemane.",
        "<p>The angel at the right symbolizes the Infinite Spirit or Holy Spirit, with the mountain behind as a symbol of the spiritual ascent humankind can chose to accept to undertake with the help of the Holy Spirit.",
        "<p>The overall mood of the icon represents that the three persons of the Trinity are of one person (consubstantial) and while seated around a table to talk, their talk seems to be an invisible, silent communion among the three."
      ]
    },
    {
      "type": "first-reading",
      "heading": "First Reading",
      "citation": "Urantia Part I. The Super and Central Universes, Paper 10 - The Paradise Trinity, Section 0. Paragraphs 1 - 3",
      "content": [
        "<p>10:0.1 (108.1) The Paradise Trinity of eternal Deities facilitates the Father’s escape from personality absolutism. The Trinity perfectly associates the limitless expression of God’s infinite personal will with the absoluteness of Deity. The Eternal Son and the various Sons of divine origin, together with the Conjoint Actor and his universe children, effectively provide for the Father’s liberation from the limitations otherwise inherent in primacy, perfection, changelessness, eternity, universality, absoluteness, and infinity.",
        "<p>10:0.2 (108.2) The Paradise Trinity effectively provides for the full expression and perfect revelation of the eternal nature of Deity. The Stationary Sons of the Trinity likewise afford a full and perfect revelation of divine justice. The Trinity is Deity unity, and this unity rests eternally upon the absolute foundations of the divine oneness of the three original and co-ordinate and coexistent personalities, God the Father, God the Son, and God the Spirit.",
        "<p>10:0.3 (108.3) From the present situation on the circle of eternity, looking backward into the endless past, we can discover only one inescapable inevitability in universe affairs, and that is the Paradise Trinity. I deem the Trinity to have been inevitable. As I view the past, present, and future of time, I consider nothing else in all the universe of universes to have been inevitable. The present master universe, viewed in retrospect or in prospect, is unthinkable without the Trinity. Given the Paradise Trinity, we can postulate alternate or even multiple ways of doing all things, but without the Trinity of Father, Son, and Spirit we are unable to conceive how the Infinite could achieve threefold and co-ordinate personalization in the face of the absolute oneness of Deity. No other concept of creation measures up to the Trinity standards of the completeness of the absoluteness inherent in Deity unity coupled with the repleteness of volitional liberation inherent in the threefold personalization of Deity. <strong><sup><a href=\"#footnote-1\" id=\"footnote-ref-1\">[1]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "psalm",
      "heading": "Responsorial Psalm",
      "citation": "Psalm 8:4-5, 6-7, 8-9 [2]                                                                             R. (2a)  “God, our Upholder, how vast is your signature over all the earth.”",
      "response": "",
      "verses": [
        "<p>“When I behold your name in the heavens, the craft of your fingers, the moon and the stars that you fixed immutable.  I think: What is a mortal that you should be mindful of him, offspring of flesh that you should pay her attention?”                                                                                       <strong>R. “God, our Upholder, how vast is your signature over all the earth.”</strong>",
        "<p>“Yet you have made us only slightly less than God. You have encompassed us with glory and splendor. You allow us dominion over the works of your hands; you place everything under our feet,”          <br /><strong>R. “God, our Upholder, how vast is your signature over all the earth.”  </strong>",
        "<p>“flocks of sheep and herds of cattle, all of them every beast of the field. The bird of the sky and fish of the ocean, all that traverses the sea.”<br /><strong>R.</strong> <strong>“God, our Upholder, how vast is your signature over all the earth.” <sup><a href=\"#footnote-3\" id=\"footnote-ref-3\">[3]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "second-reading",
      "heading": "Second Reading",
      "citation": "Urantia Part I. The Super and Central Universes, Paper 10 - The Paradise Trinity, Section 1. Self-Distribution of the First Source and Center, Paragraphs 1 -  6",
      "content": [
        "<p>10:1.1 (108.4) It would seem that the Father, back in eternity, inaugurated a policy of profound self-distribution. There is inherent in the selfless, loving, and lovable nature of the Universal Father something which causes him to reserve to himself the exercise of only those powers and that authority which he apparently finds it impossible to delegate or to bestow.",
        "<p>10:1.2 (108.5) The Universal Father all along has divested himself of every part of himself that was bestowable on any other Creator or creature. He has delegated to his divine Sons and their associated intelligences every power and all authority that could be delegated. He has actually transferred to his Sovereign Sons, in their respective universes, every prerogative of administrative authority that was transferable. In the affairs of a local universe, he has made each Sovereign Creator Son just as perfect, competent, and authoritative as is the Eternal Son in the original and central universe. He has given away, actually bestowed, with the dignity and sanctity of personality possession, all of himself and all of his attributes, everything he possibly could divest himself of, in every way, in every age, in every place, and to every person, and in every universe except that of his central indwelling.",
        "<p>10:1.3 (109.1) Divine personality is not self-centered; self-distribution and sharing of personality characterize divine freewill selfhood. Creatures crave association with other personal creatures; Creators are moved to share divinity with their universe children; the personality of the Infinite is disclosed as the Universal Father, who shares reality of being and equality of self with two co-ordinate personalities, the Eternal Son and the Conjoint Actor.",
        "<p>10:1.4 (109.2) For knowledge concerning the Father’s personality and divine attributes we will always be dependent on the revelations of the Eternal Son, for when the conjoint act of creation was effected, when the Third Person of Deity sprang into personality existence and executed the combined concepts of his divine parents, the Father ceased to exist as the unqualified personality. With the coming into being of the Conjoint Actor and the materialization of the central core of creation, certain eternal changes took place. God gave himself as an absolute personality to his Eternal Son. Thus does the Father bestow the “personality of infinity” upon his only-begotten Son, while they both bestow the “conjoint personality” of their eternal union upon the Infinite Spirit.",
        "<p>10:1.5 (109.3) For these and other reasons beyond the concept of the finite mind, it is exceedingly difficult for the human creature to comprehend God’s infinite father-personality except as it is universally revealed in the Eternal Son and, with the Son, is universally active in the Infinite Spirit.",
        "<p>10:1.6 (109.4) Since the Paradise Sons of God visit the evolutionary worlds and sometimes even there dwell in the likeness of mortal flesh, and since these bestowals make it possible for mortal man actually to know something of the nature and character of divine personality, therefore must the creatures of the planetary spheres look to the bestowals of these Paradise Sons for reliable and trustworthy information regarding the Father, the Son, and the Spirit. <sup><a href=\"#footnote-4\" id=\"footnote-ref-4\">[4]</a></sup>"
      ],
      "reflection": null
    },
    {
      "type": "alleluia",
      "heading": "Alleluia",
      "citation": "Urantia 1:8                                                                                                             R. Alleluia, alleluia.",
      "content": [
        "<p>Accordingly, did Michael, during the experience of each of his universe bestowals, successfully and acceptably voluntarily subordinate himself to the variously constituted wills of the diverse associations of the persons of the Paradise Trinity.                                                                                                   <strong>R.</strong> <strong>Alleluia, alleluia. <sup><a href=\"#footnote-5\" id=\"footnote-ref-5\">[5]</a></sup></strong>"
      ]
    },
    {
      "type": "gospel",
      "heading": "Gospel",
      "citation": "Urantia, Part IV. The Life and Teachings of Jesus, Paper 120 - The Bestowal of Michael on Urantia, Section 0., Paragraphs 1 – 2 and 4 - 5",
      "content": [
        "<p>120:0.1 (1323.1) Assigned by Gabriel to supervise the restatement of the life of Michael when on Urantia and in the likeness of mortal flesh, I, the Melchizedek director of the revelatory commission intrusted with this task, am authorized to present this narrative of certain events which immediately preceded the Creator Son’s arrival on Urantia to embark upon the terminal phase of his universe bestowal experience. To live such identical lives as he imposes upon the intelligent beings of his own creation, thus to bestow himself in the likeness of his various orders of created beings, is a part of the price which every Creator Son must pay for the full and supreme sovereignty of his self-made universe of things and beings.",
        "<p>120:0.2 (1323.2) Before the events I am about to delineate, Michael of Nebadon had bestowed himself six times after the similitude of six differing orders of his diverse creation of intelligent beings. Then he prepared to descend upon Urantia in the likeness of mortal flesh, the lowest order of his intelligent will creatures, and, as such a human of the material realm, to execute the final act in the drama of the acquirement of universe sovereignty in accordance with the mandates of the divine Paradise Rulers of the universe of universes. . . .",
        "<p>120:0.4 (1324.1) Michael, therefore, had a double purpose in the making of these seven bestowals upon the various orders of his universe creatures: First, he was completing the required experience in creature understanding which is demanded of all Creator Sons before they assume complete sovereignty. At any time a Creator Son may rule his universe in his own right, but he can rule as the supreme representative of the Paradise Trinity only after passing through the seven universe-creature bestowals. Second, he was aspiring to the privilege of representing the maximum authority of the Paradise Trinity which can be exercised in the direct and personal administration of a local universe. <a id=\"_Hlk197953066\"></a>Accordingly, did Michael, during the experience of each of his universe bestowals, successfully and acceptably voluntarily subordinate himself to the variously constituted wills of the diverse associations of the persons of the Paradise Trinity. That is, on the first bestowal he was subject to the combined will of the Father, Son, and Spirit; on the second bestowal to the will of the Father and the Son; on the third bestowal to the will of the Father and the Spirit; on the fourth bestowal to the will of the Son and the Spirit; on the fifth bestowal to the will of the Infinite Spirit; on the sixth bestowal to the will of the Eternal Son; and during the seventh and final bestowal, on Urantia, to the will of the Universal Father.<sup><a href=\"#footnote-6\" id=\"footnote-ref-6\">[6]</a></sup>"
      ],
      "reflection": "<p><a id=\"_Hlk198279876\"></a>Glory to our Universal Father, Glory to our gracious, Eternal Son, Glory be to our Infinite Spirit, Glory be to our Father and our Son, Glory be to our Son and our Sprit, Glory to our Father and Spirit, Glory to our Paradise Trinity, Glory to our Isle of Paradise be. Amen.<p>Glory be to our Universal Father and to our gracious, Eternal Son and to our Infinite Spirit, as it was in the beginning, is now, and ever shall be, on our journey without end. Amen."
    }
  ]
}