{
  "slug": "c31-the-solemnity-of-the-body-and-blood-of-christ-june-22-2025-docx-1",
  "title": "The Solemnity of the Body and Blood of Christ – June 22",
  "date": "2025",
  "theme": "",
  "year": "C",
  "heroImage": null,
  "sections": [
    {
      "type": "intro-reflection",
      "heading": "Introductory Reflection – Above, Bartolomé Esteban Murillo, the Spanish contemporary of Rembrandt, depicts the miracle of the loaves and fishes or the feeding of the 5,000, covered by Luke’s gospel of today.  What Luke, Mark and Matthew do not record is the crowds attempt to make Jesus king after this.  Only John 6:15 records “Therefore when Jesus perceived that they were about to come and take him by force to make him king, he departed again to the mountain by himself alone.”",
      "content": [
        "<p>This is actually the most important part of this episode, so the Urantia gospel covers this attempt and Jesus’s response.  Reading 2 covers the Urantia version of this miracle in detail.  Reading 1 provides background on who Melchizedek actually was as he is referred to in Reading 1 and is a forerunner of Jesus."
      ]
    },
    {
      "type": "first-reading",
      "heading": "First Reading",
      "citation": "Urantia, Part III. The History of Urantia, Paper 93 - Machiventa Melchizedek, Section 1. The Machiventa Incarnation, Paragraphs 1, Section 3. Melchizedek’s Teachings, Paragraphs 6 – 8, and Section 4, Paragraph 14 -16",
      "content": [
        "<p>93:1.1 (1014.3) Revealed truth was threatened with extinction during the millenniums which followed the miscarriage of the Adamic mission on Urantia. Though making progress intellectually, the human races were slowly losing ground spiritually. About 3000 B. C. the concept of God had grown very hazy in the minds of men. . . .",
        "<p>93:3.6 (1016.8) Melchizedek taught his followers all they had capacity to receive and assimilate. Even many modern religious ideas about heaven and earth, of man, God, and angels, are not far removed from these teachings of Melchizedek. But this great teacher subordinated everything to the doctrine of one God, a universe Deity, a heavenly Creator, a divine Father. Emphasis was placed upon this teaching for the purpose of appealing to man’s adoration and of preparing the way for the subsequent appearance of Michael as the Son of this same Universal Father.",
        "<p>93:3.7 (1017.1) Melchizedek taught that at some future time another Son of God would come in the flesh as he had come, but that he would be born of a woman; and that is why numerous later teachers held that Jesus was a priest, or minister, “forever after the order of Melchizedek.”",
        "<p>93:3.8 (1017.2) And thus did Melchizedek prepare the way and set the monotheistic stage of world tendency for the bestowal of an actual Paradise Son of the one God, whom he so vividly portrayed as the Father of all, and whom he represented to Abraham as a God who would accept man on the simple terms of personal faith. And Michael, when he appeared on earth, confirmed all that Melchizedek had taught concerning the Paradise Father. . . .",
        "<p>93:4.14 (1018.3) While no sacrifices were permitted within the colony, Melchizedek well knew how difficult it is to suddenly uproot long-established customs and accordingly had wisely offered these people the substitute of a sacrament of bread and wine for the older sacrifice of flesh and blood. It is of record, “Melchizedek, king of Salem, brought forth bread and wine.” But even this cautious innovation was not altogether successful; the various tribes all maintained auxiliary centers on the outskirts of Salem where they offered sacrifices and burnt offerings. Even Abraham resorted to this barbarous practice after his victory over Chedorlaomer; he simply did not feel quite at ease until he had offered a conventional sacrifice. And Melchizedek never did succeed in fully eradicating this proclivity to sacrifice from the religious practices of his followers, even of Abraham. <strong><sup><a href=\"#footnote-1\" id=\"footnote-ref-1\">[1]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "psalm",
      "heading": "Responsorial Psalm",
      "citation": "Psalm 110:1, 2, 3, 4 [2]                                                                                     R. (4b)  “You will be priest forever, as I vowed of Malchitzedek, the virtuous king.”",
      "response": "",
      "verses": [
        "<p>“Wait at my right until I make your enemies your footstool.”<br /><strong>R. “You will be priest forever, as I vowed of Malchitzedek, the virtuous king.”  </strong>",
        "<p>“The staff of your strength I will send you from Zion. Be powerful amidst what frightens you.  Your nation will offer help on the day you gather forces on the holy mountain.”                                                                                                                           <strong>R. “You will be priest forever, as I vowed of Malchitzedek, the virtuous king.” </strong>",
        "<p>\"From the womb’s darkness, from the first burst into dawn of life – to you belongs the dew of youth.” <br /><strong>R. “You will be priest forever, as I vowed of Malchitzedek, the virtuous king.”  </strong>",
        "<p>“I have promised and will not prove false: you will be priest forever, as I vowed of Malchitzedek, the virtuous king.” <br /><strong>R. “You will be priest forever, as I vowed of Malchitzedek, the virtuous king.” <sup><a href=\"#footnote-3\" id=\"footnote-ref-3\">[3]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "second-reading",
      "heading": "Second Reading",
      "citation": "Urantia Part IV. The Life and Teachings of Jesus, Paper 152 -  Events Leading up to the Capernaum Crisis, Section 2. Feeding the Five Thousand, Paragraphs 4c  - 8",
      "content": [
        "<p>152:2.4 (1700.5) . . .  By Wednesday noon about five thousand men, women, and children were assembled here in this park to the south of Bethsaida-Julias. The weather was pleasant, it being near the end of the rainy season in this locality.",
        "<p>152:2.5 (1700.6) Philip had provided a three days’ supply of food for Jesus and the twelve, which was in the custody of the Mark lad, their boy of all chores. By afternoon of this, the third day for almost half of this multitude, the food the people had brought with them was nearly exhausted. David Zebedee had no tented city here to feed and accommodate the crowds. Neither had Philip made food provision for such a multitude. But the people, even though they were hungry, would not go away. It was being quietly whispered about that Jesus, desiring to avoid trouble with both Herod and the Jerusalem leaders, had chosen this quiet spot outside the jurisdiction of all his enemies as the proper place to be crowned king. The enthusiasm of the people was rising every hour. Not a word was said to Jesus, though, of course, he knew all that was going on. Even the twelve apostles were still tainted with such notions, and especially the younger evangelists. The apostles who favored this attempt to proclaim Jesus king were Peter, John, Simon Zelotes, and Judas Iscariot. Those opposing the plan were Andrew, James, Nathaniel, and Thomas. Matthew, Philip, and the Alpheus twins were noncommittal. The ringleader of this plot to make him king was Joab, one of the young evangelists.",
        "<p>152:2.6 (1701.1) This was the stage setting about five o’clock on Wednesday afternoon, when Jesus asked James Alpheus to summon Andrew and Philip. Said Jesus: “What shall we do with the multitude? They have been with us now three days, and many of them are hungry. They have no food.” Philip and Andrew exchanged glances, and then Philip answered: “Master, you should send these people away so that they may go to the villages around about and buy themselves food.” And Andrew, fearing the materialization of the king plot, quickly joined with Philip, saying: “Yes, Master, I think it best that you dismiss the multitude so that they may go their way and buy food while you secure rest for a season.” By this time others of the twelve had joined the conference. Then said Jesus: “But I do not desire to send them away hungry; can you not feed them?” This was too much for Philip, and he spoke right up: “Master, in this country place where can we buy bread for this multitude? Two hundred denarii worth would not be enough for lunch.”",
        "<p>152:2.7 (1701.2) Before the apostles had an opportunity to express themselves, Jesus turned to Andrew and Philip, saying: “I do not want to send these people away. Here they are, like sheep without a shepherd. I would like to feed them. What food have we with us?” While Philip was conversing with Matthew and Judas, Andrew sought out the Mark lad to ascertain how much was left of their store of provisions. He returned to Jesus, saying: “The lad has left only five barley loaves and two dried fishes”—and Peter promptly added, “We have yet to eat this evening.”",
        "<p>152:2.8 (1701.3) For a moment Jesus stood in silence. There was a faraway look in his eyes. The apostles said nothing. Jesus turned suddenly to Andrew and said, “Bring me the loaves and fishes.” And when Andrew had brought the basket to Jesus, the Master said: “Direct the people to sit down on the grass in companies of one hundred and appoint a leader over each group while you bring all of the evangelists here with us.”",
        "<p>152:2.9 (1701.4) Jesus took up the loaves in his hands, and after he had given thanks, he broke the bread and gave to his apostles, who passed it on to their associates, who in turn carried it to the multitude. Jesus in like manner broke and distributed the fishes. And this multitude did eat and were filled. And when they had finished eating, Jesus said to the disciples: “Gather up the broken pieces that remain over so that nothing will be lost.” And when they had finished gathering up the fragments, they had twelve basketfuls. They who ate of this extraordinary feast numbered about five thousand men, women, and children.",
        "<p>152:2.10 (1702.1) And this is the first and only nature miracle which Jesus performed as a result of his conscious preplanning. It is true that his disciples were disposed to call many things miracles which were not, but this was a genuine supernatural ministration. In this case, so we were taught, Michael multiplied food elements as he always does except for the elimination of the time factor and the visible life channel. <strong><sup><a href=\"#footnote-4\" id=\"footnote-ref-4\">[4]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "alleluia",
      "heading": "Alleluia",
      "citation": "Urantia 152:3.2                                                                                                                       R. Alleluia, alleluia.",
      "content": [
        "<p>“My children, you mean well, but you are shortsighted and material-minded.”        <strong>R. Alleluia, alleluia. <sup><a href=\"#footnote-5\" id=\"footnote-ref-5\">[5]</a></sup></strong>"
      ]
    },
    {
      "type": "gospel",
      "heading": "Gospel",
      "citation": "Urantia Part IV. The Life and Teachings of Jesus, Paper 152 -  Events Leading up to the Capernaum Crisis, Section 3. The King-Making Episode, Paragraphs 1 - 3",
      "content": [
        "<p>152:3.1 (1702.2) The feeding of the five thousand by supernatural energy was another of those cases where human pity plus creative power equaled that which happened. Now that the multitude had been fed to the full, and since Jesus’ fame was then and there augmented by this stupendous wonder, the project to seize the Master and proclaim him king required no further personal direction. The idea seemed to spread through the crowd like a contagion. The reaction of the multitude to this sudden and spectacular supplying of their physical needs was profound and overwhelming. For a long time the Jews had been taught that the Messiah, the son of David, when he should come, would cause the land again to flow with milk and honey, and that the bread of life would be bestowed upon them as manna from heaven was supposed to have fallen upon their forefathers in the wilderness. And was not all of this expectation now fulfilled right before their eyes? When this hungry, undernourished multitude had finished gorging itself with the wonder-food, there was but one unanimous reaction: “Here is our king.” The wonder-working deliverer of Israel had come. In the eyes of these simple-minded people the power to feed carried with it the right to rule. No wonder, then, that the multitude, when it had finished feasting, rose as one man and shouted, “Make him king!”",
        "<p>152:3.2 (1702.3) This mighty shout enthused Peter and those of the apostles who still retained the hope of seeing Jesus assert his right to rule. But these false hopes were not to live for long. This mighty shout of the multitude had hardly ceased to reverberate from the near-by rocks when Jesus stepped upon a huge stone and, lifting up his right hand to command their attention, said: <a id=\"_Hlk198369613\"></a>“My children, you mean well, but you are shortsighted and material-minded.” There was a brief pause; this stalwart Galilean was there majestically posed in the enchanting glow of that eastern twilight. Every inch he looked a king as he continued to speak to this breathless multitude: “You would make me king, not because your souls have been lighted with a great truth, but because your stomachs have been filled with bread. How many times have I told you that my kingdom is not of this world? This kingdom of heaven which we proclaim is a spiritual brotherhood, and no man rules over it seated upon a material throne. My Father in heaven is the all-wise and the all-powerful Ruler over this spiritual brotherhood of the sons of God on earth. Have I so failed in revealing to you the Father of spirits that you would make a king of his Son in the flesh! Now all of you go hence to your own homes. If you must have a king, let the Father of lights be enthroned in the heart of each of you as the spirit Ruler of all things.”",
        "<p>152:3.3 (1702.4) These words of Jesus sent the multitude away stunned and disheartened. Many who had believed in him turned back and followed him no more from that day. The apostles were speechless; they stood in silence gathered about the twelve baskets of the fragments of food; only the chore boy, the Mark lad, spoke, “And he refused to be our king.” Jesus, before going off to be alone in the hills, turned to Andrew and said: “Take your brethren back to Zebedee’s house and pray with them, especially for your brother, Simon Peter.” <strong><sup><a href=\"#footnote-6\" id=\"footnote-ref-6\">[6]</a></sup></strong>"
      ],
      "reflection": null
    }
  ]
}