{
  "slug": "c33-14th-sunday-of-ordinary-time-july-6-2025",
  "title": "– 14th Sunday in Ordinary Time – July 6",
  "date": "2025",
  "theme": "",
  "year": "C",
  "heroImage": null,
  "sections": [
    {
      "type": "intro-reflection",
      "heading": "Introductory Reflection – The lectionary for this Sunday tells some of the story of Jesus’s organizing the 70 disciples under Abner, their ordination, and their charge to represent Jesus in the world.",
      "content": []
    },
    {
      "type": "first-reading",
      "heading": "First Reading",
      "citation": "Urantia, Part IV.  The Life and Teachings of Jesus, Paper 163 - Ordination of the Seventy at Magadan, Section 0. Introduction, Paragraphs 1 - 2",
      "content": [
        "<p>163:0.1 (1800.1) A few days after the return of Jesus and the twelve to Magadan from Jerusalem, Abner and a group of some fifty disciples arrived from Bethlehem. At this time there were also assembled at Magadan Camp the evangelistic corps, the women’s corps, and about one hundred and fifty other true and tried disciples from all parts of Palestine. After devoting a few days to visiting and the reorganization of the camp, Jesus and the twelve began a course of intensive training for this special group of believers, and from this well-trained and experienced aggregation of disciples the Master subsequently chose the seventy teachers and sent them forth to proclaim the gospel of the kingdom. This regular instruction began on Friday, November 4, and continued until Sabbath, November 19.",
        "<p>163:0.2 (1800.2) Jesus gave a talk to this company each morning. Peter taught methods of public preaching; Nathaniel instructed them in the art of teaching; Thomas explained how to answer questions; while Matthew directed the organization of their group finances. The other apostles also participated in this training in accordance with their special experience and natural talents.<strong><sup><a href=\"#footnote-1\" id=\"footnote-ref-1\">[1]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "psalm",
      "heading": "Responsorial Psalm",
      "citation": "Psalm 66:1-3, 4-5, 6-7, 16, 20 [2]                                                                R. (1) “Burst forth with joy, all the earth!”",
      "response": "",
      "verses": [
        "<p>“Burst forth with joy, all the earth! Sing to the glory of God’s name, make glory the form of your praise. Say to the Holy One: How wondrous are your deeds!\"<br /><a id=\"_Hlk195120936\"></a><strong>R. “Burst forth with joy, all the earth!”</strong>",
        "<p>\"All earth bows down, singing your name. They make melodies in praise of your nature – Selah. Go and look at the works of the Creator. Your acts provoke awe beyond anything humans attain.” <br /><strong>R. “Burst forth with joy, all the earth!” </strong>",
        "<p>“You turned the sea into dry land; they crossed through the river on foot. Once free, we rejoiced in your presence. Your steadfast power is always apparent.”<strong> <br />R. “Burst forth with joy, all the earth!” </strong>",
        "<p>“Come, listen, all those awed by God, and I will tell you what the Holy One did for my soul. Praised are you who have not turned from my prayer, nor turned your kindness from me.” <br /><strong>R. “Burst forth with joy, all the earth!” <sup><a href=\"#footnote-3\" id=\"footnote-ref-3\">[3]</a></sup></strong><a id=\"_Hlk198979789\"></a><strong>                                                                      </strong>"
      ],
      "reflection": null
    },
    {
      "type": "second-reading",
      "heading": "Second Reading",
      "citation": "Urantia, Part IV.  The Life and Teachings of Jesus, Paper 163 - Ordination of the Seventy at Magadan, Section 1. Ordination of the Seventy, Paragraphs 1 – 6",
      "content": [
        "<p>163:1.1 (1800.3) The seventy were ordained by Jesus on Sabbath afternoon, November 19, at the Magadan Camp, and Abner was placed at the head of these gospel preachers and teachers. This corps of seventy consisted of Abner and ten of the former apostles of John, fifty-one of the earlier evangelists, and eight other disciples who had distinguished themselves in the service of the kingdom.",
        "<p>163:1.2 (1800.4) About two o’clock on this Sabbath afternoon, between showers of rain, a company of believers, augmented by the arrival of David and the majority of his messenger corps and numbering over four hundred, assembled on the shore of the lake of Galilee to witness the ordination of the seventy.",
        "<p>163:1.3 (1800.5) Before Jesus laid his hands upon the heads of the seventy to set them apart as gospel messengers, addressing them, he said: “The harvest is indeed plenteous, but the laborers are few; therefore I exhort all of you to pray that the Lord of the harvest will send still other laborers into his harvest. I am about to set you apart as messengers of the kingdom; I am about to send you to Jew and gentile as lambs among wolves. As you go your ways, two and two, I instruct you to carry neither purse nor extra clothing, for you go forth on this first mission for only a short season. Salute no man by the way, attend only to your work. Whenever you go to stay at a home, first say: Peace be to this household. If those who love peace live therein, you shall abide there; if not, then shall you depart. And having selected this home, remain there for your stay in that city, eating and drinking whatever is set before you. And you do this because the laborer is worthy of his sustenance. Move not from house to house because a better lodging may be offered. Remember, as you go forth proclaiming peace on earth and good will among men, you must contend with bitter and self-deceived enemies; therefore be as wise as serpents while you are also as harmless as doves.",
        "<p>163:1.4 (1801.1) “And everywhere you go, preach, saying, ‘The kingdom of heaven is at hand,’ and minister to all who may be sick in either mind or body. Freely you have received of the good things of the kingdom; freely give. If the people of any city receive you, they shall find an abundant entrance into the Father’s kingdom; but if the people of any city refuse to receive this gospel, still shall you proclaim your message as you depart from that unbelieving community, saying, even as you leave, to those who reject your teaching: ‘Notwithstanding you reject the truth, it remains that the kingdom of God has come near you.’ He who hears you hears me. And he who hears me hears Him who sent me. He who rejects your gospel message rejects me. And he who rejects me rejects Him who sent me.”",
        "<p>163:1.5 (1801.2) When Jesus had thus spoken to the seventy, he began with Abner and, as they knelt in a circle about him, laid his hands upon the head of every man.",
        "<p>163:1.6 (1801.3) Early the next morning Abner sent the seventy messengers into all the cities of Galilee, Samaria, and Judea. And these thirty-five couples went forth preaching and teaching for about six weeks, all of them returning to the new camp near Pella, in Perea, on Friday, December 30. <strong><sup><a href=\"#footnote-4\" id=\"footnote-ref-4\">[4]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "alleluia",
      "heading": "Alleluia",
      "citation": "Colossians 3:15a, 16a                                                                                           R. Alleluia, alleluia.",
      "content": [
        "<p>Let the peace of Christ control your hearts; let the word of Christ dwell in you richly.             <strong>R. Alleluia, alleluia. <sup><a href=\"#footnote-5\" id=\"footnote-ref-5\">[5]</a></sup></strong>"
      ]
    },
    {
      "type": "gospel",
      "heading": "Gospel",
      "citation": "Urantia, Part IV.  The Life and Teachings of Jesus, Paper 163 - Ordination of the Seventy at Magadan, Section 4. Farewell to the Seventy, Paragraphs 1 – 17",
      "content": [
        "<p>163:4.1 (1804.5) It was a stirring time about the Magadan Camp the day the seventy went forth on their first mission. Early that morning, in his last talk with the seventy, Jesus placed emphasis on the following:",
        "<p>163:4.2 (1804.6) 1. The gospel of the kingdom must be proclaimed to all the world, to gentile as well as to Jew.",
        "<p>163:4.3 (1804.7) 2. While ministering to the sick, refrain from teaching the expectation of miracles.",
        "<p>163:4.4 (1805.1) 3. Proclaim a spiritual brotherhood of the sons of God, not an outward kingdom of worldly power and material glory.",
        "<p>163:4.5 (1805.2) 4. Avoid loss of time through overmuch social visiting and other trivialities which might detract from wholehearted devotion to preaching the gospel.",
        "<p>163:4.6 (1805.3) 5. If the first house to be selected for a headquarters proves to be a worthy home, abide there throughout the sojourn in that city.",
        "<p>163:4.7 (1805.4) 6. Make clear to all faithful believers that the time for an open break with the religious leaders of the Jews at Jerusalem has now come.",
        "<p>163:4.8 (1805.5) 7. Teach that man’s whole duty is summed up in this one commandment: Love the Lord your God with all your mind and soul and your neighbor as yourself. (This they were to teach as man’s whole duty in place of the 613 rules of living expounded by the Pharisees.)",
        "<p>163:4.9 (1805.6) When Jesus had talked thus to the seventy in the presence of all the apostles and disciples, Simon Peter took them off by themselves and preached to them their ordination sermon, which was an elaboration of the Master’s charge given at the time he laid his hands upon them and set them apart as messengers of the kingdom. Peter exhorted the seventy to cherish in their experience the following virtues:",
        "<p>163:4.10 (1805.7) 1. <em>Consecrated devotion.</em> To pray always for more laborers to be sent forth into the gospel harvest. He explained that, when one so prays, he will the more likely say, “Here am I; send me.” He admonished them to neglect not their daily worship.",
        "<p>163:4.11 (1805.8) 2. <em>True courage.</em> He warned them that they would encounter hostility and be certain to meet with persecution. Peter told them their mission was no undertaking for cowards and advised those who were afraid to step out before they started. But none withdrew.",
        "<p>163:4.12 (1805.9) 3. <em>Faith and trust.</em> They must go forth on this short mission wholly unprovided for; they must trust the Father for food and shelter and all other things needful.",
        "<p>163:4.13 (1805.10) 4. <em>Zeal and initiative.</em> They must be possessed with zeal and intelligent enthusiasm; they must attend strictly to their Master’s business. Oriental salutation was a lengthy and elaborate ceremony; therefore had they been instructed to “salute no man by the way,” which was a common method of exhorting one to go about his business without the waste of time. It had nothing to do with the matter of friendly greeting.",
        "<p>163:4.14 (1805.11) 5. <em>Kindness and courtesy.</em> The Master had instructed them to avoid unnecessary waste of time in social ceremonies, but he enjoined courtesy toward all with whom they should come in contact. They were to show every kindness to those who might entertain them in their homes. They were strictly warned against leaving a modest home to be entertained in a more comfortable or influential one.",
        "<p>163:4.15 (1805.12) 6. <em>Ministry to the sick.</em> The seventy were charged by Peter to search out the sick in mind and body and to do everything in their power to bring about the alleviation or cure of their maladies.",
        "<p>163:4.16 (1805.13) And when they had been thus charged and instructed, they started out, two and two, on their mission in Galilee, Samaria, and Judea.<strong><sup><a href=\"#footnote-6\" id=\"footnote-ref-6\">[6]</a></sup></strong>"
      ],
      "reflection": null
    }
  ]
}