{
  "slug": "c34-15th-sunday-in-ordinary-time-july-13-2025",
  "title": "– 15th Sunday in Ordinary Time",
  "date": "July 13, 2025",
  "theme": "Good Samaritan Sunday",
  "year": "C",
  "heroImage": null,
  "sections": [
    {
      "type": "intro-reflection",
      "heading": "Initial Reflection – While depicting this scene of true brotherly love for one hated by the Jews, Rembrandt adds the humorous twist on the messiness of life with the dog defecating in the foreground.",
      "content": []
    },
    {
      "type": "first-reading",
      "heading": "First Reading",
      "citation": "Urantia Part IV. The Life and Teachings of Jesus, Paper 163 – The Ordination of the 70, Section 7. Preparation for the Last Mission, Paragraphs 1 - 4",
      "content": [
        "<p>163:7.1 (1808.3) The next few days were busy times in the Pella camp; preparations for the Perean mission were being completed. Jesus and his associates were about to enter upon their last mission, the three months’ tour of all Perea, which terminated only upon the Master’s entering Jerusalem for his final labors on earth. Throughout this period the headquarters of Jesus and the twelve apostles was maintained here at the Pella camp.",
        "<p>163:7.2 (1808.4) It was no longer necessary for Jesus to go abroad to teach the people. They now came to him in increasing numbers each week and from all parts, not only from Palestine but from the whole Roman world and from the Near East. Although the Master participated with the seventy in the tour of Perea, he spent much of his time at the Pella camp, teaching the multitude and instructing the twelve. Throughout this three months’ period at least ten of the apostles remained with Jesus.",
        "<p>163:7.3 (1808.5) The women’s corps also prepared to go out, two and two, with the seventy to labor in the larger cities of Perea. This original group of twelve women had recently trained a larger corps of fifty women in the work of home visitation and in the art of ministering to the sick and the afflicted. Perpetua, Simon Peter’s wife, became a member of this new division of the women’s corps and was intrusted with the leadership of the enlarged women’s work under Abner. After Pentecost she remained with her illustrious husband, accompanying him on all of his missionary tours; and on the day Peter was crucified in Rome, she was fed to the wild beasts in the arena. This new women’s corps also had as members the wives of Philip and Matthew and the mother of James and John.",
        "<p>163:7.4 (1808.6) The work of the kingdom now prepared to enter upon its terminal phase under the personal leadership of Jesus. And this present phase was one of spiritual depth in contrast with the miracle-minded and wonder-seeking multitudes who followed after the Master during the former days of popularity in Galilee. However, there were still any number of his followers who were material-minded, and who failed to grasp the truth that the kingdom of heaven is the spiritual brotherhood of man founded on the eternal fact of the universal fatherhood of God.<strong><sup><a href=\"#footnote-1\" id=\"footnote-ref-1\">[1]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "psalm",
      "heading": "Responsorial Psalm",
      "citation": "Psalm 69:14, 17, 30-31, 33-34, 36, 37 [2]                                   \t\t      R. (cf. 33)  “Seekers of God – their hearts will be brought back to life.”",
      "response": "",
      "verses": [
        "<p><a id=\"_Hlk199090246\"></a>“I am my prayer to you, God – may it always be a time of favor. Eternal One, answer me with your kindness, with the truth of your salvation.” “Answer me, God, for your kindness is good.  Because your compassion is infinite, turn toward me the light of your face.”  <strong>R. “Seekers of God – their hearts will be brought back to life.” </strong>",
        "<p>“O, I am troubled of spirit, and sickened by grief. Your salvation, my Upholder, will raise me to a place of rest. I will paise you with words of my song, exalt you by means of thanksgiving.” <br /><strong>R. “Seekers of God – their hearts will be brought back to life.” </strong>",
        "<p>\"The broken of spirit will see and rejoice.  Seekers of God – their hearts will be brought back to life. Because the Holy One listens to the needy, and the afflicted (he) does not ignore.” <br /><a id=\"_Hlk199056768\"></a><strong>R. “Seekers of God – their hearts will be brought back to life.” </strong>",
        "<p>“Because the God of Justice will bring salvation to Zion, and build for Judah cities where people peacefully dwell. Those who were forced out will return.  And the seed of slaves will inherit it; lovers of God’s name will settle there.”  <br /><strong>R. “Seekers of God – their hearts will be brought back to life.”</strong>",
        "<p><strong>Or  </strong><a href=\"https://bible.usccb.org/bible/Psalms/19?8\"><strong>Psalm 19:8, 9, 10, 11</strong></a><strong>                                                                                                              R.(9a) </strong><a id=\"_Hlk199057489\"></a><strong>“Your providence can be easily seen, making the heart leap with joy.” </strong>",
        "<p>“Your teaching is everywhere, reviving the soul. Your testimony is faithful, enlightening those who do not understand.”<br /><strong>R. “Your providence can be easily seen, making the heart leap with joy.” </strong>",
        "<p>“Your providence can be easily seen, making the heart leap with joy. The tasks you ask us to do are revealed clearly, making the eyes sparkle with light.” <br /><strong>R. “Your providence can be easily seen, making the heart leap with joy.” </strong>",
        "<p>“Awe of you is pure, lasting forever, Your decisions are true; taken together, they prove righteousness.”                                                                                                                <strong>R. “Your providence can be easily seen, making the heart leap with joy.” </strong>",
        "<p>“They are more precious than gold, more than refined gold in abundance, better than the sweetest honey, sweeter than fresh drippings of the hive.”<br /><strong>R. “Your providence can be easily seen, making the heart leap with joy.” <sup><a href=\"#footnote-3\" id=\"footnote-ref-3\">[3]</a></sup></strong>"
      ],
      "reflection": "<p>In Psalm 19 it is good to mediate on God’s “providence can be easily seen, making the heart leap with joy,” even in our darkest moments for “your teaching is everywhere, reviving the soul.”"
    },
    {
      "type": "second-reading",
      "heading": "Second Reading",
      "citation": "Urantia Part IV. The Life and Teachings of Jesus, Paper 164 - At the Feast of Dedication, Section 0. Introduction, Paragraphs 1 and 2",
      "content": [
        "<p>164:0.1 (1809.1) As the camp at Pella was being established, Jesus, taking with him Nathaniel and Thomas, secretly went up to Jerusalem to attend the feast of the dedication. Not until they passed over the Jordan at the Bethany ford, did the two apostles become aware that their Master was going on to Jerusalem. When they perceived that he really intended to be present at the feast of dedication, they remonstrated with him most earnestly, and using every sort of argument, they sought to dissuade him. But their efforts were of no avail; Jesus was determined to visit Jerusalem. To all their entreaties and to all their warnings emphasizing the folly and danger of placing himself in the hands of the Sanhedrin, he would reply only<a id=\"_Hlk199079357\"></a>, “I would give these teachers in Israel another opportunity to see the light, before my hour comes.”",
        "<p>164:0.2 (1809.2) On they went toward Jerusalem, the two apostles continuing to express their feelings of fear and to voice their doubts about the wisdom of such an apparently presumptuous undertaking. They reached Jericho about half past four and prepared to lodge there for the night.<strong><sup><a href=\"#footnote-4\" id=\"footnote-ref-4\">[4]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "alleluia",
      "heading": "Alleluia",
      "citation": "Cf. John 6:63c, 68c                                                                                               R. Alleluia, alleluia.",
      "content": [
        "<p>Your words, Lord, are Spirit and life; you have the words of everlasting life.<br /><strong>R. Alleluia, alleluia. <sup><a href=\"#footnote-5\" id=\"footnote-ref-5\">[5]</a></sup></strong>"
      ]
    },
    {
      "type": "gospel",
      "heading": "Gospel",
      "citation": "Urantia Part IV. The Life and Teachings of Jesus, Paper 164 – At the Feast of Dedication, Section 1. Story of the Good Samaritan, Paragraphs 1 – 4",
      "content": [
        "<p>164:1.1 (1809.3) That evening a considerable company gathered about Jesus and the two apostles to ask questions, many of which the apostles answered, while others the Master discussed. In the course of the evening a certain lawyer, seeking to entangle Jesus in a compromising disputation, said: “Teacher, I would like to ask you just what I should do to inherit eternal life?” Jesus answered, “What is written in the law and the prophets; how do you read the Scriptures?” The lawyer, knowing the teachings of both Jesus and the Pharisees, answered: “To love the Lord God with all your heart, soul, mind, and strength, and your neighbor as yourself.” Then said Jesus: “You have answered right; this, if you really do, will lead to life everlasting.”",
        "<p>164:1.2 (1809.4) But the lawyer was not wholly sincere in asking this question, and desiring to justify himself while also hoping to embarrass Jesus, he ventured to ask still another question. Drawing a little closer to the Master, he said, “But, Teacher, I should like you to tell me just who is my neighbor?” The lawyer asked this question hoping to entrap Jesus into making some statement that would contravene the Jewish law which defined one’s neighbor as “the children of one’s people.” The Jews looked upon all others as “gentile dogs.” This lawyer was somewhat familiar with Jesus’ teachings and therefore well knew that the Master thought differently; thus he hoped to lead him into saying something which could be construed as an attack upon the sacred law.",
        "<p>164:1.3 (1810.1) But Jesus discerned the lawyer’s motive, and instead of falling into the trap, he proceeded to tell his hearers a story, a story which would be fully appreciated by any Jericho audience. Said Jesus: “A certain man was going down from Jerusalem to Jericho, and he fell into the hands of cruel brigands, who robbed him, stripped him and beat him, and departing, left him half dead. Very soon, by chance, a certain priest was going down that way, and when he came upon the wounded man, seeing his sorry plight, he passed by on the other side of the road. And in like manner a Levite also, when he came along and saw the man, passed by on the other side. Now, about this time, a certain Samaritan, as he journeyed down to Jericho, came across this wounded man; and when he saw how he had been robbed and beaten, he was moved with compassion, and going over to him, he bound up his wounds, pouring on oil and wine, and setting the man upon his own beast, brought him here to the inn and took care of him. And on the morrow he took out some money and, giving it to the host, said: ‘Take good care of my friend, and if the expense is more, when I come back again, I will repay you.’ Now let me ask you: Which of these three turned out to be the neighbor of him who fell among the robbers?” And when the lawyer perceived that he had fallen into his own snare, he answered, “He who showed mercy on him.” And Jesus said, “Go and do likewise.”",
        "<p>164:1.4 (1810.2) The lawyer answered, “He who showed mercy,” that he might refrain from even speaking that odious word, Samaritan. The lawyer was forced to give the very answer to the question, “Who is my neighbor?” which Jesus wished given, and which, if Jesus had so stated, would have directly involved him in the charge of heresy. Jesus not only confounded the dishonest lawyer, but he told his hearers a story which was at the same time a beautiful admonition to all his followers and a stunning rebuke to all Jews regarding their attitude toward the Samaritans. And this story has continued to promote brotherly love among all who have subsequently believed the gospel of Jesus. <strong><sup><a href=\"#footnote-6\" id=\"footnote-ref-6\">[6]</a></sup></strong>"
      ],
      "reflection": "<p>In this parable Jesus not only evaded the lawyer’s trap, but also set the story in Jericho where they were, and where his listeners well knew the dangers of the road from Jerusalem to Jericho.<p>Indeed, this is a story that invokes brotherly love."
    }
  ]
}