{
  "slug": "c35-16th-sunday-in-ordinary-time-july-20-2025",
  "title": "16th Sunday in Ordinary Time",
  "date": "July 20, 2025",
  "theme": "Mary, Martha and Lazarus Sunday",
  "year": "C",
  "heroImage": null,
  "sections": [
    {
      "type": "intro-reflection",
      "heading": "Initial Reflection – Luke’s gospel for today tells the story of Martha, Mary and Jesus, with Jesus correcting Martha in asking for Mary to help her prepare a meal for Jesus.  The Urantia gospel tells a fuller, more complete and deeper psychological story.  Readings 1 and 2 tell the Urantia story of Jesus’s long term relationship with Mary, Martha and Lazarus.  All three viewed Jesus with great love, as did Leonardo in their preliminary pastel for Jesus in his The Last Supper.",
      "content": []
    },
    {
      "type": "first-reading",
      "heading": "First Reading",
      "citation": "Urantia Part IV.  The Life and Teachings of Jesus, Paper 124 - The Later Childhood of Jesus, Section 6. The Journey to Jerusalem, Paragraphs 1 &amp; 9, and Paper 125 -  Jesus at Jerusalem, Section 2. Jesus and the Passover, 1 &amp; 7, and Section 4. First and Second Days in the Temple, Paragraph 1",
      "content": [
        "<p>124:6.1 (1374.1) Jesus, having now reached the threshold of young manhood and having been formally graduated from the synagogue schools, was qualified to proceed to Jerusalem with his parents to participate with them in the celebration of his first Passover. The Passover feast of this year fell on Saturday, April 9, A. D. 7. A considerable company (103) made ready to depart from Nazareth early Monday morning, April 4, for Jerusalem. They journeyed south toward Samaria, but on reaching Jezreel, they turned east, going around Mount Gilboa into the Jordan valley in order to avoid passing through Samaria. Joseph and his family would have enjoyed going down through Samaria by way of Jacob’s well and Bethel, but since the Jews disliked to deal with the Samaritans, they decided to go with their neighbors by way of the Jordan valley. . . .",
        "<p>124:6.9 (1375.3) On the eastern slopes of Olivet they paused for rest in the borders of a little village called Bethany. The hospitable villagers poured forth to minister to the pilgrims, and it happened that Joseph and his family had stopped near the house of one Simon, who had three children about the same age as Jesus—Mary, Martha, and Lazarus. They invited the Nazareth family in for refreshment, and a lifelong friendship sprang up between the two families. Many times afterward, in his eventful life, Jesus stopped in this home. . . .",
        "<p>125:2.1 (1379.2) Five Nazareth families were guests of, or associates with, the family of Simon of Bethany in the celebration of the Passover, Simon having purchased the paschal lamb for the company. It was the slaughter of these lambs in such enormous numbers that had so affected Jesus on his temple visit. It had been the plan to eat the Passover with Mary’s relatives, but Jesus persuaded his parents to accept the invitation to go to Bethany. . . .",
        "<p>125:2.7 (1380.2) On Wednesday of the Passover week, Jesus was permitted to go home with Lazarus to spend the night at Bethany. This evening, Lazarus, Martha, and Mary heard Jesus discuss things temporal and eternal, human and divine, and from that night on they all three loved him as if he had been their own brother. . . .",
        "<p>125:4.1 (1381.3) In the meantime, Jesus had remained in the temple throughout the afternoon, listening to the discussions and enjoying the more quiet and decorous atmosphere, the great crowds of Passover week having about disappeared. At the conclusion of the afternoon discussions, in none of which Jesus participated, he betook himself to Bethany, arriving just as Simon’s family made ready to partake of their evening meal. The three youngsters were overjoyed to greet Jesus, and he remained in Simon’s house for the night. He visited very little during the evening, spending much of the time alone in the garden meditating. <strong><sup><a href=\"#footnote-1\" id=\"footnote-ref-1\">[1]</a></sup></strong>"
      ],
      "reflection": "<p>The last paragraph above is from the period Jesus was “lost in the temple”.  He actually spent three evenings at the home of Simon, his wife and Mary, Martha and Lazarus.  Strangely, Mary and Joseph looked everywhere for Jesus for two days, before finding him on the fourth day,  but they did not think to look in Bethany where they all had spent Passover with Simon and his family at Jesus’s insistence.  Somehow on this occasion Mary and Joseph must have known of but missed the closeness between Jesus and Mary, Martha, and Lazarus."
    },
    {
      "type": "psalm",
      "heading": "Responsorial Psalm",
      "citation": "Psalm 15:2-3, 3-4, 5 [2]                                                                           R.(1a) “God, who can dwell in your tent?”",
      "response": "",
      "verses": [
        "<p>“The one who walks with integrity, who acts according to what is right, who speaks truth from her heart, and does not let slander tread on her tongue.” <br /><strong>R. “God, who can dwell in your tent?”</strong>",
        "<p>“Who does not act wrongly to any creature, does not cast reproach on any kin, for whom that which God rejects is like stolen plunder in her eyes, the one who reveres all who hold the Eternal in awe, who takes an oath about another’s wrongdoing without retracting out of fear.”<br /><strong>R. “God, who can dwell in your tent?”</strong>",
        "<p>“Who does not lend silver at interest, and a bribe against the innocent will not accept. The one who does this will never stumble as long as she lives.” <br /><strong>R. “God, who can dwell in your tent?” <sup><a href=\"#footnote-3\" id=\"footnote-ref-3\">[3]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "second-reading",
      "heading": "Second Reading",
      "citation": "Urantia Part IV.  The Life and Teachings of Jesus, Paper 141 - Beginning the Public Work, Section 9. Departing for Jerusalem, Paragraphs 1 -3",
      "content": [
        "<p>141:9.1 (1595.5) On Monday, the last day of March, Jesus and the apostles began their journey up the hills toward Jerusalem. Lazarus of Bethany had been down to the Jordan twice to see Jesus, and every arrangement had been made for the Master and his apostles to make their headquarters with Lazarus and his sisters at Bethany as long as they might desire to stay in Jerusalem.",
        "<p>141:9.2 (1595.6) The disciples of John remained at Bethany beyond the Jordan, teaching and baptizing the multitudes, so that Jesus was accompanied only by the twelve when he arrived at Lazarus’s home. Here Jesus and the apostles tarried for five days, resting and refreshing themselves before going on to Jerusalem for the Passover. It was a great event in the lives of Martha and Mary to have the Master and his apostles in the home of their brother, where they could minister to their needs.",
        "<p>141:9.3 (1595.7) On Sunday morning, April 6, Jesus and the apostles went down to Jerusalem; and this was the first time the Master and all of the twelve had been there together. <strong><sup><a href=\"#footnote-4\" id=\"footnote-ref-4\">[4]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "alleluia",
      "heading": "Alleluia",
      "citation": "Urantia – 162:8.3                                                                                                                   R. Alleluia, alleluia.",
      "content": [
        "<p>But when will both of you learn to live as I have taught you: both serving in co-operation and both refreshing your souls in unison? Can you not learn that there is a time for everything—that the lesser matters of life should give way before the greater things of the heavenly kingdom? ”                                                                                       <strong>R. Alleluia, alleluia. <sup><a href=\"#footnote-5\" id=\"footnote-ref-5\">[5]</a></sup></strong>"
      ]
    },
    {
      "type": "gospel",
      "heading": "Gospel",
      "citation": "Urantia Part IV. The Life and Teachings of Jesus, Paper -162 – At the Feast of the Tabernacles, Section 8. The Visit with Martha and Mary, Paragraphs 1 - 3",
      "content": [
        "<p>162:8.1 (1797.4) It had been arranged that Jesus should lodge with Lazarus and his sisters at a friend’s house, while the apostles were scattered here and there in small groups, these precautions being taken because the Jewish authorities were again becoming bold with their plans to arrest him.",
        "<p>162:8.2 (1797.5) For years it had been the custom for these three to drop everything and listen to Jesus’ teaching whenever he chanced to visit them. With the loss of their parents, Martha had assumed the responsibilities of the home life, and so on this occasion, while Lazarus and Mary sat at Jesus’ feet drinking in his refreshing teaching, Martha made ready to serve the evening meal. It should be explained that Martha was unnecessarily distracted by numerous needless tasks, and that she was cumbered by many trivial cares; that was her disposition.",
        "<p>162:8.3 (1798.1) As Martha busied herself with all these supposed duties, she was perturbed because Mary did nothing to help. Therefore she went to Jesus and said: “Master, do you not care that my sister has left me alone to do all of the serving? Will you not bid her to come and help me?” Jesus answered: “Martha, Martha, why are you always anxious about so many things and troubled by so many trifles? Only one thing is really worth while, and since Mary has chosen this good and needful part, I shall not take it away from her. <a id=\"_Hlk199444070\"></a>But when will both of you learn to live as I have taught you: both serving in co-operation and both refreshing your souls in unison? Can you not learn that there is a time for everything—that the lesser matters of life should give way before the greater things of the heavenly kingdom?” <strong><sup><a href=\"#footnote-6\" id=\"footnote-ref-6\">[6]</a></sup></strong>"
      ],
      "reflection": "<p>It should be remembered that later it was Martha who went out to greet Jesus, and brought him to Mary, just before he raised Lazarus from the dead.<p>Finally, on the Sabbath before his death, in Urantia 172:1.5, this Mary (the sister of Martha and Lazarus) was the Mary  who poured “a large alabaster cruse of very rare and costly ointment; and after anointing the Master’s head, she began to pour it upon his feet as she took down her hair and wiped them with it. The whole house became filled with the odor of the ointment.” This act precipitated Judas deciding to betray Jesus. The next day Jesus sent Lazarus to Philadelphia because he was concerned that the Jewish leaders would put him to death as well."
    }
  ]
}