{
  "slug": "c40-21st-sunday-of-ordinary-time-august-24-2025",
  "title": "– 21st Sunday in Ordinary Time – August 24",
  "date": "2025",
  "theme": "Preaching and Receiving Truth Sunday",
  "year": "C",
  "heroImage": null,
  "sections": [
    {
      "type": "intro-reflection",
      "heading": "Initial Reflection – The second reading and gospel for today present the Urantia version of Jesus answering the questions of how many will be saved, the same question asked in Mathew’s gospel.  The Urantia version is much more complete with Jesus placing the emphasis on the necessity for each of us to open our hearts to Jesus, who is always knocking.  Whether the way is narrow or not, an open heart to God and his Son, Jesus/Michael, is sufficient.",
      "content": []
    },
    {
      "type": "first-reading",
      "heading": "First Reading",
      "citation": "Urantia, Part IV. The Life and Teachings of Jesus, Paper 159 – The Decapolis Tour, Section 3. Instruction for Teachers and Believers, Paragraph 1 – 3, 6 – 8, &amp; 12 -13",
      "content": [
        "<p>[159:3.1 (1765.3) At Edrei, where Thomas and his associates labored, Jesus spent a day and a night and, in the course of the evening’s discussion, gave expression to the principles which should guide those who preach truth, and which should activate all who teach the gospel of the kingdom. Summarized and restated in modern phraseology, Jesus taught:]",
        "<p>159:3.2 (1765.4) Always respect the personality of man. Never should a righteous cause be promoted by force; spiritual victories can be won only by spiritual power. This injunction against the employment of material influences refers to psychic force as well as to physical force. Overpowering arguments and mental superiority are not to be employed to coerce men and women into the kingdom. Man’s mind is not to be crushed by the mere weight of logic or overawed by shrewd eloquence. While emotion as a factor in human decisions cannot be wholly eliminated, it should not be directly appealed to in the teachings of those who would advance the cause of the kingdom. Make your appeals directly to the divine spirit that dwells within the minds of men. Do not appeal to fear, pity, or mere sentiment. In appealing to men, be fair; exercise self-control and exhibit due restraint; show proper respect for the personalities of your pupils. Remember that I have said: “Behold, I stand at the door and knock, and if any man will open, I will come in.”",
        "<p>159:3.3 (1765.5) In bringing men into the kingdom, do not lessen or destroy their self-respect. While overmuch self-respect may destroy proper humility and end in pride, conceit, and arrogance, the loss of self-respect often ends in paralysis of the will. It is the purpose of this gospel to restore self-respect to those who have lost it and to restrain it in those who have it. Make not the mistake of only condemning the wrongs in the lives of your pupils; remember also to accord generous recognition for the most praiseworthy things in their lives. Forget not that I will stop at nothing to restore self-respect to those who have lost it, and who really desire to regain it. . . .",
        "<p>[159:3.6 (1766.2) Sometime the children of the kingdom will realize that strong feelings of emotion are not equivalent to the leadings of the divine spirit. To be strongly and strangely impressed to do something or to go to a certain place, does not necessarily mean that such impulses are the leadings of the indwelling spirit.",
        "<p>159:3.7 (1766.3 ) Forewarn all believers regarding the fringe of conflict which must be traversed by all who pass from the life as it is lived in the flesh to the higher life as it is lived in the spirit. To those who live quite wholly within either realm, there is little conflict or confusion, but all are doomed to experience more or less uncertainty during the times of transition between the two levels of living. In entering the kingdom, you cannot escape its responsibilities or avoid its obligations, but remember: The gospel yoke is easy and the burden of truth is light.",
        "<p>159:3.8 (1766.4) The world is filled with hungry souls who famish in the very presence of the bread of life; men die searching for the very God who lives within them. Men seek for the treasures of the kingdom with yearning hearts and weary feet when they are all within the immediate grasp of living faith. Faith is to religion what sails are to a ship; it is an addition of power, not an added burden of life. There is but one struggle for those who enter the kingdom, and that is to fight the good fight of faith. The believer has only one battle, and that is against doubt—unbelief. . . .]",
        "<p>159:3.12 (1766.8) When my children once become self-conscious of the assurance of the divine presence, such a faith will expand the mind, ennoble the soul, reinforce the personality, augment the happiness, deepen the spirit perception, and enhance the power to love and be loved.",
        "<p>159:3.13 (1767.1) Teach all believers that those who enter the kingdom are not thereby rendered immune to the accidents of time or to the ordinary catastrophes of nature. Believing the gospel will not prevent getting into trouble, but it will insure that you shall be <em>unafraid</em> when trouble does overtake you. If you dare to believe in me and wholeheartedly proceed to follow after me, you shall most certainly by so doing enter upon the sure pathway to trouble. I do not promise to deliver you from the waters of adversity, but I do promise to go with you through all of them. <strong><sup><a href=\"#footnote-1\" id=\"footnote-ref-1\">[1]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "psalm",
      "heading": "Responsorial Psalm",
      "citation": "Psalm 117:1, 2 [2]                                                                                         R. 1b “Let all the world approach you with worship.”",
      "response": "",
      "verses": [
        "<p>“Shine praises upon God, all nations; let all the world approach you with worship.”<br /><strong>R. “Let all the world approach you with worship.” </strong>",
        "<p>“For your love has won us over; your loyalty exists for all time – praise God.” <br /><strong>R. “Let all the world approach you with worship.” <sup><a href=\"#footnote-3\" id=\"footnote-ref-3\">[3]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "second-reading",
      "heading": "Second Reading",
      "citation": "Urantia, Part IV. The Life and Teachings of Jesus, Paper 166 – Last Visit to Northern Perea, Section 3. The Sermon at Gerasa, Paragraphs 1 – 5",
      "content": [
        "<p>[166:3.1 (1828.5) As Jesus and the twelve visited with the messengers of the kingdom at Gerasa, one of the Pharisees who believed in him asked this question: “Lord, will there be few or many really saved?” And Jesus, answering, said:]",
        "<p>166:3.2 (1828.6) “You have been taught that only the children of Abraham will be saved; that only the gentiles of adoption can hope for salvation. Some of you have reasoned that, since the Scriptures record that only Caleb and Joshua from among all the hosts that went out of Egypt lived to enter the promised land, only a comparatively few of those who seek the kingdom of heaven shall find entrance thereto.",
        "<p>166:3.3 (1828.7) “You also have another saying among you, and one that contains much truth: That the way which leads to eternal life is straight and narrow, that the door which leads thereto is likewise narrow so that, of those who seek salvation, few can find entrance through this door. You also have a teaching that the way which leads to destruction is broad, that the entrance thereto is wide, and that there are many who choose to go this way. And this proverb is not without its meaning. But I declare that salvation is first a matter of your personal choosing. Even if the door to the way of life is narrow, it is wide enough to admit all who sincerely seek to enter, for I am that door. And the Son will never refuse entrance to any child of the universe who, by faith, seeks to find the Father through the Son.",
        "<p>166:3.4 (1829.1) “But herein is the danger to all who would postpone their entrance into the kingdom while they continue to pursue the pleasures of immaturity and indulge the satisfactions of selfishness: Having refused to enter the kingdom as a spiritual experience, they may subsequently seek entrance thereto when the glory of the better way becomes revealed in the age to come. And when, therefore, those who spurned the kingdom when I came in the likeness of humanity seek to find an entrance when it is revealed in the likeness of divinity, then will I say to all such selfish ones: I know not whence you are. You had your chance to prepare for this heavenly citizenship, but you refused all such proffers of mercy; you rejected all invitations to come while the door was open. Now, to you who have refused salvation, the door is shut. This door is not open to those who would enter the kingdom for selfish glory. Salvation is not for those who are unwilling to pay the price of wholehearted dedication to doing my Father’s will. When in spirit and soul you have turned your backs upon the Father’s kingdom, it is useless in mind and body to stand before this door and knock, saying, ‘Lord, open to us; we would also be great in the kingdom.’ Then will I declare that you are not of my fold. I will not receive you to be among those who have fought the good fight of faith and won the reward of unselfish service in the kingdom on earth. And when you say, ‘Did we not eat and drink with you, and did you not teach in our streets?’ then shall I again declare that you are spiritual strangers; that we were not fellow servants in the Father’s ministry of mercy on earth; that I do not know you; and then shall the Judge of all the earth say to you: ‘Depart from us, all you who have taken delight in the works of iniquity.’",
        "<p>166:3.5 (1829.2) “But fear not; every one who sincerely desires to find eternal life by entrance into the kingdom of God shall certainly find such everlasting salvation. But you who refuse this salvation will some day see the prophets of the seed of Abraham sit down with the believers of the gentile nations in this glorified kingdom to partake of the bread of life and to refresh themselves with the water thereof. And they who shall thus take the kingdom in spiritual power and by the persistent assaults of living faith will come from the north and the south and from the east and the west. And, behold, many who are first will be last, and those who are last will many times be first.” <strong><sup><a href=\"#footnote-4\" id=\"footnote-ref-4\">[4]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "alleluia",
      "heading": "Alleluia",
      "citation": "Urantia 166:3.7                                                                                                            R. Alleluia, alleluia.",
      "content": [
        "<p>“Behold, I stand at the doors of men’s hearts and knock, and if any man will open to me, I will come in and sup with him and will feed him with the bread of life; we shall be one in spirit and purpose, and so shall we ever be brethren in the long and fruitful service of the search for the Paradise Father.”                                                                                   <strong>R. Alleluia, alleluia.<sup><a href=\"#footnote-5\" id=\"footnote-ref-5\">[5]</a></sup></strong>"
      ]
    },
    {
      "type": "gospel",
      "heading": "Gospel",
      "citation": "Urantia, Part IV. The Life and Teachings of Jesus, Paper 166 – Last Visit to Northern Perea, Section 3. The Sermon at Gerasa, Paragraphs 6 - 8",
      "content": [
        "<p>166:3.6 (1829.3) This was indeed a new and strange version of the old and familiar proverb of the straight and narrow way.",
        "<p>166:3.7 (1829.4) Slowly the apostles and many of the disciples were learning the meaning of Jesus’ early declaration: “Unless you are born again, born of the spirit, you cannot enter the kingdom of God.” Nevertheless, to all who are honest of heart and sincere in faith, it remains eternally true: “Behold, I stand at the doors of men’s hearts and knock, and if any man will open to me, I will come in and sup with him and will feed him with the bread of life; we shall be one in spirit and purpose, and so shall we ever be brethren in the long and fruitful service of the search for the Paradise Father.” And so, whether few or many are to be saved altogether depends on whether few or many will heed the invitation: “I am the door, I am the new and living way, and whosoever wills may enter to embark upon the endless truth-search for eternal life.”",
        "<p>166:3.8 (1829.5) Even the apostles were unable fully to comprehend his teaching as to the necessity for using spiritual force for the purpose of breaking through all material resistance and for surmounting every earthly obstacle which might chance to stand in the way of grasping the all-important spiritual values of the new life in the spirit as the liberated sons of God. <strong><sup><a href=\"#footnote-6\" id=\"footnote-ref-6\">[6]</a></sup></strong>"
      ],
      "reflection": null
    }
  ]
}