{
  "slug": "c41-22st-sunday-of-ordinary-time-august-31-2025",
  "title": "22nd Sunday in Ordinary Time – August 31",
  "date": "2025",
  "theme": "The First Shall be Last and the Last Shall be First",
  "year": "C",
  "heroImage": null,
  "sections": [
    {
      "type": "intro-reflection",
      "heading": "Initial Reflection – Like Rembrandt’s painting of “The Laborers in the Vinyard”, today’s readings explore the mystery of how in the journey to heaven, the last can be first and the first last.",
      "content": []
    },
    {
      "type": "first-reading",
      "heading": "First Reading",
      "citation": "Urantia Part IV. The Life and Teachings of Jesus, Paper 179 – The Last Supper, Section 1. The Desire for Preference, Paragraphs 1 - 5",
      "content": [
        "<p>179:1.1 (1936.6) When the apostles had been shown upstairs by John Mark, they beheld a large and commodious chamber, which was completely furnished for the supper, and observed that the bread, wine, water, and herbs were all in readiness on one end of the table. Except for the end on which rested the bread and wine, this long table was surrounded by thirteen reclining couches, just such as would be provided for the celebration of the Passover in a well-to-do Jewish household.",
        "<p>179:1.2 (1936.7) As the twelve entered this upper chamber, they noticed, just inside the door, the pitchers of water, the basins, and towels for laving their dusty feet; and since no servant had been provided to render this service, the apostles began to look at one another as soon as John Mark had left them, and each began to think within himself, Who shall wash our feet? And each likewise thought that it would not be he who would thus seem to act as the servant of the others.",
        "<p>179:1.3 (1937.1) As they stood there, debating in their hearts, they surveyed the seating arrangement of the table, taking note of the higher divan of the host with one couch on the right and eleven arranged around the table on up to opposite this second seat of honor on the host’s right.",
        "<p>179:1.4 (1937.2) They expected the Master to arrive any moment, but they were in a quandary as to whether they should seat themselves or await his coming and depend on him to assign them their places. While they hesitated, Judas stepped over to the seat of honor, at the left of the host, and signified that he intended there to recline as the preferred guest. This act of Judas immediately stirred up a heated dispute among the other apostles. Judas had no sooner seized the seat of honor than John Zebedee laid claim to the next preferred seat, the one on the right of the host. Simon Peter was so enraged at this assumption of choice positions by Judas and John that, as the other angry apostles looked on, he marched clear around the table and took his place on the lowest couch, the end of the seating order and just opposite to that chosen by John Zebedee. Since others had seized the high seats, Peter thought to choose the lowest, and he did this, not merely in protest against the unseemly pride of his brethren, but with the hope that Jesus, when he should come and see him in the place of least honor, would call him up to a higher one, thus displacing one who had presumed to honor himself.",
        "<p>179:1.5 (1937.3) With the highest and the lowest positions thus occupied, the rest of the apostles chose places, some near Judas and some near Peter, until all were located. They were seated about the U-shaped table on these reclining divans in the following order: on the right of the Master, John; on the left, Judas, Simon Zelotes, Matthew, James Zebedee, Andrew, the Alpheus twins, Philip, Nathaniel, Thomas, and Simon Peter. <sup><a href=\"#footnote-1\" id=\"footnote-ref-1\">[1]</a></sup>"
      ],
      "reflection": null
    },
    {
      "type": "psalm",
      "heading": "Responsorial Psalm",
      "citation": "Psalm 68:4-5, 6-7, 10-11 [2]                                                                         R. (cf. 11b)  “God, with your goodness you help the afflicted endure.”",
      "response": "",
      "verses": [
        "<p>“The righteous celebrate, exulting before your presence. They erupt with joy. Sing out to our Source of Hope; make melodies to the Holy Name; lift up a song for the great chariot driver in the desert – to the Infinite One, exulting before our Upholder.” <br /><strong>R.</strong> <strong>“God, with your goodness you help the afflicted endure.”</strong>",
        "<p>“The parent to orphans and defender of widows, God dwells in a holy chamber. The Source of Justice settles the lonely into houses, leading prisoners toward lives that are fruitful.”<br /><strong>R. “God, with your goodness you help the afflicted endure.”</strong>",
        "<p>“Our Provider gives forth a generous drizzle of rain. The river and weary soil, the Creator renews them. Our livestock dwell on it. God, with your goodness you help the afflicted endure.”<br /><strong>R. “God, with your goodness you help the afflicted endure.” <sup><a href=\"#footnote-3\" id=\"footnote-ref-3\">[3]</a></sup>                       </strong>"
      ],
      "reflection": null
    },
    {
      "type": "second-reading",
      "heading": "Second Reading",
      "citation": "Urantia Part IV. The Life and Teachings of Jesus, Paper 167 – The Visit to Philadelphia, Section 1. Breakfast with the Pharisees, Paragraph 1 – 5a",
      "content": [
        "<p>167:1.1 (1833.4) There lived in Philadelphia a very wealthy and influential Pharisee who had accepted the teachings of Abner, and who invited Jesus to his house Sabbath morning for breakfast. It was known that Jesus was expected in Philadelphia at this time; so a large number of visitors, among them many Pharisees, had come over from Jerusalem and from elsewhere. Accordingly, about forty of these leading men and a few lawyers were bidden to this breakfast, which had been arranged in honor of the Master.",
        "<p>167:1.2 (1833.5) As Jesus lingered by the door, speaking with Abner, and after the host had seated himself, there came into the room one of the leading Pharisees of Jerusalem, a member of the Sanhedrin, and as was his habit, he made straight for the seat of honor at the left of the host. But since this place had been reserved for the Master and that on the right for Abner, the host beckoned the Jerusalem Pharisee to sit four seats to the left, and this dignitary was much offended because he did not receive the seat of honor.",
        "<p>167:1.3 (1834.1) Soon they were all seated and enjoying the visiting among themselves since the majority of those present were disciples of Jesus or else were friendly to the gospel. Only his enemies took notice of the fact that he did not observe the ceremonial washing of his hands before he sat down to eat. Abner washed his hands at the beginning of the meal but not during the serving.",
        "<p>167:1.4 (1834.2) Near the end of the meal there came in from the street a man long afflicted with a chronic disease and now in a dropsical condition. This man was a believer, having recently been baptized by Abner’s associates. He made no request of Jesus for healing, but the Master knew full well that this afflicted man came to this breakfast hoping thereby to escape the crowds which thronged him and thus be more likely to engage his attention. This man knew that few miracles were then being performed; however, he had reasoned in his heart that his sorry plight might possibly appeal to the Master’s compassion. And he was not mistaken, for, when he entered the room, both Jesus and the self-righteous Pharisee from Jerusalem took notice of him. The Pharisee was not slow to voice his resentment that such a one should be permitted to enter the room. But Jesus looked upon the sick man and smiled so benignly that he drew near and sat down upon the floor. As the meal was ending, the Master looked over his fellow guests and then, after glancing significantly at the man with dropsy, said: “My friends, teachers in Israel and learned lawyers, I would like to ask you a question: Is it lawful to heal the sick and afflicted on the Sabbath day, or not?” But those who were there present knew Jesus too well; they held their peace; they answered not his question.",
        "<p>167:1.5 (1834.3) Then went Jesus over to where the sick man sat and, taking him by the hand, said: “Arise and go your way. You have not asked to be healed, but I know the desire of your heart and the faith of your soul.” Before the man left the room, Jesus returned to his seat and, addressing those at the table, said: “Such works my Father does, not to tempt you into the kingdom, but to reveal himself to those who are already in the kingdom. You can perceive that it would be like the Father to do just such things because which one of you, having a favorite animal that fell in the well on the Sabbath day, would not go right out and draw him up?” . . . <sup><a href=\"#footnote-4\" id=\"footnote-ref-4\">[4]</a></sup>"
      ],
      "reflection": null
    },
    {
      "type": "alleluia",
      "heading": "Alleluia",
      "citation": "Urantia 167: 5b                                                                                                       R. Alleluia, alleluia.",
      "content": [
        "<p>‘Forget not, every one who exalts himself shall be humbled, while he who truly humbles himself shall be exalted.”                                                                                             <strong>R. Alleluia, alleluia.<sup><a href=\"#footnote-5\" id=\"footnote-ref-5\">[5]</a></sup></strong>"
      ]
    },
    {
      "type": "gospel",
      "heading": "Gospel",
      "citation": "Urantia Part IV. The Life and Teachings of Jesus, Paper 167 – The Visit to Philadelphia, Section 1. Breakfast with the Pharisees, Paragraph 5b",
      "content": [
        "<p>167:1.5b (1834.3) . . . And since no one would answer him, and inasmuch as his host evidently approved of what was going on, Jesus stood up and spoke to all present: “My brethren, when you are bidden to a marriage feast, sit not down in the chief seat, lest, perchance, a more honored man than you has been invited, and the host will have to come to you and request that you give your place to this other and honored guest. In this event, with shame you will be required to take a lower place at the table. When you are bidden to a feast, it would be the part of wisdom, on arriving at the festive table, to seek for the lowest place and take your seat therein, so that, when the host looks over the guests, he may say to you: ‘My friend, why sit in the seat of the least? come up higher’; and thus will such a one have glory in the presence of his fellow guests. Forget not, every one who exalts himself shall be humbled, while he who truly humbles himself shall be exalted. Therefore, when you entertain at dinner or give a supper, invite not always your friends, your brethren, your kinsmen, or your rich neighbors that they in return may bid you to their feasts, and thus will you be recompensed. When you give a banquet, sometimes bid the poor, the maimed, and the blind. In this way you shall be blessed in your heart, for you well know that the lame and the halt cannot repay you for your loving ministry.” <sup><a href=\"#footnote-6\" id=\"footnote-ref-6\">[6]</a></sup>"
      ],
      "reflection": null
    }
  ]
}