{
  "slug": "c42-23rd-sunday-in-ordinary-time-september-7-2025",
  "title": "23rd Sunday in Ordinary Time",
  "date": "September 7, 2025",
  "theme": "Counting the Cost",
  "year": "C",
  "heroImage": null,
  "sections": [
    {
      "type": "intro-reflection",
      "heading": "Initial Reflection – As in many of Vermeer’s paintings the thoughts of his subject seem profound yet are unclear. This young girl seems to be pondering some important decision as she holds a necklace of pearls while she gazes at the light streaming in through the window, complete with a mirror on the same wall, perhaps to signify self-reflection. In the context of today’s readings, might she be counting the cost of some major decision in her life between the spiritual and the material?",
      "content": []
    },
    {
      "type": "first-reading",
      "heading": "First Reading",
      "citation": "Urantia Part IV. The Life and Teachings of Jesus, Paper 140 – The Ordination of the Twelve,  Section 8. Thursday Afternoon on the Lake, Paragraph 2 – 8",
      "content": [
        "<p>140:8.2 (1579.4) 1. <em>Doing the Father’s will.</em> Jesus’ teaching to trust in the overcare of the heavenly Father was not a blind and passive fatalism. He quoted with approval, on this afternoon, an old Hebrew saying: “He who will not work shall not eat.” He pointed to his own experience as sufficient commentary on his teachings. His precepts about trusting the Father must not be adjudged by the social or economic conditions of modern times or any other age. His instruction embraces the ideal principles of living near God in all ages and on all worlds.",
        "<p>140:8.3 (1579.5) Jesus made clear to the three the difference between the requirements of apostleship and discipleship. And even then he did not forbid the exercise of prudence and foresight by the twelve. What he preached against was not forethought but anxiety, worry. He taught the active and alert submission to God’s will. In answer to many of their questions regarding frugality and thriftiness, he simply called attention to his life as carpenter, boatmaker, and fisherman, and to his careful organization of the twelve. He sought to make it clear that the world is not to be regarded as an enemy; that the circumstances of life constitute a divine dispensation working along with the children of God.",
        "<p>140:8.4 (1579.6) Jesus had great difficulty in getting them to understand his personal practice of nonresistance. He absolutely refused to defend himself, and it appeared to the apostles that he would be pleased if they would pursue the same policy. He taught them not to resist evil, not to combat injustice or injury, but he did not teach passive tolerance of wrongdoing. And he made it plain on this afternoon that he approved of the social punishment of evildoers and criminals, and that the civil government must sometimes employ force for the maintenance of social order and in the execution of justice.",
        "<p>140:8.5 (1579.7) He never ceased to warn his disciples against the evil practice of <em>retaliation</em>; he made no allowance for revenge, the idea of getting even. He deplored the holding of grudges. He disallowed the idea of an eye for an eye and a tooth for a tooth. He discountenanced the whole concept of private and personal revenge, assigning these matters to civil government, on the one hand, and to the judgment of God, on the other. He made it clear to the three that his teachings applied to the <em>individual,</em> not the state. He summarized his instructions up to that time regarding these matters, as:",
        "<p>140:8.6 (1580.1) Love your enemies—remember the moral claims of human brotherhood.",
        "<p>140:8.7 (1580.2) The futility of evil: A wrong is not righted by vengeance. Do not make the mistake of fighting evil with its own weapons.",
        "<p>140:8.8 (1580.3) Have faith—confidence in the eventual triumph of divine justice and eternal goodness.<sup><a href=\"#footnote-1\" id=\"footnote-ref-1\">[1]</a></sup>"
      ],
      "reflection": "<p>In relying on the will of God, one must embrace forethought, not anxiety, love must replace hate (even for enemies), evil must never be fought with vengeance or the weapons of evil, and one must have faith “in the eventual triumph of divine justice and eternal goodness.”"
    },
    {
      "type": "psalm",
      "heading": "Responsorial Psalm",
      "citation": "Psalm 90:3-4, 5-6, 12-13, 14 and 17 [2]                                                             R. (1) “God, you have been a dwelling place for us from one generation to the next.”",
      "response": "",
      "verses": [
        "<p>“Mortals can turn to you until they are crushed. You say, “Return, children of Adam.” Because a thousand years you can hold in your sight like a yesterday passing into today, a watchman’s hour of relief at night.”                                                                             <strong>R. “God, you have been a dwelling place for us from one generation to the next.”</strong>",
        "<p>“You flood the years; they pass like sleep. By morning, they vanish like grass. At dawn a person flowers and is fragrant; by evening we are withered and dry.”                                                       <strong>R. “God, you have been a dwelling place for us from one generation to the next.”</strong>",
        "<p>“Make known to us the portion of our days, so we may gain a heart of wisdom. Turn back to us, God – oh, how long? Have compassion on those trying to serve your will.”  <strong>R. “God, you have been a dwelling place for us from one generation to the next.”</strong>",
        "<p>“Fill our morning with acts of your kindness and we will sing and rejoice all our days. May the sweetness of the Holy One, our Creator, be constantly before us. And the work of our hands, gives us direction. And the work of our hands – give it direction toward you.”  <strong>R. “God, you have been a dwelling place for us from one generation to the next.”<sup><a href=\"#footnote-3\" id=\"footnote-ref-3\">[3]</a></sup> </strong>"
      ],
      "reflection": null
    },
    {
      "type": "second-reading",
      "heading": "Second Reading",
      "citation": "Urantia Part IV. The Life and Teachings of Jesus, Paper",
      "content": [
        "<p>163:3.3 (1803.5) As they went off by themselves, Jesus was grieved that Matadormus did not remain with them, for he greatly loved him. And when they had walked down by the lake, they sat there beside the water, and Peter, speaking for the twelve (who were all present by this time), said: “We are troubled by your words to the rich young man. Shall we require those who would follow you to give up all their worldly goods?” And Jesus said: “No, Peter, only those who would become apostles, and who desire to live with me as you do and as one family. But the Father requires that the affections of his children be pure and undivided. Whatever thing or person comes between you and the love of the truths of the kingdom, must be surrendered. If one’s wealth does not invade the precincts of the soul, it is of no consequence in the spiritual life of those who would enter the kingdom.”",
        "<p>163:3.4 (1804.1) And then said Peter, “But, Master, we have left everything to follow you, what then shall we have?” And Jesus spoke to all of the twelve: “Verily, verily, I say to you, there is no man who has left wealth, home, wife, brethren, parents, or children for my sake and for the sake of the kingdom of heaven who shall not receive manifold more in this world, perhaps with some persecutions, and in the world to come eternal life. But many who are first shall be last, while the last shall often be first. The Father deals with his creatures in accordance with their needs and in obedience to his just laws of merciful and loving consideration for the welfare of a universe. <sup><a href=\"#footnote-4\" id=\"footnote-ref-4\">[4]</a></sup>"
      ],
      "reflection": "<p>In the Urantia gospel for today Jesus says: “If you would be my disciples, you must be willing to forsake father, mother, wife, children, brothers, and sisters.”<p><strong>Alleluia </strong><a href=\"https://bible.usccb.org/bible/psalms/119?135\"><strong>Urantia 171:2.4 </strong></a><strong>                                                                                                               R.</strong> <strong>Alleluia, alleluia.</strong><p>“Now, then, must each of you sit down and count the cost of being my disciple.” <strong>R. Alleluia, alleluia.<sup><a href=\"#footnote-5\" id=\"footnote-ref-5\">[5]</a></sup></strong>"
    },
    {
      "type": "gospel",
      "heading": "Gospel",
      "citation": "Urantia Part IV. The Life and Teachings of Jesus, Paper 171 – On the Way to Jerusalem, Section 2. On Counting the Cost, Paragraphs 1 - 6",
      "content": [
        "<p>171:2.1 (1869.3) When Jesus and the company of almost one thousand followers arrived at the Bethany ford of the Jordan sometimes called Bethabara, his disciples began to realize that he was not going directly to Jerusalem. While they hesitated and debated among themselves, Jesus climbed upon a huge stone and delivered that discourse which has become known as “Counting the Cost.” The Master said:",
        "<p>171:2.2 (1869.4) “You who would follow after me from this time on, must be willing to pay the price of wholehearted dedication to the doing of my Father’s will. If you would be my disciples, you must be willing to forsake father, mother, wife, children, brothers, and sisters. If any one of you would now be my disciple, you must be willing to give up even your life just as the Son of Man is about to offer up his life for the completion of the mission of doing the Father’s will on earth and in the flesh.",
        "<p>171:2.3 (1869.5) “If you are not willing to pay the full price, you can hardly be my disciple. Before you go further, you should each sit down and count the cost of being my disciple. Which one of you would undertake to build a watchtower on your lands without first sitting down to count up the cost to see whether you had money enough to complete it? If you fail thus to reckon the cost, after you have laid the foundation, you may discover that you are unable to finish that which you have begun, and therefore will all your neighbors mock you, saying, ‘Behold, this man began to build but was unable to finish his work.’ Again, what king, when he prepares to make war upon another king, does not first sit down and take counsel as to whether he will be able, with ten thousand men, to meet him who comes against him with twenty thousand? If the king cannot afford to meet his enemy because he is unprepared, he sends an embassy to this other king, even when he is yet a great way off, asking for terms of peace.",
        "<p>171:2.4 (1870.1<a id=\"_Hlk204433842\"></a>) “Now, then, must each of you sit down and count the cost of being my disciple. From now on you will not be able to follow after us, listening to the teaching and beholding the works; you will be required to face bitter persecutions and to bear witness for this gospel in the face of crushing disappointment. If you are unwilling to renounce all that you are and to dedicate all that you have, then are you unworthy to be my disciple. If you have already conquered yourself within your own heart, you need have no fear of that outward victory which you must presently gain when the Son of Man is rejected by the chief priests and the Sadducees and is given into the hands of mocking unbelievers.",
        "<p>171:2.5 (1870.2) “Now should you examine yourself to find out your motive for being my disciple. If you seek honor and glory, if you are worldly minded, you are like the salt when it has lost its savor. And when that which is valued for its saltiness has lost its savor, wherewith shall it be seasoned? Such a condiment is useless; it is fit only to be cast out among the refuse. Now have I warned you to turn back to your homes in peace if you are not willing to drink with me the cup which is being prepared. Again and again have I told you that my kingdom is not of this world, but you will not believe me. He who has ears to hear let him hear what I say.” <strong><sup><a href=\"#footnote-6\" id=\"footnote-ref-6\">[6]</a></sup></strong>"
      ],
      "reflection": null
    }
  ]
}