{
  "slug": "c43-24th-sunday-of-ordinary-time-september-14-2025",
  "title": "Feast of the Exaltation of the Holy Cross",
  "date": "September 14, 2025",
  "theme": "Nicodemus Sunday",
  "year": "C",
  "heroImage": null,
  "sections": [
    {
      "type": "intro-reflection",
      "heading": "Initial Reflection – Jesus teaching Nicodemus about being born of the spirit leads to an opportunity for a new, corrected, revealed understanding of Jesus’s death on the cross.",
      "content": []
    },
    {
      "type": "first-reading",
      "heading": "First Reading",
      "citation": "Urantia Part I. The Central and Superuniverses, Paper 1 – The Universal Father, Section 5. Personality of the Universal Father, Paragraph 4 - 5",
      "content": [
        "<p>1:5.4 (28.1) Even though material mortals cannot see the person of God, they should rejoice in the assurance that he is a person; by faith accept the truth which portrays that <a id=\"_Hlk205552461\"></a>the Universal Father so loved the world as to provide for the eternal spiritual progression of its lowly inhabitants; that he “delights in his children.” God is lacking in none of those superhuman and divine attributes which constitute a perfect, eternal, loving, and infinite Creator personality.",
        "<p>1:5.5 (28.2) In the local creations (excepting the personnel of the superuniverses) God has no personal or residential manifestation aside from the Paradise Creator Sons who are the fathers of the inhabited worlds and the sovereigns of the local universes. If the faith of the creature were perfect, he would assuredly know that when he had seen a Creator Son he had seen the Universal Father; in seeking for the Father, he would not ask nor expect to see other than the Son. Mortal man simply cannot see God until he achieves completed spirit transformation and actually attains Paradise.<strong><sup><a href=\"#footnote-1\" id=\"footnote-ref-1\">[1]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "psalm",
      "heading": "Responsorial Psalm",
      "citation": "Psalm 78:1bc-2, 34-35, 36-37, 38 [2]                                                           R. (7b) “Forget not divine wonders, keeping close to the eternal will.”",
      "response": "",
      "verses": [
        "<p>“Listen, my people, to my teaching, bend down your ears to the utterance of my mouth. I will open my mouth with a parable, express my intent with riddles from long ago.” <br /><strong>R. “Forget not divine wonders, keeping close to the eternal will.”</strong>",
        "<p>“When they were dying, they sought you; they repented and prayed to their Upholder. They remembered that the Holy One was their Rock, the Highest of High their redeemer.”<br /><strong>R. “Forget not divine wonders, keeping close to the eternal will.”</strong>",
        "<p>“But they deceived you with their mouth, with their lips lied outright. Their hearts were not loyal; they had no faith in the covenant.”                                                                                                                             <strong>R. “Forget not divine wonders, keeping close to the eternal will.”</strong>",
        "<p>“But you are compassionate, forgiving wrong, never causing destruction. Again and again, you hold back anger, never awakening the entirety of your rage. “                               <strong>R. “Forget not divine wonders, keeping close to the eternal will.” <sup><a href=\"#footnote-3\" id=\"footnote-ref-3\">[3]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "second-reading",
      "heading": "Second Reading",
      "citation": "Urantia Part IV. The Life and Teachings of Jesus, Paper 188 – The Time in the Tomb, Section 4. Meaning of the Death on the Cross, Paragraphs 1- 3 &amp; 7 – 10",
      "content": [
        "<p>188:4.1 (2016.6) Although Jesus did not die this death on the cross to atone for the racial guilt of mortal man nor to provide some sort of effective approach to an otherwise offended and unforgiving God; even though the Son of Man did not offer himself as a sacrifice to appease the wrath of God and to open the way for sinful man to obtain salvation; notwithstanding that these ideas of atonement and propitiation are erroneous, nonetheless, there are significances attached to this death of Jesus on the cross which should not be overlooked. It is a fact that Urantia has become known among other neighboring inhabited planets as the “World of the Cross.”",
        "<p>188:4.2 (2016.7) Jesus desired to live a full mortal life in the flesh on Urantia. Death is, ordinarily, a part of life. Death is the last act in the mortal drama. In your well-meant efforts to escape the superstitious errors of the false interpretation of the meaning of the death on the cross, you should be careful not to make the great mistake of failing to perceive the true significance and the genuine import of the Master’s death.",
        "<p>188:4.3 (2016.8) Mortal man was never the property of the archdeceivers. Jesus did not die to ransom man from the clutch of the apostate rulers and fallen princes of the spheres. The Father in heaven never conceived of such crass injustice as damning a mortal soul because of the evil-doing of his ancestors. Neither was the Master’s death on the cross a sacrifice which consisted in an effort to pay God a debt which the race of mankind had come to owe him. . . .",
        "<p>188:4.7 (2017.2) Though it is hardly proper to speak of Jesus as a sacrificer, a ransomer, or a redeemer, it is wholly correct to refer to him as a <em>savior.</em> He forever made the way of salvation (survival) more clear and certain; he did better and more surely show the way of salvation for all the mortals of all the worlds of the universe of Nebadon.",
        "<p>188:4.8 (2017.3) When once you grasp the idea of God as a true and loving Father, the only concept which Jesus ever taught, you must forthwith, in all consistency, utterly abandon all those primitive notions about God as an offended monarch, a stern and all-powerful ruler whose chief delight is to detect his subjects in wrongdoing and to see that they are adequately punished, unless some being almost equal to himself should volunteer to suffer for them, to die as a substitute and in their stead. The whole idea of ransom and atonement is incompatible with the concept of God as it was taught and exemplified by Jesus of Nazareth. The infinite love of God is not secondary to anything in the divine nature.",
        "<p>188:4.9 (2017.4) All this concept of atonement and sacrificial salvation is rooted and grounded in selfishness. Jesus taught that <em>service</em> to one’s fellows is the highest concept of the brotherhood of spirit believers. Salvation should be taken for granted by those who believe in the fatherhood of God. The believer’s chief concern should not be the selfish desire for personal salvation but rather the unselfish urge to love and, therefore, serve one’s fellows even as Jesus loved and served mortal men.<sup><a href=\"#footnote-4\" id=\"footnote-ref-4\">[4]</a></sup>"
      ],
      "reflection": null
    },
    {
      "type": "alleluia",
      "heading": "Alleluia",
      "citation": "Urantia  142:6.4                                                                                                                      R. Alleluia, alleluia.",
      "content": [
        "<p>“Verily, verily, I say to you, Nicodemus, except a man be born from above, he cannot see the kingdom of God.”<br /><strong>R. Alleluia, alleluia.<sup><a href=\"#footnote-5\" id=\"footnote-ref-5\">[5]</a></sup></strong>"
      ]
    },
    {
      "type": "gospel",
      "heading": "Gospel",
      "citation": "Urantia Part IV. The Life and Teachings of Jesus, Paper 142 – The Passover at Jerusalem, Section 6. The Visit with Nicodemus, Paragraphs 1 &amp; 3 - 9",
      "content": [
        "<p>142:6.1 (1601.6) One evening at the home of Flavius there came to see Jesus one Nicodemus, a wealthy and elderly member of the Jewish Sanhedrin. He had heard much about the teachings of this Galilean, and so he went one afternoon to hear him as he taught in the temple courts. He would have gone often to hear Jesus teach, but he feared to be seen by the people in attendance upon his teaching, for already were the rulers of the Jews so at variance with Jesus that no member of the Sanhedrin would want to be identified in any open manner with him. Accordingly, Nicodemus had arranged with Andrew to see Jesus privately and after nightfall on this particular evening. Peter, James, and John were in Flavius’s garden when the interview began, but later they all went into the house where the discourse continued. . . .",
        "<p>142:6.3 (1602.2) Upon being presented by Flavius, Nicodemus said: “Rabbi, we know that you are a teacher sent by God, for no mere man could so teach unless God were with him. And I am desirous of knowing more about your teachings regarding the coming kingdom.”",
        "<p>142:6.4 (1602.3) Jesus answered Nicodemus: “Verily, verily, I say to you, Nicodemus, except a man be born from above, he cannot see the kingdom of God.” Then replied Nicodemus: “But how can a man be born again when he is old? He cannot enter a second time into his mother’s womb to be born.”",
        "<p>142:6.5 (1602.4) Jesus said: “Nevertheless, I declare to you, except a man be born of the spirit, he cannot enter into the kingdom of God. That which is born of the flesh is flesh, and that which is born of the spirit is spirit. But you should not marvel that I said you must be born from above. When the wind blows, you hear the rustle of the leaves, but you do not see the wind—whence it comes or whither it goes—and so it is with everyone born of the spirit. With the eyes of the flesh you can behold the manifestations of the spirit, but you cannot actually discern the spirit.”",
        "<p>142:6.6 (1602.5) Nicodemus replied: “But I do not understand—how can that be?” Said Jesus: “Can it be that you are a teacher in Israel and yet ignorant of all this? It becomes, then, the duty of those who know about the realities of the spirit to reveal these things to those who discern only the manifestations of the material world. But will you believe us if we tell you of the heavenly truths? Do you have the courage, Nicodemus, to believe in one who has descended from heaven, even the Son of Man?”",
        "<p>142:6.7 (1602.6) And Nicodemus said: “But how can I begin to lay hold upon this spirit which is to remake me in preparation for entering into the kingdom?” Jesus answered: “Already does the spirit of the Father in heaven indwell you. If you would be led by this spirit from above, very soon would you begin to see with the eyes of the spirit, and then by the wholehearted choice of spirit guidance would you be born of the spirit since your only purpose in living would be to do the will of your Father who is in heaven. And so finding yourself born of the spirit and happily in the kingdom of God, you would begin to bear in your daily life the abundant fruits of the spirit.”",
        "<p>142:6.8 (1602.7) Nicodemus was thoroughly sincere. He was deeply impressed but went away bewildered. Nicodemus was accomplished in self-development, in self-restraint, and even in high moral qualities. He was refined, egoistic, and altruistic; but he did not know how to <em>submit</em> his will to the will of the divine Father as a little child is willing to submit to the guidance and leading of a wise and loving earthly father, thereby becoming in reality a son of God, a progressive heir of the eternal kingdom.",
        "<p>142:6.9 (1603.1) But Nicodemus did summon faith enough to lay hold of the kingdom. He faintly protested when his colleagues of the Sanhedrin sought to condemn Jesus without a hearing; and with Joseph of Arimathea, he later boldly acknowledged his faith and claimed the body of Jesus, even when most of the disciples had fled in fear from the scenes of their Master’s final suffering and death.<strong><sup><a href=\"#footnote-6\" id=\"footnote-ref-6\">[6]</a></sup></strong>"
      ],
      "reflection": "<p>Nicodemus took Jesus literally, again and again, just like the apostles and we do so often.  They and we fail to look with the eyes of the Spirit, our Thought Adjuster, when we contemplating God and work with and serving our fellow human beings."
    }
  ]
}