{
  "slug": "c44-25th-sunday-of-ordinary-time-september-21-2025",
  "title": "25th Sunday in Ordinary Time",
  "date": "September 21, 2025",
  "theme": "The Parable of the Unjust Steward",
  "year": "C",
  "heroImage": null,
  "sections": [
    {
      "type": "intro-reflection",
      "heading": "Initial Reflection – This sixth century painting graphically illustrates the rich, pompous master and the shrewd, conniving steward in the foreground with the steward working with the master’s creditors in the background. This portrayal makes it difficult to understand how Jesus could be praising these two thieves in today’s gospel. Taken together, the three Urantia readings of today clear up this dilemma.",
      "content": [
        "<p><strong>Paper 159 – The Decapolis Tour, Section 3. Instruction for Teachers and Believers, Paragraphs 1 - 6</strong>",
        "<p>159:3.1 (1765.3) At Edrei, where Thomas and his associates labored, Jesus spent a day and a night and, in the course of the evening’s discussion, gave expression to the principles which should guide those who preach truth, and which should activate all who teach the gospel of the kingdom. Summarized and restated in modern phraseology, Jesus taught:",
        "<p>159:3.2 (1765.4) Always respect the personality of man. Never should a righteous cause be promoted by force; spiritual victories can be won only by spiritual power. This injunction against the employment of material influences refers to psychic force as well as to physical force. Overpowering arguments and mental superiority are not to be employed to coerce men and women into the kingdom. Man’s mind is not to be crushed by the mere weight of logic or overawed by shrewd eloquence. While emotion as a factor in human decisions cannot be wholly eliminated, it should not be directly appealed to in the teachings of those who would advance the cause of the kingdom. Make your appeals directly to the divine spirit that dwells within the minds of men. Do not appeal to fear, pity, or mere sentiment. In appealing to men, be fair; exercise self-control and exhibit due restraint; show proper respect for the personalities of your pupils. Remember that I have said: “Behold, I stand at the door and knock, and if any man will open, I will come in.”",
        "<p>159:3.3 (1765.5) In bringing men into the kingdom, do not lessen or destroy their self-respect. While overmuch self-respect may destroy proper humility and end in pride, conceit, and arrogance, the loss of self-respect often ends in paralysis of the will. It is the purpose of this gospel to restore self-respect to those who have lost it and to restrain it in those who have it. Make not the mistake of only condemning the wrongs in the lives of your pupils; remember also to accord generous recognition for the most praiseworthy things in their lives. Forget not that I will stop at nothing to restore self-respect to those who have lost it, and who really desire to regain it.",
        "<p>159:3.4 (1765.6) Take care that you do not wound the self-respect of timid and fearful souls. Do not indulge in sarcasm at the expense of my simple-minded brethren. Be not cynical with my fear-ridden children. Idleness is destructive of self-respect; therefore, admonish your brethren ever to keep busy at their chosen tasks, and put forth every effort to secure work for those who find themselves without employment.",
        "<p>159:3.5 (1766.1) Never be guilty of such unworthy tactics as endeavoring to frighten men and women into the kingdom. A loving father does not frighten his children into yielding obedience to his just requirements.",
        "<p>159:3.6 (1766.2) Sometime the children of the kingdom will realize that strong feelings of emotion are not equivalent to the leadings of the divine spirit. To be strongly and strangely impressed to do something or to go to a certain place, does not necessarily mean that such impulses are the leadings of the indwelling spirit.<strong><sup><a href=\"#footnote-1\" id=\"footnote-ref-1\">[1]</a></sup></strong>"
      ]
    },
    {
      "type": "psalm",
      "heading": "Responsorial Psalm",
      "citation": "Psalm 113:1-2, 4-6, 7-8 [2]                                                                         R. (cf. 1a, 7b) “Halleluyah! Lift the desperate from trash heaps.”",
      "response": "",
      "verses": [
        "<p>“Halleluyah! Shine forth praises to God. Give praise, you who serve the Creator! Give praise to the Holy Name. May the name of the Eternal be knelt to in wonder, from now until the end of time.” <br /><strong>R. “Halleluyah! Lift the desperate from trash heaps.”</strong>",
        "<p>“You are high above all nations; spread over the whole sky is your glory. Who is like you, our Creator, the one who sits among angels on a heavenly throne, who  comes down low to bear witness to the sky and to the earth.                                                         “<strong>R. “Halleluyah! Lift the desperate from trash heaps.”</strong>",
        "<p>“You raise the downtrodden from dust, lift the desperate from trash heaps to seat them at a table of the more wealthy, the more wealthy from among their people – “<br /><strong>R. “Halleluyah! Lift the desperate from trash heaps.” <sup><a href=\"#footnote-3\" id=\"footnote-ref-3\">[3]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "second-reading",
      "heading": "Second Reading",
      "citation": "Urantia Part IV.  The Life and Teachings of Jesus, Paper 173 – Monday in Jerusalem, Section 1. Cleansing the Temple, Paragraph 11",
      "content": [
        "<p>173:1.11 (1891.1) This cleansing of the temple discloses the Master’s attitude toward <a id=\"_Hlk205712483\"></a>commercializing the practices of religion as well as his detestation of all forms of unfairness and profiteering at the expense of the poor and the unlearned. This episode also demonstrates that Jesus did not look with approval upon the refusal to employ force to protect the majority of any given human group against the unfair and enslaving practices of unjust minorities who may be able to entrench themselves behind political, financial, or ecclesiastical power. <a id=\"_Hlk205712582\"></a>Shrewd, wicked, and designing men are not to be permitted to organize themselves for the exploitation and oppression of those who, because of their idealism, are not disposed to resort to force for self-protection or for the furtherance of their laudable life projects. <sup><a href=\"#footnote-4\" id=\"footnote-ref-4\">[4]</a></sup>"
      ],
      "reflection": null
    },
    {
      "type": "alleluia",
      "heading": "Alleluia",
      "citation": "Urantia 169:2.7                                                                                                     R. Alleluia, alleluia.",
      "content": [
        "<p>“You cannot serve God and mammon.”                                                                <strong>R. Alleluia, alleluia.<sup><a href=\"#footnote-5\" id=\"footnote-ref-5\">[5]</a></sup></strong>"
      ]
    },
    {
      "type": "gospel",
      "heading": "Gospel",
      "citation": "Urantia Part IV. The Life and Teachings of Jesus, Paper 169 – Last Teachings at Pella, Section 2. Parable of the Shrewd Steward, Paragraphs 1 – 7",
      "content": [
        "<p>169:2.1 (1853.4) One evening Simon Zelotes, commenting on one of Jesus’ statements, said: “Master, what did you mean when you said today that many of the children of the world are wiser in their generation than are the children of the kingdom since they are skillful in making friends with the mammon of unrighteousness?” Jesus answered:",
        "<p>169:2.2 (1853.5) “Some of you, before you entered the kingdom, were very shrewd in dealing with your business associates. If you were unjust and often unfair, you were nonetheless prudent and farseeing in that you transacted your business with an eye single to your present profit and future safety. Likewise should you now so order your lives in the kingdom as to provide for your present joy while you also make certain of your future enjoyment of treasures laid up in heaven. If you were so diligent in making gains for yourselves when in the service of self, why should you show less diligence in gaining souls for the kingdom since you are now servants of the brotherhood of man and stewards of God?",
        "<p>169:2.3 (1853.6) “You may all learn a lesson from the story of a certain rich man who had a shrewd but unjust steward. This steward had not only oppressed his master’s clients for his own selfish gain, but he had also directly wasted and squandered his master’s funds. When all this finally came to the ears of his master, he called the steward before him and asked the meaning of these rumors and required that he should give immediate accounting of his stewardship and prepare to turn his master’s affairs over to another.",
        "<p>169:2.4 (1853.7) “Now this unfaithful steward began to say to himself: ‘What shall I do since I am about to lose this stewardship? I have not the strength to dig; to beg I am ashamed. I know what I will do to make certain that, when I am put out of this stewardship, I will be welcomed into the houses of all who do business with my master.’ And then, calling in each of his lord’s debtors, he said to the first, ‘How much do you owe my master?’ He answered, ‘A hundred measures of oil.’ Then said the steward, ‘Take your wax board bond, sit down quickly, and change it to fifty.’ Then he said to another debtor, ‘How much do you owe?’ And he replied, ‘A hundred measures of wheat.’ Then said the steward, ‘Take your bond and write fourscore.’ And this he did with numerous other debtors. And so did this dishonest steward seek to make friends for himself after he would be discharged from his stewardship. Even his lord and master, when he subsequently found out about this, was compelled to admit that his unfaithful steward had at least shown sagacity in the manner in which he had sought to provide for future days of want and adversity.",
        "<p>169:2.5 (1854.1) “And it is in this way that the sons of this world sometimes show more wisdom in their preparation for the future than do the children of light. I say to you who profess to be acquiring treasure in heaven: Take lessons from those who make friends with the mammon of unrighteousness, and likewise so conduct your lives that you make eternal friendship with the forces of righteousness in order that, when all things earthly fail, you shall be joyfully received into the eternal habitations.",
        "<p>169:2.6 (1854.2) “I affirm that he who is faithful in little will also be faithful in much, while he who is unrighteous in little will also be unrighteous in much. If you have not shown foresight and integrity in the affairs of this world, how can you hope to be faithful and prudent when you are trusted with the stewardship of the true riches of the heavenly kingdom? If you are not good stewards and faithful bankers, if you have not been faithful in that which is another’s, who will be foolish enough to give you great treasure in your own name?",
        "<p>169:2.7 (1854.3) “And again I assert that no man can serve two masters; either he will hate the one and love the other, or else he will hold to one while he despises the other. <a id=\"_Hlk205712794\"></a>You cannot serve God and mammon.” <strong><sup><a href=\"#footnote-6\" id=\"footnote-ref-6\">[6]</a></sup></strong>"
      ],
      "reflection": "<p>The first two Urantia paragraphs clear up and put in context how Jesus could be apparently praising such an unsavory steward in the parable.  Effectively, Jesus was telling his apostles that in serving God be sure to be apply their skills of shrewdness to think of gaining souls in the present while providing for the growth of their own souls, the equivalent of “present profit and future safety.”  Read in this context the parable is much easier to begin to understand."
    }
  ]
}