{
  "slug": "c45-26th-sunday-of-ordinary-time-september-28-2025",
  "title": "26th Sunday in Ordinary Time",
  "date": "September 28, 2025",
  "theme": "Further Teachings on Wealth",
  "year": "C",
  "heroImage": null,
  "sections": [
    {
      "type": "intro-reflection",
      "heading": "Initial Reflection – This late 16th century painting by Bassano documents the debauching life of the rich man, Dives, and the dogs licking the wounds of the beggar, Lazarus, the subject of today’s gospel. The first two readings presents Jesus’s earlier teaching on the proper administration of wealth.",
      "content": []
    },
    {
      "type": "first-reading",
      "heading": "First Reading",
      "citation": "Urantia Part IV. The Life and Teachings of Jesus, Paper 132 – Sojourn at Rome, Section 5. Counseling the Rich Man, Paragraphs 1 - 13",
      "content": [
        "<p>132:5.1 (1462.2) A certain rich man, a Roman citizen and a Stoic, became greatly interested in Jesus’ teaching, having been introduced by Angamon. After many intimate conferences this wealthy citizen asked Jesus what he would do with wealth if he had it, and Jesus answered him: “I would bestow material wealth for the enhancement of material life, even as I would minister knowledge, wisdom, and spiritual service for the enrichment of the intellectual life, the ennoblement of the social life, and the advancement of the spiritual life. I would administer material wealth as a wise and effective trustee of the resources of one generation for the benefit and ennoblement of the next and succeeding generations.”",
        "<p>132:5.2 (1462.3) But the rich man was not fully satisfied with Jesus’ answer. He made bold to ask again: “But what do you think a man in my position should do with his wealth? Should I keep it, or should I give it away?” And when Jesus perceived that he really desired to know more of the truth about his loyalty to God and his duty to men, he further answered: “My good friend, I discern that you are a sincere seeker after wisdom and an honest lover of truth; therefore am I minded to lay before you my view of the solution of your problems having to do with the responsibilities of wealth. I do this because you have <em>asked</em> for my counsel, and in giving you this advice, I am not concerned with the wealth of any other rich man; I am offering advice only to you and for your personal guidance. If you honestly desire to regard your wealth as a trust, if you really wish to become a wise and efficient steward of your accumulated wealth, then would I counsel you to make the following analysis of the sources of your riches: Ask yourself, and do your best to find the honest answer, whence came this wealth? And as a help in the study of the sources of your great fortune, I would suggest that you bear in mind the following ten different methods of amassing material wealth:",
        "<p>132:5.3 (1462.4)“ 1. Inherited wealth—riches derived from parents and other ancestors.",
        "<p>132:5.4 (1462.5)“ 2. Discovered wealth—riches derived from the uncultivated resources of mother earth.",
        "<p>132:5.5 (1462.6) “3. Trade wealth—riches obtained as a fair profit in the exchange and barter of material goods.",
        "<p>132:5.6 (1462.7)“ 4. Unfair wealth—riches derived from the unfair exploitation or the enslavement of one’s fellows.",
        "<p>132:5.7 (1463.1) “5. Interest wealth—income derived from the fair and just earning possibilities of invested capital.",
        "<p>132:5.8 (1463.2)“ 6. Genius wealth—riches accruing from the rewards of the creative and inventive endowments of the human mind.",
        "<p>132:5.9 (1463.3) “7. Accidental wealth—riches derived from the generosity of one’s fellows or taking origin in the circumstances of life.",
        "<p>132:5.10 (1463.4) “8. Stolen wealth—riches secured by unfairness, dishonesty, theft, or fraud.",
        "<p>132:5.11 (1463.5) “9. Trust funds—wealth lodged in your hands by your fellows for some specific use, now or in the future.",
        "<p>132:5.12 (1463.6)“ 10. Earned wealth—riches derived directly from your own personal labor, the fair and just reward of your own daily efforts of mind and body.",
        "<p>132:5.13 (1463.7) “And so, my friend, if you would be a faithful and just steward of your large fortune, before God and in service to men, you must approximately divide your wealth into these ten grand divisions, and then proceed to administer each portion in accordance with the wise and honest interpretation of the laws of justice, equity, fairness, and true efficiency; albeit, the God of heaven would not condemn you if sometimes you erred, in doubtful situations, on the side of merciful and unselfish regard for the distress of the suffering victims of the unfortunate circumstances of mortal life. When in honest doubt about the equity and justice of material situations, let your decisions favor those who are in need, favor those who suffer the misfortune of undeserved hardships.” <strong><sup><a href=\"#footnote-1\" id=\"footnote-ref-1\">[1]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "psalm",
      "heading": "Responsorial Psalm",
      "citation": "Psalm 146:7, 8-9, 9-10 [2]                                                                          R. (1b) “Let my life stand in praise of God.”",
      "response": "",
      "verses": [
        "<p>“Who stands faithful with us forever, who brings justice to the oppressed, food to the hungry, release for the bound.” <br /><strong>R. “Let my life stand in praise of God.”</strong>",
        "<p>“Who opens the eyes of the blind – who straightens those hunched over by sorrow. God loves the righteous, keeping watch over strangers. <br /><strong>R. “Let my life stand in praise of God.”</strong>",
        "<p>“Encouraging orphans and widows. But the road of the wrongful is twisted. The Holy One will sustain us forever – your God, O Zion, from one generation to the next. Praise God!                                                                                                                               <strong>R. “Let my life stand in praise of God.” <sup><a href=\"#footnote-3\" id=\"footnote-ref-3\">[3]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "second-reading",
      "heading": "Second Reading",
      "citation": "Urantia Part IV. The Life and Teachings of Jesus, Paper 132 – Sojourn at Rome, Section 5. Counseling the Rich Man, Paragraphs 14 - 25",
      "content": [
        "<p>132:5.14 (1463.8) After discussing these matters for several hours and in response to the rich man’s request for further and more detailed instruction, Jesus went on to amplify his advice, in substance saying: “While I offer further suggestions concerning your attitude toward wealth, I would admonish you to receive my counsel as given only to you and for your personal guidance. I speak only for myself and to you as an inquiring friend. I adjure you not to become a dictator as to how other rich men shall regard their wealth. I would advise you:",
        "<p>132:5.15 (1463.9) “1. As steward of inherited wealth you should consider its sources. You are under moral obligation to represent the past generation in the honest transmittal of legitimate wealth to succeeding generations after subtracting a fair toll for the benefit of the present generation. But you are not obligated to perpetuate any dishonesty or injustice involved in the unfair accumulation of wealth by your ancestors. Any portion of your inherited wealth which turns out to have been derived through fraud or unfairness, you may disburse in accordance with your convictions of justice, generosity, and restitution. The remainder of your legitimate inherited wealth you may use in equity and transmit in security as the trustee of one generation for another. Wise discrimination and sound judgment should dictate your decisions regarding the bequest of riches to your successors.",
        "<p>132:5.16 (1463.10) “2. Everyone who enjoys wealth as a result of discovery should remember that one individual can live on earth but a short season and should, therefore, make adequate provision for the sharing of these discoveries in helpful ways by the largest possible number of his fellow men. While the discoverer should not be denied all reward for efforts of discovery, neither should he selfishly presume to lay claim to all of the advantages and blessings to be derived from the uncovering of nature’s hoarded resources.",
        "<p>132:5.17 (1464.1) “3. As long as men choose to conduct the world’s business by trade and barter, they are entitled to a fair and legitimate profit. Every tradesman deserves wages for his services; the merchant is entitled to his hire. The fairness of trade and the honest treatment accorded one’s fellows in the organized business of the world create many different sorts of profit wealth, and all these sources of wealth must be judged by the highest principles of justice, honesty, and fairness. The honest trader should not hesitate to take the same profit which he would gladly accord his fellow trader in a similar transaction. While this sort of wealth is not identical with individually earned income when business dealings are conducted on a large scale, at the same time, such honestly accumulated wealth endows its possessor with a considerable equity as regards a voice in its subsequent distribution.",
        "<p>132:5.18 (1464.2)“ 4. No mortal who knows God and seeks to do the divine will can stoop to engage in the oppressions of wealth. No noble man will strive to accumulate riches and amass wealth-power by the enslavement or unfair exploitation of his brothers in the flesh. Riches are a moral curse and a spiritual stigma when they are derived from the sweat of oppressed mortal man. All such wealth should be restored to those who have thus been robbed or to their children and their children’s children. An enduring civilization cannot be built upon the practice of defrauding the laborer of his hire.",
        "<p>132:5.19 (1464.3) “5. Honest wealth is entitled to interest. As long as men borrow and lend, that which is fair interest may be collected provided the capital lent was legitimate wealth. First cleanse your capital before you lay claim to the interest. Do not become so small and grasping that you would stoop to the practice of usury. Never permit yourself to be so selfish as to employ money-power to gain unfair advantage over your struggling fellows. Yield not to the temptation to take usury from your brother in financial distress.",
        "<p>132:5.20 (1464.4) “6. If you chance to secure wealth by flights of genius, if your riches are derived from the rewards of inventive endowment, do not lay claim to an unfair portion of such rewards. The genius owes something to both his ancestors and his progeny; likewise is he under obligation to the race, nation, and circumstances of his inventive discoveries; he should also remember that it was as man among men that he labored and wrought out his inventions. It would be equally unjust to deprive the genius of all his increment of wealth. And it will ever be impossible for men to establish rules and regulations applicable equally to all these problems of the equitable distribution of wealth. You must first recognize man as your brother, and if you honestly desire to do by him as you would have him do by you, the commonplace dictates of justice, honesty, and fairness will guide you in the just and impartial settlement of every recurring problem of economic rewards and social justice.",
        "<p>132:5.21 (1464.5) “7. Except for the just and legitimate fees earned in administration, no man should lay personal claim to that wealth which time and chance may cause to fall into his hands. Accidental riches should be regarded somewhat in the light of a trust to be expended for the benefit of one’s social or economic group. The possessors of such wealth should be accorded the major voice in the determination of the wise and effective distribution of such unearned resources. Civilized man will not always look upon all that he controls as his personal and private possession.",
        "<p>132:5.22 (1465.1) “8. If any portion of your fortune has been knowingly derived from fraud; if aught of your wealth has been accumulated by dishonest practices or unfair methods; if your riches are the product of unjust dealings with your fellows, make haste to restore all these ill-gotten gains to the rightful owners. Make full amends and thus cleanse your fortune of all dishonest riches.",
        "<p>132:5.23 (1465.2) “9. The trusteeship of the wealth of one person for the benefit of others is a solemn and sacred responsibility. Do not hazard or jeopardize such a trust. Take for yourself of any trust only that which all honest men would allow.",
        "<p>132:5.24 (1465.3) “10. That part of your fortune which represents the earnings of your own mental and physical efforts—if your work has been done in fairness and equity—is truly your own. No man can gainsay your right to hold and use such wealth as you may see fit provided your exercise of this right does not work harm upon your fellows.”",
        "<p>132:5.25 (1465.4) When Jesus had finished counseling him, this wealthy Roman arose from his couch and, in saying farewell for the night, delivered himself of this promise: “My good friend, I perceive you are a man of great wisdom and goodness, and tomorrow I will begin the administration of all my wealth in accordance with your counsel.” <strong><sup><a href=\"#footnote-4\" id=\"footnote-ref-4\">[4]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "alleluia",
      "heading": "Alleluia",
      "citation": "Urantia – 169:3.2                                                                                           R. Alleluia, alleluia.",
      "content": [
        "<p>And then said Abraham: ‘If they hear not Moses and the prophets, neither will they be persuaded even if one were to rise from the dead.’”                                                    <strong>R. Alleluia, alleluia. <sup><a href=\"#footnote-5\" id=\"footnote-ref-5\">[5]</a></sup></strong>"
      ]
    },
    {
      "type": "gospel",
      "heading": "Gospel",
      "citation": "Urantia Part IV. The Life and Teachings of Jesus, Paper 169 – Last Teaching at Pella, Section 3. The Rich Man and the Beggar, Paragraphs 1 -3",
      "content": [
        "<p>169:3.1 (1854.5) When the meeting became too noisy, Simon Peter, standing up, took charge, saying: “Men and brethren, it is not seemly thus to dispute among yourselves. The Master has spoken, and you do well to ponder his words. And this is no new doctrine which he proclaimed to you. Have you not also heard the allegory of the Nazarites concerning the rich man and the beggar? Some of us heard John the Baptist thunder this parable of warning to those who love riches and covet dishonest wealth. And while this olden parable is not according to the gospel we preach, you would all do well to heed its lessons until such a time as you comprehend the new light of the kingdom of heaven. The story as John told it was like this:",
        "<p>169:3.2 (1854.6) “There was a certain rich man named Dives, who, being clothed in purple and fine linen, lived in mirth and splendor every day. And there was a certain beggar named Lazarus, who was laid at this rich man’s gate, covered with sores and desiring to be fed with the crumbs which fell from the rich man’s table; yes, even the dogs came and licked his sores. And it came to pass that the beggar died and was carried away by the angels to rest in Abraham’s bosom. And then, presently, this rich man also died and was buried with great pomp and regal splendor. When the rich man departed from this world, he waked up in Hades, and finding himself in torment, he lifted up his eyes and beheld Abraham afar off and Lazarus in his bosom. And then Dives cried aloud: ‘Father Abraham, have mercy on me and send over Lazarus that he may dip the tip of his finger in water to cool my tongue, for I am in great anguish because of my punishment.’ And then Abraham replied: ‘My son, you should remember that in your lifetime you enjoyed the good things while Lazarus in like manner suffered the evil. But now all this is changed, seeing that Lazarus is comforted while you are tormented. And besides, between us and you there is a great gulf so that we cannot go to you, neither can you come over to us.’ Then said Dives to Abraham: ‘I pray you send Lazarus back to my father’s house, inasmuch as I have five brothers, that he may so testify as to prevent my brothers from coming to this place of torment.’ But Abraham said: ‘My son, they have Moses and the prophets; let them hear them.’ And then answered Dives: ‘No, No, Father Abraham! but if one go to them from the dead, they will repent.’ <a id=\"_Hlk205749940\"></a>And then said Abraham: ‘If they hear not Moses and the prophets, neither will they be persuaded even if one were to rise from the dead.’”",
        "<p>169:3.3 (1855.1) After Peter had recited this ancient parable of the Nazarite brotherhood, and since the crowd had quieted down, Andrew arose and dismissed them for the night. Although both the apostles and his disciples frequently asked Jesus questions about the parable of Dives and Lazarus, he never consented to make comment thereon. <sup><a href=\"#footnote-6\" id=\"footnote-ref-6\">[6]</a></sup>"
      ],
      "reflection": null
    }
  ]
}