{
  "slug": "c46-27th-sunday-of-ordinary-time-october-5-2025",
  "title": "27th Sunday in Ordinary Time",
  "date": "October 5, 2025",
  "theme": "The Faith of Jesus",
  "year": "C",
  "heroImage": null,
  "sections": [
    {
      "type": "intro-reflection",
      "heading": "Initial Reflection – Teachings on faith are at the heart of Jesus’s teaching as the three principal readings for today emphasize.",
      "content": []
    },
    {
      "type": "first-reading",
      "heading": "First Reading",
      "citation": "Urantia, Part IV.  The Life and Teachings of Jesus, Paper 132 – The Sojourn at Rome, Section 3. Truth and Faith, Paragraph 1 &amp; 4 – 7",
      "content": [
        "<p>[132:3.1 (1459.1) Nabon was a Greek Jew and foremost among the leaders of the chief mystery cult in Rome, the Mithraic. While this high priest of Mithraism held many conferences with the Damascus scribe, he was most permanently influenced by their discussion of truth and faith one evening. Nabon had thought to make a convert of Jesus and had even suggested that he return to Palestine as a Mithraic teacher. He little realized that Jesus was preparing him to become one of the early converts to the gospel of the kingdom.] Restated in modern phraseology, the substance of Jesus’ teaching was: . . .",
        "<p>132:3.4 (1459.4) Revealed truth, personally discovered truth, is the supreme delight of the human soul; it is the joint creation of the material mind and the indwelling spirit. The eternal salvation of this truth-discerning and beauty-loving soul is assured by that hunger and thirst for goodness which leads this mortal to develop a singleness of purpose to do the Father’s will, to find God and to become like him. There is never conflict between true knowledge and truth. There may be conflict between knowledge and human beliefs, beliefs colored with prejudice, distorted by fear, and dominated by the dread of facing new facts of material discovery or spiritual progress.",
        "<p>132:3.5 (1459.5) But truth can never become man’s possession without the exercise of faith. This is true because man’s thoughts, wisdom, ethics, and ideals will never rise higher than his faith, his sublime hope. And all such true faith is predicated on profound reflection, sincere self-criticism, and uncompromising moral consciousness. Faith is the inspiration of the spiritized creative imagination.",
        "<p>132:3.6 (1459.6) Faith acts to release the superhuman activities of the divine spark, the immortal germ, that lives within the mind of man, and which is the potential of eternal survival. Plants and animals survive in time by the technique of passing on from one generation to another identical particles of themselves. The human soul (personality) of man survives mortal death by identity association with this indwelling spark of divinity, which is immortal, and which functions to perpetuate the human personality upon a continuing and higher level of progressive universe existence. The concealed seed of the human soul is an immortal spirit. The second generation of the soul is the first of a succession of personality manifestations of spiritual and progressing existences, terminating only when this divine entity attains the source of its existence, the personal source of all existence, God, the Universal Father.",
        "<p>132:3.7 (1459.7) Human life continues—survives—because it has a universe function, the task of finding God. The faith-activated soul of man cannot stop short of the attainment of this goal of destiny; and when it does once achieve this divine goal, it can never end because it has become like God—eternal. <strong><sup><a href=\"#footnote-1\" id=\"footnote-ref-1\">[1]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "psalm",
      "heading": "Responsorial Psalm",
      "citation": "Psalm 95:1-2, 6-7, 8-9 [2]                                                                                                             R. (8) Today – if only they would listen to your voice: Don’t harden your heart.",
      "response": "",
      "verses": [
        "<p>“Come, let us sing out to God! Let us shout with joy to our Rock of Salvation! Let us come before our Redeemer with thanks, proclaim with music the Holy Name.”<br /><strong>R. Today – if only they would listen to your voice: Don’t harden your heart.</strong>",
        "<p>“Come, let us bow down and humble ourselves. Let us praise the Holy One, our Maker. For you are our Source of Strength, and we, the people, the flock that you graze.”<br /><strong>R. Today – if only they would listen to your voice: Don’t harden your heart.</strong>",
        "<p>“<a id=\"_Hlk159868938\"></a>Today – if only they would listen to your voice: <em>Don’t harden your heart, as at Merivah, the Place of Contention, like the day you tested me in the desert, when your ancestors put me on trial though they had witnessed my work.”</em><br /><strong>R. Today – if only they would listen to your voice: Don’t harden your heart.<sup><a href=\"#footnote-3\" id=\"footnote-ref-3\">[3]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "second-reading",
      "heading": "Second Reading",
      "citation": "Urantia Part IV. The Life and Teachings of Jesus, Paper 158 - The Mount of Transfiguration, Section 6. In Celsus’ Garden, Paragraphs 1 - 4",
      "content": [
        "<p>158:6.1 (1758.2) They remained overnight with Celsus, and that evening in the garden, after they had eaten and rested, the twelve gathered about Jesus, and Thomas said: “Master, while we who tarried behind still remain ignorant of what transpired up on the mountain, and which so greatly cheered our brethren who were with you, we crave to have you talk with us concerning our defeat and instruct us in these matters, seeing that those things which happened on the mountain cannot be disclosed at this time.”",
        "<p>158:6.2 (1758.3) And Jesus answered Thomas, saying: “Everything which your brethren heard on the mountain shall be revealed to you in due season. But I will now show you the cause of your defeat in that which you so unwisely attempted. While your Master and his companions, your brethren, ascended yonder mountain yesterday to seek for a larger knowledge of the Father’s will and to ask for a richer endowment of wisdom effectively to do that divine will, you who remained on watch here with instructions to strive to acquire the mind of spiritual insight and to pray with us for a fuller revelation of the Father’s will, failed to exercise the faith at your command but, instead, yielded to the temptation and fell into your old evil tendencies to seek for yourselves preferred places in the kingdom of heaven—the material and temporal kingdom which you persist in contemplating. And you cling to these erroneous concepts in spite of the reiterated declaration that my kingdom is not of this world.",
        "<p>158:6.3 (1758.4) “No sooner does your faith grasp the identity of the Son of Man than your selfish desire for worldly preferment creeps back upon you, and you fall to discussing among yourselves as to who should be greatest in the kingdom of heaven, a kingdom which, as you persist in conceiving it, does not exist, nor ever shall. Have not I told you that he who would be greatest in the kingdom of my Father’s spiritual brotherhood must become little in his own eyes and thus become the server of his brethren? Spiritual greatness consists in an understanding love that is Godlike and not in an enjoyment of the exercise of material power for the exaltation of self. In what you attempted, in which you so completely failed, your purpose was not pure. Your motive was not divine. Your ideal was not spiritual. Your ambition was not altruistic. Your procedure was not based on love, and your goal of attainment was not the will of the Father in heaven.",
        "<p>158:6.4 (1758.5) “How long will it take you to learn that you cannot time-shorten the course of established natural phenomena except when such things are in accordance with the Father’s will? nor can you do spiritual work in the absence of spiritual power. And you can do neither of these, even when their potential is present, without the existence of that third and essential human factor, the personal experience of the possession of living faith. Must you always have material manifestations as an attraction for the spiritual realities of the kingdom? Can you not grasp the spirit significance of my mission without the visible exhibition of unusual works? When can you be depended upon to adhere to the higher and spiritual realities of the kingdom regardless of the outward appearance of all material manifestations?” <strong><sup><a href=\"#footnote-4\" id=\"footnote-ref-4\">[4]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "alleluia",
      "heading": "Alleluia",
      "citation": "Urantia 196:0.3                                                                                                                    R. Alleluia, alleluia.",
      "content": [
        "<p>Jesus’ great contribution to the values of human experience was not that he revealed so many new ideas about the Father in heaven, but rather that he so magnificently and humanly demonstrated a new and higher type of <em>living faith in God.</em>                                                                                          <strong>R. Alleluia, alleluia. <sup><a href=\"#footnote-5\" id=\"footnote-ref-5\">[5]</a></sup></strong>"
      ]
    },
    {
      "type": "gospel",
      "heading": "Gospel",
      "citation": "Urantia, Part IV. The Life and Teachings of Jesus, Paper 196 – The Faith of Jesus, Section 0. Introduction, Paragraphs 1 - 3",
      "content": [
        "<p>196:0.1 (2087.1) Jesus enjoyed a sublime and wholehearted faith in God. He experienced the ordinary ups and downs of mortal existence, but he never religiously doubted the certainty of God’s watchcare and guidance. His faith was the outgrowth of the insight born of the activity of the divine presence, his indwelling Adjuster. His faith was neither traditional nor merely intellectual; it was wholly personal and purely spiritual.",
        "<p>196:0.2 (2087.2) The human Jesus saw God as being holy, just, and great, as well as being true, beautiful, and good. All these attributes of divinity he focused in his mind as the “will of the Father in heaven.” Jesus’ God was at one and the same time “The Holy One of Israel” and “The living and loving Father in heaven.” The concept of God as a Father was not original with Jesus, but he exalted and elevated the idea into a sublime experience by achieving a new revelation of God and by proclaiming that every mortal creature is a child of this Father of love, a son of God.",
        "<p>196:0.3 (2087.3) Jesus did not cling to faith in God as would a struggling soul at war with the universe and at death grips with a hostile and sinful world; he did not resort to faith merely as a consolation in the midst of difficulties or as a comfort in threatened despair; faith was not just an illusory compensation for the unpleasant realities and the sorrows of living. In the very face of all the natural difficulties and the temporal contradictions of mortal existence, he experienced the tranquillity of supreme and unquestioned trust in God and felt the tremendous thrill of living, by faith, in the very presence of the heavenly Father. And this triumphant faith was a living experience of actual spirit attainment. Jesus’ great contribution to the values of human experience was not that he revealed so many new ideas about the Father in heaven, but rather that he so magnificently and humanly demonstrated a new and higher type of <em>living faith in God.</em> Never on all the worlds of this universe, in the life of any one mortal, did God ever become such a <em>living reality</em> as in the human experience of Jesus of Nazareth.<strong><sup><a href=\"#footnote-6\" id=\"footnote-ref-6\">[6]</a></sup></strong>"
      ],
      "reflection": "<p>It is a faith that has nothing to do with Luke’s account of how faith can materially uproot and cast a mulberry tree into the sea.  Nor is a duty that is expected of us. It is a joyful framing of the world and inner experience that allows us to vibrantly live the fatherhood of God and the brotherhood of man, Jesus’s true gospel, in this world and the next."
    }
  ]
}