{
  "slug": "c47-28th-sunday-in-ordinary-time-october-12-2025",
  "title": "28th Sunday in Ordinary Time",
  "date": "October 12, 2025",
  "theme": "Thanksgiving Sunday",
  "year": "C",
  "heroImage": null,
  "sections": [
    {
      "type": "intro-reflection",
      "heading": "Initial Reflection – This illustration from a medieval book or codex shows the strong emotional power of the story of the Samaritan leper who returned to give thanks to Jesus.  The first reading for today shows how the emotion and spirit of thanksgiving permeates our journey to God.  The second reading ranks worship and thanksgiving or gratitude as the healthiest way to approach and commune with God.",
      "content": []
    },
    {
      "type": "first-reading",
      "heading": "First Reading",
      "citation": "Urantia Part I. The Central and Superuniverses, Paper 30 - Personalities of the Grand Universe, Section 4. The Ascending Mortals, Paragraph 26 - 30",
      "content": [
        "<p>30:4.26 (343.1) 6. <em>Havona Pilgrims.</em> When spirit development is complete, even though not replete, then the surviving mortal prepares for the long flight to Havona, the haven of evolutionary spirits. On earth you were a creature of flesh and blood; through the local universe you were a morontia being; through the superuniverse you were an evolving spirit; with your arrival on the receiving worlds of Havona your spiritual education begins in reality and in earnest; your eventual appearance on Paradise will be as a perfected spirit.",
        "<p>30:4.27 (343.2) The journey from the superuniverse headquarters to the Havona receiving spheres is always made alone. From now on no more class or group instruction will be administered. You are through with the technical and administrative training of the evolutionary worlds of time and space. Now begins your <em>personal education,</em> your individual spiritual training. From first to last, throughout all Havona, the instruction is personal and threefold in nature: intellectual, spiritual, and experiential.",
        "<p>30:4.28 (343.3) The first act of your Havona career will be to recognize and thank your transport seconaphim for the long and safe journey. Then you are presented to those beings who will sponsor your early Havona activities. Next you go to register your arrival and prepare your message of thanksgiving and adoration for dispatch to the Creator Son of your local universe, the universe Father who made possible your sonship career. This concludes the formalities of the Havona arrival; whereupon you are accorded a long period of leisure for free observation, and this affords opportunity for looking up your friends, fellows, and associates of the long ascension experience. You may also consult the broadcasts to ascertain who of your fellow pilgrims have departed for Havona since the time of your leaving Uversa. <sup><a href=\"#footnote-1\" id=\"footnote-ref-1\">[1]</a></sup>"
      ],
      "reflection": null
    },
    {
      "type": "psalm",
      "heading": "Responsorial Psalm",
      "citation": "Psalm 98:1, 2-3, 3-4 [2]                                                                             R. (cf. 2b) “Before the nations, you reveal the extent of your justice.”",
      "response": "",
      "verses": [
        "<p>“Sing out to God a new song – for all the wonders of creation. Salvation is in your right hand, your arm emanates with the holy.”                                                                                <strong>R. “Before the nations, you reveal the extent of your justice.”</strong>",
        "<p>“You announce your presence before the nations, revealing the extent of your justice. You have made your love and devotion know to the house of Israel.”  <br /><strong>R. “Before the nations, you reveal the extent of your justice.”</strong>",
        "<p>“All reaches of the earth saw your salvation. Shout out to God, all the earth! Break forth into joy and melody!” <br /><strong>R. “Before the nations, you reveal the extent of your justice.” <sup><a href=\"#footnote-3\" id=\"footnote-ref-3\">[3]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "second-reading",
      "heading": "Second Reading",
      "citation": "Urantia Part III. The History of Urantia, Paper 100- Religion in Human Experience, Section 5. Conversion and Mysticism, Paragraphs 7 – 11",
      "content": [
        "<p>100:5.7 (1099.5) In contrast with conversion-seeking, the better approach to the morontia zones of possible contact with the Thought Adjuster would be through living faith and sincere worship, wholehearted and unselfish prayer. Altogether too much of the uprush of the memories of the unconscious levels of the human mind has been mistaken for divine revelations and spirit leadings.",
        "<p>100:5.8 (1099.6) There is great danger associated with the habitual practice of religious daydreaming; mysticism may become a technique of reality avoidance, albeit it has sometimes been a means of genuine spiritual communion. Short seasons of retreat from the busy scenes of life may not be seriously dangerous, but prolonged isolation of personality is most undesirable. Under no circumstances should the trancelike state of visionary consciousness be cultivated as a religious experience.",
        "<p>100:5.9 (1099.7) The characteristics of the mystical state are diffusion of consciousness with vivid islands of focal attention operating on a comparatively passive intellect. All of this gravitates consciousness toward the subconscious rather than in the direction of the zone of spiritual contact, the superconscious. Many mystics have carried their mental dissociation to the level of abnormal mental manifestations.",
        "<p>100:5.10 (1100.1) The more healthful attitude of spiritual meditation is to be found in reflective worship and in the prayer of thanksgiving. The direct communion with one’s Thought Adjuster, such as occurred in the later years of Jesus’ life in the flesh, should not be confused with these so-called mystical experiences. The factors which contribute to the initiation of mystic communion are indicative of the danger of such psychic states. The mystic status is favored by such things as: physical fatigue, fasting, psychic dissociation, profound aesthetic experiences, vivid sex impulses, fear, anxiety, rage, and wild dancing. Much of the material arising as a result of such preliminary preparation has its origin in the subconscious mind.",
        "<p>100:5.11 (1100.2) However favorable may have been the conditions for mystic phenomena, it should be clearly understood that Jesus of Nazareth never resorted to such methods for communion with the Paradise Father. Jesus had no subconscious delusions or superconscious illusions. <strong><sup><a href=\"#footnote-4\" id=\"footnote-ref-4\">[4]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "alleluia",
      "heading": "Alleluia",
      "citation": "Urantia 166:2.8                                                                                                     R. Alleluia, alleluia.",
      "content": [
        "<p>“You see how it is that the children of the house, even when they are insubordinate to their Father’s will, take their blessings for granted. They think it a small matter if they neglect to give thanks when the Father bestows healing upon them, but the strangers, when they receive gifts from the head of the house, are filled with wonder and are constrained to give thanks in recognition of the good things bestowed upon them.” <strong>R. Alleluia, alleluia.<sup><a href=\"#footnote-5\" id=\"footnote-ref-5\">[5]</a></sup></strong>"
      ]
    },
    {
      "type": "gospel",
      "heading": "Gospel",
      "citation": "Urantia, Part IV. The Life and Teachings of Jesus, Paper 166 – The Last Visit to Northern Perea, Section 2. The Ten Lepers, Paragraphs 1 - 8",
      "content": [
        "<p>166:2.1 (1827.6) The next day Jesus went with the twelve over to Amathus, near the border of Samaria, and as they approached the city, they encountered a group of ten lepers who sojourned near this place. Nine of this group were Jews, one a Samaritan. Ordinarily these Jews would have refrained from all association or contact with this Samaritan, but their common affliction was more than enough to overcome all religious prejudice. They had heard much of Jesus and his earlier miracles of healing, and since the seventy made a practice of announcing the time of Jesus’ expected arrival when the Master was out with the twelve on these tours, the ten lepers had been made aware that he was expected to appear in this vicinity at about this time; and they were, accordingly, posted here on the outskirts of the city where they hoped to attract his attention and ask for healing. When the lepers saw Jesus drawing near them, not daring to approach him, they stood afar off and cried to him: “Master, have mercy on us; cleanse us from our affliction. Heal us as you have healed others.”",
        "<p>166:2.2 (1827.7) Jesus had just been explaining to the twelve why the gentiles of Perea, together with the less orthodox Jews, were more willing to believe the gospel preached by the seventy than were the more orthodox and tradition-bound Jews of Judea. He had called their attention to the fact that their message had likewise been more readily received by the Galileans, and even by the Samaritans. But the twelve apostles were hardly yet willing to entertain kind feelings for the long-despised Samaritans.",
        "<p>166:2.3 (1827.8) Accordingly, when Simon Zelotes observed the Samaritan among the lepers, he sought to induce the Master to pass on into the city without even hesitating to exchange greetings with them. Said Jesus to Simon: “But what if the Samaritan loves God as well as the Jews? Should we sit in judgment on our fellow men? Who can tell? if we make these ten men whole, perhaps the Samaritan will prove more grateful even than the Jews. Do you feel certain about your opinions, Simon?” And Simon quickly replied, “If you cleanse them, you will soon find out.” And Jesus replied: “So shall it be, Simon, and you will soon know the truth regarding the gratitude of men and the loving mercy of God.”",
        "<p>166:2.4 (1827.9) Jesus, going near the lepers, said: “If you would be made whole, go forthwith and show yourselves to the priests as required by the law of Moses.” And as they went, they were made whole. But when the Samaritan saw that he was being healed, he turned back and, going in quest of Jesus, began to glorify God with a loud voice. And when he had found the Master, he fell on his knees at his feet and gave thanks for his cleansing. The nine others, the Jews, had also discovered their healing, and while they also were grateful for their cleansing, they continued on their way to show themselves to the priests.",
        "<p>166:2.5 (1828.1) As the Samaritan remained kneeling at Jesus’ feet, the Master, looking about at the twelve, especially at Simon Zelotes, said: “Were not ten cleansed? Where, then, are the other nine, the Jews? Only one, this alien, has returned to give glory to God.” And then he said to the Samaritan, “Arise and go your way; your faith has made you whole.”",
        "<p>166:2.6 (1828.2) Jesus looked again at his apostles as the stranger departed. And the apostles all looked at Jesus, save Simon Zelotes, whose eyes were downcast. The twelve said not a word. Neither did Jesus speak; it was not necessary that he should.",
        "<p>166:2.7 (1828.3) Though all ten of these men really believed they had leprosy, only four were thus afflicted. The other six were cured of a skin disease which had been mistaken for leprosy. But the Samaritan really had leprosy.",
        "<p>166:2.8 (1828.4) Jesus enjoined the twelve to say nothing about the cleansing of the lepers, and as they went on into Amathus, he remarked: “You see how it is that the children of the house, even when they are insubordinate to their Father’s will, take their blessings for granted. They think it a small matter if they neglect to give thanks when the Father bestows healing upon them, but the strangers, when they receive gifts from the head of the house, are filled with wonder and are constrained to give thanks in recognition of the good things bestowed upon them.” And still the apostles said nothing in reply to the Master’s words. <strong><sup><a href=\"#footnote-6\" id=\"footnote-ref-6\">[6]</a></sup></strong>"
      ],
      "reflection": "<p>This teaching and miracle occurred near the end of February, 30 A.D., about seven weeks before Jesus’s murder and resurrection."
    }
  ]
}