{
  "slug": "c48-29th-sunday-of-ordinary-time-october-19-2025",
  "title": "– 29th  Sunday in Ordinary Time",
  "date": "Sunday October 19, 2025",
  "theme": "Discourse on Prayer",
  "year": "C",
  "heroImage": null,
  "sections": [
    {
      "type": "intro-reflection",
      "heading": "Initial Reflection – This Vermeer painting entitled The Geographer evokes the image of a person at least deep in thought, perhaps in even prayer, as Jesus describes it in the three readings of today and as the psalmist does as well.",
      "content": []
    },
    {
      "type": "first-reading",
      "heading": "First Reading",
      "citation": "Urantia Part IV. The Life and Teachings of Jesus, Paper 144 - At Gilboa and in the Decapolis, Section 2. The Discourse on Prayer, Paragraphs 1 - 4",
      "content": [
        "<p>144:2.1 (1618.5) “John indeed taught you a simple form of prayer: ‘O Father, cleanse us from sin, show us your glory, reveal your love, and let your spirit sanctify our hearts forevermore, Amen!’ He taught this prayer that you might have something to teach the multitude. He did not intend that you should use such a set and formal petition as the expression of your own souls in prayer.",
        "<p>144:2.2 (1618.6) “Prayer is entirely a personal and spontaneous expression of the attitude of the soul toward the spirit; prayer should be the communion of sonship and the expression of fellowship. Prayer, when indited by the spirit, leads to co-operative spiritual progress. The ideal prayer is a form of spiritual communion which leads to intelligent worship. True praying is the sincere attitude of reaching heavenward for the attainment of your ideals.",
        "<p>144:2.3 (1619.1) “Prayer is the breath of the soul and should lead you to be persistent in your attempt to ascertain the Father’s will. If any one of you has a neighbor, and you go to him at midnight and say: ‘Friend, lend me three loaves, for a friend of mine on a journey has come to see me, and I have nothing to set before him’; and if your neighbor answers, ‘Trouble me not, for the door is now shut and the children and I are in bed; therefore I cannot rise and give you bread,’ you will persist, explaining that your friend hungers, and that you have no food to offer him. I say to you, though your neighbor will not rise and give you bread because he is your friend, yet because of your importunity he will get up and give you as many loaves as you need. If, then, persistence will win favors even from mortal man, how much more will your persistence in the spirit win the bread of life for you from the willing hands of the Father in heaven. Again I say to you: Ask and it shall be given you; seek and you shall find; knock and it shall be opened to you. For every one who asks receives; he who seeks finds; and to him who knocks the door of salvation will be opened.",
        "<p>144:2.4 (1619.2) “Which of you who is a father, if his son asks unwisely, would hesitate to give in accordance with parental wisdom rather than in the terms of the son’s faulty petition? If the child needs a loaf, will you give him a stone just because he unwisely asks for it? If your son needs a fish, will you give him a watersnake just because it may chance to come up in the net with the fish and the child foolishly asks for the serpent? If you, then, being mortal and finite, know how to answer prayer and give good and appropriate gifts to your children, how much more shall your heavenly Father give the spirit and many additional blessings to those who ask him? Men ought always to pray and not become discouraged. <strong><sup><a href=\"#footnote-1\" id=\"footnote-ref-1\">[1]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "psalm",
      "heading": "Responsorial Psalm",
      "citation": "Psalm 121:1-2, 3-4, 5-6, 7-8 [2]                                                                  R.(cf. 2)  “My only help comes from God, the one who shaped heaven and earth.”",
      "response": "",
      "verses": [
        "<p>“I lift my eyes to the mountains. From where will my help come? My only help comes from God, the one who shaped heaven and earth, who made each crevice, who smoothed each stone.”<br /><a id=\"_Hlk208157732\"></a><strong>R. “My only help comes from God, the one who shaped heaven and earth.”</strong>",
        "<p>“God will not allow your foot to stumble; the One who watches over you will not drowse off to sleep. Behold! The Holy One does not slumber and dos not sleep, the one who nurtures Israel through its darkest nights. <br /><strong>R. “My only help comes from God, the one who shaped heaven and earth.”</strong>",
        "<p>“God is the one who watches over you, the shade under your right hand, whenever you move it up or place it down. By day the sun will not strike you, nor the moon weaken you at night.” <br /><strong>R. “My only help comes from God, the one who shaped heaven and earth.”</strong>",
        "<p>“The Upholder will protect you from every harm; the Eternal Shield will keep constant watch over your soul. God will guard your going out and coming in, from now until the end of time. Amen.” <br /><strong>R. “My only help comes from God, the one who shaped heaven and earth.” <sup><a href=\"#footnote-3\" id=\"footnote-ref-3\">[3]</a></sup></strong>"
      ],
      "reflection": null
    },
    {
      "type": "second-reading",
      "heading": "Second Reading",
      "citation": "Urantia Part IV. The Life and Teachings of Jesus, Paper 144 - At Gilboa and in the Decapolis, Section 2. The Discourse on Prayer, Paragraphs 5 - 6",
      "content": [
        "<p>144:2.5 (1619.3) “Let me tell you the story of a certain judge who lived in a wicked city. This judge feared not God nor had respect for man. Now there was a needy widow in that city who came repeatedly to this unjust judge, saying, ‘Protect me from my adversary.’ For some time he would not give ear to her, but presently he said to himself: ‘Though I fear not God nor have regard for man, yet because this widow ceases not to trouble me, I will vindicate her lest she wear me out by her continual coming.’ These stories I tell you to encourage you to persist in praying and not to intimate that your petitions will change the just and righteous Father above. Your persistence, however, is not to win favor with God but to change your earth attitude and to enlarge your soul’s capacity for spirit receptivity.",
        "<p>144:2.6 (1619.4) “But when you pray, you exercise so little faith. Genuine faith will remove mountains of material difficulty which may chance to lie in the path of soul expansion and spiritual progress.” <sup><a href=\"#footnote-4\" id=\"footnote-ref-4\">[4]</a></sup>"
      ],
      "reflection": null
    },
    {
      "type": "alleluia",
      "heading": "Alleluia",
      "citation": "Urantia 144:3.17 - 22 [5]                                                                                                    R. Alleluia, alleluia.",
      "content": [
        "<p>Jesus taught that effective prayer must be: 1. Unselfish — not alone for oneself. 2. Believing — according to faith. 3. Sincere — honest of heart. 4. Intelligent — according to light. 5. Trustful — in submission to the Father’s all-wise will.                                  <strong>R. Alleluia, alleluia.</strong>"
      ]
    },
    {
      "type": "gospel",
      "heading": "Gospel",
      "citation": "Urantia Part IV. The Life and Teachings of Jesus, Paper 144 - At Gilboa and in the Decapolis, Section 3. The Believer’s Prayer, Paragraphs 1 - 12",
      "content": [
        "<p>144:3.1 (1619.5) But the apostles were not yet satisfied; they desired Jesus to give them a model prayer which they could teach the new disciples. After listening to this discourse on prayer, James Zebedee said: “Very good, Master, but we do not desire a form of prayer for ourselves so much as for the newer believers who so frequently beseech us, ‘Teach us how acceptably to pray to the Father in heaven.’”",
        "<p>144:3.2 (1619.6) When James had finished speaking, Jesus said: “If, then, you still desire such a prayer, I would present the one which I taught my brothers and sisters in Nazareth”:",
        "<p>144:3.3 (1620.1) Our Father who is in heaven,                                                                                 144:3.4 (1620.2) Hallowed be your name.                                                                                    144:3.5 (1620.3) Your kingdom come; your will be done                                                                 144:3.6 (1620.4) On earth as it is in heaven.                                                                        144:3.7 (1620.5) Give us this day our bread for tomorrow;                                      144:3.8 (1620.6) Refresh our souls with the water of life.                                                      144:3.9 (1620.7) And forgive us every one our debts                                                       144:3.10 (1620.8) As we also have forgiven our debtors.                                                   144:3.11 (1620.9) Save us in temptation, deliver us from evil,                                144:3.12 (1620.10) And increasingly make us perfect like yourself.",
        "<p>144:3.13 (1620.11) It is not strange that the apostles desired Jesus to teach them a model prayer for believers. John the Baptist had taught his followers several prayers; all great teachers had formulated prayers for their pupils. The religious teachers of the Jews had some twenty-five or thirty set prayers which they recited in the synagogues and even on the street corners. Jesus was particularly averse to praying in public. Up to this time the twelve had heard him pray only a few times. They observed him spending entire nights at prayer or worship, and they were very curious to know the manner or form of his petitions. They were really hard pressed to know what to answer the multitudes when they asked to be taught how to pray as John had taught his disciples.",
        "<p>144:3.14 (1620.12) Jesus taught the twelve always to pray in secret; to go off by themselves amidst the quiet surroundings of nature or to go in their rooms and shut the doors when they engaged in prayer.",
        "<p>144:3.15 (1620.13) After Jesus’ death and ascension to the Father it became the practice of many believers to finish this so-called Lord’s prayer by the addition of—“In the name of the Lord Jesus Christ.” Still later on, two lines were lost in copying, and there was added to this prayer an extra clause, reading: “For yours is the kingdom and the power and the glory, forevermore.”",
        "<p>144:3.16 (1620.14) Jesus gave the apostles the prayer in collective form as they had prayed it in the Nazareth home. He never taught a formal personal prayer, only group, family, or social petitions. And he never volunteered to do that.",
        "<p>144:3.17 (1620.15) Jesus taught that effective prayer must be:",
        "<p>144:3.18 (1620.16) 1. Unselfish—not alone for oneself.                                               144:3.19 (1620.17) 2. Believing—according to faith.                                    144:3.20 (1620.18) 3. Sincere—honest of heart.                                                      144:3.21 (1620.19) 4. Intelligent—according to light.                                                      144:3.22 (1620.20) 5. Trustful—in submission to the Father’s all-wise will.",
        "<p>144:3.23 (1620.21) When Jesus spent whole nights on the mountain in prayer, it was mainly for his disciples, particularly for the twelve. The Master prayed very little for himself, although he engaged in much worship of the nature of understanding communion with his Paradise Father. <sup><a href=\"#footnote-6\" id=\"footnote-ref-6\">[6]</a></sup>"
      ],
      "reflection": "<p>His admonition to pray in secret is affirmed in the gospels. This with what Jesus taught about how prayer can be effective are well worth meditating on and assimilating into practice."
    },
    {
      "type": "first-reading",
      "heading": "First Reading",
      "citation": "Exodus 17:8-13 (Lectionary: 147)",
      "content": [
        "<p>In those days, Amalek came and waged war against Israel. Moses, therefore, said to Joshua, \"Pick out certain men, and tomorrow go out and engage Amalek in battle. I will be standing on top of the hill with the staff of God in my hand.\" So Joshua did as Moses told him: he engaged Amalek in battle after Moses had climbed to the top of the hill with Aaron and Hur. As long as Moses kept his hands raised up, Israel had the better of the fight, but when he let his hands rest, Amalek had the better of the fight. Moses' hands, however, grew tired; so they put a rock in place for him to sit on. Meanwhile Aaron and Hur supported his hands, one on one side and one on the other, so that his hands remained steady till sunset. And Joshua mowed down Amalek and his people with the edge of the sword.  <a href=\"#footnote-ref-1\">↑</a>",
        "<p></li><li id=\"footnote-2\"><p> After and inspired by Pamela Greenberg’s <strong>The Complete Psalms – The Book of Prayer Songs in a New Translation.</strong> <a href=\"#footnote-ref-2\">↑</a>"
      ],
      "reflection": null
    }
  ]
}