[
  {
    "id": "title",
    "type": "title",
    "voiceType": null,
    "text": null,
    "duration": 7,
    "note": "Silent title slide"
  },
  {
    "id": "intro-1",
    "type": "narrative",
    "voiceType": "narrative",
    "text": "Today we present an exploration of Master Physical Controllers and a case study examining how they use thought to control matter. This exploration draws from the Urantia Book as a revelation database, using the revelators' own words to tell the story.",
    "citation": null,
    "note": "Narrative introduction"
  },
  {
    "id": "mpc-title-pause",
    "type": "narrative",
    "voiceType": null,
    "text": null,
    "duration": 2,
    "note": "Silent pause before title"
  },
  {
    "id": "mpc-title",
    "type": "narrative",
    "voiceType": "narrative",
    "text": "Master Physical Controllers",
    "citation": null,
    "note": "Section title"
  },
  {
    "id": "mpc-overview",
    "type": "quotation",
    "voiceType": "quotations",
    "text": "The Master Physical Controllers are the direct offspring of the Supreme Power Centers, and their numbers include the following:",
    "citation": "29:4.4",
    "note": "CORRECTED from 29:4.13 - This is the correct citation"
  },
  {
    "id": "mpc-nature",
    "type": "quotation",
    "voiceType": "quotations",
    "text": "These beings are the mobile subordinates of the Supreme Power Centers. The physical controllers are endowed with capabilities of energy metamorphosis which enable them to engage in a remarkable variety of physical activities.",
    "citation": "29:4.1",
    "note": "CORRECTED from 29:4.14 - This is from the introduction to section 4"
  },
  {
    "id": "mechanical-controllers",
    "type": "quotation",
    "voiceType": "quotations",
    "text": "The mechanical controllers are competent to directionize the flow of energy and to facilitate its concentration into the specialized currents or circuits. These mighty beings have much to do with the segregation, directionization, and intensification of the physical energies and with the equalization of the pressures of the interplanetary circuits.",
    "citation": "29:4.20",
    "note": "CORRECTED - Note lowercase 'mechanical controllers' in original (mid-sentence)"
  },
  {
    "id": "frandalanks-intro",
    "type": "quotation",
    "voiceType": "quotations",
    "text": "7. <i>The Frandalanks.</i> These beings are the joint creation of all three orders of energy-control beings: the primary and secondary force organizers and the power directors.",
    "citation": "29:4.36",
    "note": "CORRECTED - Using actual UB text with italics. Previous quote was not from this paragraph."
  },
  {
    "id": "chronoldeks",
    "type": "quotation",
    "voiceType": "quotations",
    "text": "The frandalanks that register time in addition to quantitative and qualitative energy presence are called <i>chronoldeks.</i>",
    "citation": "29:4.37",
    "note": "CORRECTED - Using actual UB text with italics for chronoldeks"
  },
  {
    "id": "transition-tomb",
    "type": "narrative",
    "voiceType": "narrative",
    "text": "Having learned the nature and capabilities of the Master Physical Controllers, we now turn to a specific application: the tomb operations following the crucifixion of Jesus.",
    "citation": null,
    "note": "Narrative transition"
  },
  {
    "id": "tomb-commission",
    "type": "quotation",
    "voiceType": "quotations",
    "text": "At two forty-five Sunday morning, the Paradise incarnation commission, consisting of seven unidentified Paradise personalities, arrived on the scene and deployed themselves about the tomb. At ten minutes before three, intense vibrations of commingled material and morontia activities began to issue from Joseph's new tomb.",
    "citation": "189:1.1",
    "note": "Citation verified correct"
  }
]
